{
    "prof_info": [
        {
            "prof_name": "Brian Rakitin",
            "prof_id": 3131,
            "total_reviews": 27
        }
    ],
    "reviews": [
        {
            "course_name": "Science of Psychology",
            "review_date": "November 12, 2014",
            "review_content": "\nIf you have to take this course, it's fine to take it with Professor Rakitin. It will not be a fascinating course that makes you want to learn more psych, but it also won't be the bane of your existence. \nHe basically reads off slides that follow the book (with some slight modifications) and that are posted online beforehand. He can sometimes make funny comments that keep you awake but mostly goes through the material. The bright side is that the course is very organized with clear expectations. Since the slides are posted in full, there is not much of a need to always attend lecture either. \n\nWorkload:\nMidterm, final, 3 short responses to psych articles \n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "September 03, 2013",
            "review_content": "\nIf you're gonna take this class, take it with Rakitin. You can get an A without ever going (35% of the class gets an A- and up). Although he'll tell you that you need to go to lectures because not everything on the test will come out of the textbook, he's lying. Read the textbook sections 2-3 times, look over the slides, and get an A. Don't waste time attending class, use that time to read the textbook, do other work or take a nap. His lectures (the one I went to at least) are boring and unnecessary. If you can learn out of a textbook and you're looking for an easy A, I would recommend this class. While the readings are tedious and time-consuming, they are not difficult and the tests are extremely straightforward, essentially testing your ability to memorize the book.\nWorkload:\n6 credits of experimental participation, 3 one page written assignments (pointless, don't impact your grade; only 3.3% of your grade each), 3 noncumulative midterms (extremely easy, straightforward).\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "May 27, 2013",
            "review_content": "\nI love psychology and Prof. Rakitin's class is a good introduction to the subject. There are, however, a number of issues with his teaching style: (1) his lectures tend to be too focused on the topics HE wants to discuss; (2) they seem like a vinyl record played at the wrong speed (i.e. way too fast for any intelligible information to get through without you laughing at the \"funny voices\" coming from the phonograph), and (3) they provide little opportunity for those really interested in the subject to explore it further.\nWith this said, he is not the worst professor on Earth. He motivates you just enough to keep you interested and the occasional errors during lecture are more due to his delivery speed than lack of knowledge of the subject matter. He knows his stuff, for sure. He does deliver on a series of fronts and if you go to his lectures, you will do fine. It is true most exam questions can be answered after just reading the textbook, but the second part relies heavily on Prof. Rakitin's actual lectures. Attending them may well mean the difference between a B+ or A- and an A. His scaling formula for exams is okay, although he never explained how it works. (See below for a critique on his \"normalization\" of WA scores).\nRead the textbook and attend lecture, even if it is to take a good nap. One day, perhaps, you will be able to catch something useful from Prof. Rakitin's monologue. He gets a B+ for his teaching abilities.\nWorkload:\nExams: 3 midterms, graded on a mysterious scaling formula (third midterm offered as the final exam), consisting of two parts: the first part is entirely based on the textbook, especially material Prof. Rakitin did not cover during lecture (watch out for key concepts and their application to straightforward situations); the second part is mostly based on the lectures (not just the uploaded slides, but what he actually says in class). \nWritten Assignments: 3 two-page essays, pretty structured, about one of two assigned readings; the formula used to normalize grading among TAs (from 1 to 5) is absurd at best, unfair at worst (even if you get a 5, you will end up with a substantially lower score); beware, the TAs ask for a critique of one study presented in the articles, but do not specify that they expect you to read the ACTUAL research study, so you really need to read TWO articles to get a good grade. \nExperiments: 5% of the final grade is based on participation in 6 credits worth of experiments run by the Psychology Department (yes, we are the guinea pigs).\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "May 03, 2013",
            "review_content": "\nRakitin is a terrible, terrible professor. DO NOT TAKE HIS CLASS IF YOU CAN AVOID IT. I went to every lecture until halfway through the semester and was unable to stay awake during even one. His lectures are boring and taken exactly out of the textbook, so as long as you keep up with the reading and study the lecture slides before the exams you'll be fine. He leaves all the dirty work to his TAs- they grade your papers and exams, and he doesn't even show up on exam days. He is often rude to students who come in a few minutes late and shuts down questions when he doesn't want to answer them. I have since stopped going to lectures because I really get nothing out of them. I also came into the semester thinking about a potential psych major, and Rakitin has totally dissuaded me from his line of work.\nBottom line: if you want a class that is pretty easy and you can basically teach yourself the material, then go ahead and take this class. If you want an intellectually stimulating introduction to psychology, find someone else-- Rakitin is definitely NOT your guy.\nWorkload:\n3 written assignments, 2 pages each- based on articles that the TAs send you. Very doable. 2 midterms and a final, not cumulative. As long as you do the readings and review the lectures before each test, you'll be fine.\n"
        },
        {
            "course_name": "Statistics for Behavioral Scientists",
            "review_date": "April 16, 2013",
            "review_content": "\ni had rakitin for both science of psych and statistics for behavioral scientists.\nscience of psych is an easy class if you go to class. you won't have to do any hw except two short papers (very easy) and you can cram-read the textbook (just focus on terms; it's all term-based) before the midterms and final. it's a really interesting class and he's a very good lecturer.\nstats with him is different. his lectures are confusing. fortunately, the book he uses (levin & fox) is the most amazing statistics textbook or resource i have ever ever EVER experienced. it is incredibly clear and the only stats-book-video-resource-anything that focuses on conceptual learning\none thing about him is that his tests are usually poorly/confusingly-written. if you know the material well you should still be able to get a/a-, but you're leaving a little something up to chance\nWorkload:\nlisted above. science of psych: two midterms and final (non-cumulative), two papers (easy)\nbehavioral stats: problems sets weekly (easy), lab (annoying, but worthwhile afterwards), a midterm (easy) and a final (poorly written)\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "February 26, 2013",
            "review_content": "\nAVOID THIS TEACHER!!!! \nHe is basically an arrogant guy with lots of issues. He is cocky and tries to intimidate the students. He should be teaching in high school! He treats the students like monkeys and uses the class to feel good about himself. The guy needs some theraphy! He may know a lot about Parkinson's but he should study a little bit of biology, too!\nI got an A but I REAAAAAALLY REGRET having signed/paid for this class, and I WANT TO BE A PSYCH MAJOR!!!!\nWorkload:\nNot that much.\nHe tries to make the subjects more difficult than they are, making his classes pretty boring.The exams are easy, but he includes \"A+\" questions that are not covered in class, nor in the book!\n"
        },
        {
            "course_name": "Statistics for Behavioral Scientists",
            "review_date": "December 25, 2012",
            "review_content": "\nWhat a miserable man. Pompous, boring, and completely useless. He's so invested in making statistics seem REALLY HARD (and therefore making himself seem REALLY IMPORTANT) that all of his lectures needlessly obfuscate the actual. concepts and ideas that we need to learn.\nMidterm and final are easy if you do the homework, but going to lecture and asking him questions usually confused me much more than just looking at the textbook. Ask the TAs questions if you have to - Rakitin is useless. \nAttendance isn't mandatory for this class (not to lecture, at least), so you can pull a good grade and learn a lot of useful statistical knowledge without having to deal with this guy.\nWorkload:\nCompletely manageable. Weekly labs (usually doesn't take the full 2 hours), weekly homeworks (which are easy if you look at the examples in the books). Midterm was a little crazy but the final is very manageable if you keep up with your homework, and you get a cheat sheet for the final exam.\n"
        },
        {
            "course_name": "Statistics for Behavioral Scientists",
            "review_date": "November 11, 2012",
            "review_content": "\nBrain Rakitin is obviously a smart guy to have gotten where he is right now, but in no way can he be associated \"passable\" or even \"competent\" as a teacher. He may be very familiar with the material he's teaching, but he has no clue how to convey information. He tends to explain simple, straightforward concepts in the most convoluted way possible, making the material seem difficult at first, but anyone who has taken any sort of stats would know that this class only covers the easy basics. He is also unnecessarily mean as a person, doesn't allow absences, food or lateness in his class, and talks to us as if we were totally incompetent as people to learn the greatness that he is teaching.\nThis class is tolerable because the material is easy, I've gone to class three times and regretted all of them. He has a weird way of making the exams excruciatingly long; very little people were able to finish the midterm, and there were a lot of short answer questions without proper instructions, so people tended to write everything they knew and he would claim that those weren't the things he was looking for. \nI am a junior in neuroscience and premed, and from all the professors I've had at Columbia, I tend to think Brain Rakitin definitely brings down our quality of education. Don't get me wrong, I got an A, but taking this class put a damper on my semester, and I was taking orgo and neurobio at the same time. I urge you not to take this class, take an easier and better stats class for your psych/neuro requirement, just so you won't have to feel having wasted two hours of your life every time you walk out of class.\nWorkload:\nWeekly problem sets - easy, but a lot of writing and not a lot of math.\n1 midterm - no idea who wrote it, whomever did it obviously did not know there was a time limit on the midterm\n1 final - passable\n"
        },
        {
            "course_name": "Statistics for Behavioral Scientists",
            "review_date": "January 25, 2012",
            "review_content": "\nUm, why does this man have a silver nugget? I took both Professor Rakitin's Science of Psych and his Statistics for Behavioral Scientists class and I have two words for this man: dry and arrogant.\nSCIENCE OF PSYCHOLOGY\nI remember sitting through his first lecture and thinking \"Maybe I'm only bored because this is the introductory stuff. Maybe it will get better.\" It doesn't. Like me, 2/3 of our class realized this and the room went from being overfilled on the first day to having maybe 1/3 of the chairs filled during lectures. For the portion of the lectures I did attend, I believe I fell asleep for around half of them. The most interesting day was when the TA taught in Rakitin's place.\nRakitin is also terrible at explaining things. When he attempted to explain to us how the eye worked, he managed to confuse the class even more --he messed up on the first try, corrected himself on the second time explaining (a separate day), and again corrected something he said on the second day during a third time of explaining (yet another day). Do not ask this man a question unless you want to get throughly confused and/or talked down at. He feels the need to go through every little detail when answering questions and ends up answering in such a winding fashion that you forget what you initially asked. \nThe only good thing about this class was the textbook, which was fantastic and probably the only reason Rakitin has a silver nugget. If you carefully read the textbook and skim the slides for the final, you're in good shape for the exams.\nSTATISTICS FOR BEHAVIORAL SCIENTISTS\nIt was a sad, sad day when I realized that Professor Rakitin was the only professor for that semester who was teaching this required class for Psychology majors.\nIn all fairness, this was his first semester of teaching this course, and he told us himself that he thought the textbook was horrible and had a hard time following it. With that said, his droning lectures got even worse when one inserted Statistics into the equation because of his insistence on going through the proofs for most equations. While helpful, Rakitin didn't seem to understand that he was talking to an audience of Psychology/Neuroscience majors who couldn't care less what the proofs were. What's worse is that he would often mess up on those proofs and confuse students even more. Confused professor + non-math*confused students = disaster!\nHomeworks and exams (probably because the problems were so easy) were graded pretty harshly, and often points were taken off for seemingly arbitrary reasons. For example, if you did a summation and divided it, and did this: (1+2+3+4+5)/5=3, you would get points off because they would want you to list ALL steps (1+2+3+4+5)/5=15/5=3. You should still be able to scrap an A-range grade in this course if you study a decent amount, but this course with this professor is honestly just not worth your time. \nIf you have taken any real math/statistics course at Columbia, you should probably avoid this course at all costs in case you (1) get bored out of your mind or (2) get destroyed for showing the amount of work you are used to showing or (3) both. If you haven't taken a real math/statistics course at Columbia, then you should go take one because you certainly aren't learning any math in this one.\nWorkload:\nSCIENCE OF PSYCHOLOGY\n- 3 exams - relatively easy if you study moderately\n- 3 papers on random psych articles, semi-arbitrarily graded (compensates for easy exams...)\n*Note: 3rd exam non-cumulative and takes place of final\n- 6 points of experimental participation\nSTATISTICS FOR BEHAVIORAL SCIENTISTS\n- Weekly assignment, not terribly bad but graded somewhat harshly unless you meticulously show every little step of work (i.e. if you have taken Calculus and use similar steps such as adding & multiplying all numbers together at once you will get points off)\n- Midterm & final (cheat sheet allowed) - reasonably difficult but OK if you study a moderate amount\n- Lab sections - these were pretty torturous... everyone was scrambling to figure out how to use SPSS and often the TAs were even confused about why SPSS was having problems on a certain computer \n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "April 27, 2011",
            "review_content": "\nLet me offer two ways to approach whether or not you should register for this course:\n(1) sign up, buy the book, meet with your TA (it's mandatory), compete the three short essays, take the three midterms,  participate in a few psych experiments, and get an A...all without ever attending the class.  You absolutely do not not need to ever show up.  The book is easy to read and actually interesting.  You'll see why in point #2 why point #1 makes so much sense.\n(2) The lectures are boring and confusing.  The overheads are filled with mistakes.  The professor is okay, a nice guy, but he contradicts what's in the book so you're never quite sure how to answer a question on the midterm...based on his info or the book's info.  \n\nWorkload:\nWeekly reading, 3 short essays, 3 multiple choice midterms, oh and the mandatory TA meeting and 6 credits of psych experiments.\n"
        },
        {
            "course_name": "Statistics for Behavioral Scientists",
            "review_date": "January 28, 2011",
            "review_content": "\nAlthough this teacher is an ok guy, his lectures are confusing and it makes you suffer through the semester.\nHe uses different terms than the book so after having 5 variables called sigma your brain will start to spin.\nHe always mixes up terms and aknowledges it but I think he should pay more attention to this because it gets annoying.His slides are somewhat helpful but they are sloppy and have a lot of errors in them. When you review them you have to guess how he solved the problems because he skips steps and abbreviates a lot of terms so you have to go back to the TA or the book in order to study from there.\nThe lab section is good if you have a good TA but at the end they have to guess what the teacher might ask in the exam,so the anxiety level rises inside of  you as the semester continues.\nHe gives a few Behavioral examples here and there but nothing that makes you think that a normal Statistics course would not give you . Even the book is just a huge Stats book, not much about Psychology mentioned.\nThis class lacks passion and didactic methods so it makes the dry topic even dryer. Personally, I did not enjoy this class.\nThe midterm was unfair because he only gave a limited ammount of time to solve it and many did not finish it. It had also a lot of theoretic questions although the TAs had only prepared us for solving numeric problems.\nThe final was almost only math and some short answer questions. \nWorkload:\n2 exams. Around 10 homeworks and 10 labs\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "October 13, 2010",
            "review_content": "\nBy far the worst Professor I have ever had.  I did not feel comfortable approaching him about anything. All he does is read his powerpoints in a monotone or at times angry voice, these presentations are just outlines of the reading not having any more information then the textbook and is posted on coarseworks before the class.  \nFortunately, the textbook is pretty interesting and is basically all you need to know for the exams.  Make sure to memorize key terms and people in the field and experiments explained in the text.\nTry to take this class with ANY other professor.\nWorkload:\nMinimal, just heavy readings.  There are alot of pages but is thankfully very interesting.  3 Midterms. \n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "July 25, 2010",
            "review_content": "\nRakitin is...meh.  There's nothing necessarily bad about him, I guess, but nothing great either.  The course is entirely based on the readings, which are lengthy.  His lectures consist of him angrily reading his powerpoints, which come directly from the readings, so there is really no reason to come to class if you are doing and understanding the readings.  Most people caught on to this by the second week; only about 30% of the class came to lectures, and of those, 80% were on facebook.  Though he is willing to answer questions, generally the only interaction with the class was Rakitin angrily dealing with the one GS student who always asked obvious questions. Also, even though there were over 120 people in the class, there were somehow no discussion sections.\nWorkload:\nlong, boring-ish readings\n3 short papers in which you analyze a psych experiment\n3 non cumulative exams that are mc and short answer\n6 credits of psych experiment participation\nfair grading\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "May 24, 2010",
            "review_content": "\nProfessor Rakiting is probably one of the nicest professors I've ever had. His lectures are pretty decent, depending on the material. If it relates to a topic he knows a lot about (aka does research on), the lecture is AMAZING. Other times, it's bleh... Probably going to about 50% of the lectures (like going to the latter lecture of every week) is your best bet. He has a really good sense of humor and is extremely helpful in answering questions. If you have any extra questions, ask him after class and he'll be happy to help you.\nThe book he uses is awesome. Granted, it is a bit long, but out of all the Science of Psych textbooks, is is by far your best option. Like a past reviewer said, if carefully you read and take notes on the book, you're pretty much set for the class and his exams. \nWorkload:\n3 2-page papers\n3 Exams (No cumulative exam)\nParticipate in 6 credits worth of experiments\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "May 15, 2010",
            "review_content": "\nRakitin is a perfectly good professor, though I don't like the way he lectures and thus found his classes painful to sit through. Problem solved: I stopped going to class. I attended maybe 30% of the lectures and passed the course with an A; simply keep up with the reading and you can, too. \nLectures: pretty much straight out of the book; you can always review them on CourseWorks (they're very straightforward).\nOffice Hours: he held ours in the lecture hall 30 minutes prior to class. Terrible setting, though you could always email him to schedule something better.\nExams: Moderately difficult, part multiple choice and part fill-in-the-blank\nWritten Assignments: analyze three articles and write a 2 page paper on each. Not hard.\n\nWorkload:\nTextbook chapters take a while to read; I recommend you take notes so as to not screw yourself over for exams\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "April 26, 2010",
            "review_content": "\nAt times he has very interesting topics at hand and he discusses in a very logical and critical way of thinking. \nHowever, sometimes he explains the materials in a way too academically--using lots of complex sentences in \na very fast manner that unless he addresses slower I can't understand. This is very important to me: \nif I can't understand well, why come to class? \nBut I know from inside that he is a good teacher; I just don't understand him well.\nThe textbook \"Psychological Science\" by Gazzaniga is a very good book to read, by the way. Always get me\nspending time for the reading for about six hours in a row (of course during the exam season, but that helps me A LOT\nto stay focused.) The book covers all you need to know as the broad picture of psychology. It always is supports\nby rich amount of researches--making the materials more scientific. Also the real-world psychology sections are\nreal punches.\nWorkload:\n3 Writing Assignments.\n6 Credits of research participation (three hours in sum)\n3 Exams--one of each covers 4-5 independent chapters of the book.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "August 23, 2009",
            "review_content": "\nHe's kind of a dick. The being said, he teaches the class fine. There's not much to say about him since it's such a big lecture. His powerpoint presentations follow the book to the letter, with some additional stuff he covers because it relates to his own work. He says \"Come to lecture because it's not all covered in the book,\" but that's not really true.\nI passed the class with a B, read most of the book, attended 50-75% of the lectures (and fell asleep in several of them), and just took the practice exams on the textbook website and made notes the day before the exams to study (didn't take notes in class). The usefulness of lectures like his are to basically repeat what you just read so that you remember it a bit better. The final isn't cumulative, so you only have to study one chunk of the book for each test.\nYou'll be required to meet with your TA once or twice, not really a big deal. If you're good at science but not majoring in it, and want a good science requirement, this is a good class with not that much work and a pretty good payout in terms of what you learn from the textbook.\nIf anything, I'd rate the textbook, and say it's really good for an intro to psych. Covers a HUGE range of material, and I appreciate what I learned from the class, and kept the book for future use.\nWorkload:\npsych experiment participation; three assignments which were to read an article, and summarize it following some guidelines; three \"midterms\" (no cumulative final) that were not too difficult or easy. being an intro class, it's designed for you to be able to pass. it'd be pretty difficult not to.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "May 17, 2009",
            "review_content": "\nProfessor Rakitin was a great guy. He has a unique sense of humor that you get used to after a while. He is very knowledgeable and is good at getting the pertinent information across. This is a great class for fulfilling the science requirement. With a little effort, an A is not hard to get.\nWorkload:\n3 homeworks(10%)--not hard. 3 tests-- first worth 25% second and third 30% each (and the last one is technically a final but it's not cumulative!) 3 hrs of psych study participation (5%)\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "January 13, 2009",
            "review_content": "\nA very good professor in that he will teach you the basics of psych and its different subfields, and is fair enough not to scare away humanities types. Like below reviews say, his lectures are pretty much straight from the textbook, but you definitely still need to go because he adds in stuff that's on exams. It's true he's kind of pompous and obnoxious, but he explains things very clearly and will always clarify if asked. \nOne thing that's great is he always leaves time to take questions during lecture, which are both interesting and helpful. \nExams are tricky but curved generously; written assignments are a joke. All in all, if you do the reading (not that heavy), go to lecture, and study a moderate amount, you will learn psychology basics and get at least an A- (I did and I'm an English major). Definitely recommend whether you're looking to fulfill science requirement or get into psych. \nWorkload:\n3 exams, 3 easy and short written assignments, experiment participation. 1-2 chapters of reading each week. \n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "December 29, 2008",
            "review_content": "\nRakitin is a fine professor. As far as Sci of Psych professors go he is pretty good.  He presents the materials ok. His lectures are basically a dumbing down of the book, which you will be tested on it its entirety anyway, so there is almost no point in going to lecture. He is obviously very interested in his field and misses no opportunity to talk about his work with Parkinson's disease, so if you are into that kind of thing, great. The book he uses is very interesting, though, which is a plus. The truth is that it is not a very hard course and I wish we had learned more, but that's life. \nWorkload:\nVery little. 1 Chapter of reading per week which you really only have to do before the exams. 3 written assignments which involve reading a fairly straightforward psych article and writing a 2 page review. Also you have to do 3 hours of participation in psych experiments which I think is just cool anyway. The tests are basically spitback out of the book so make sure you read it. \n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "December 10, 2008",
            "review_content": "\nHe teaches directly out of the book, so no need to go to class, which is always a plus. When I did go, however, he was a moderately good lecturer. The textbook is mildly interesting to very interesting so even though the chapters are long, the reading is easy and entertaining. The writing assignmnets are a joke and take like 20 minutes each. Exams are pretty easy and very straightforward, but take quite awhile to study for (we go through an entire textbook in one semester). The online quizzes provided by the text are quite useful. Painless way to fulfill science requirement. Experimental credits easy and painless too, just don't procrastinate too much. \n35% get an A for the course, take that as you will.\nWorkload:\nthree joke assignments\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "March 24, 2008",
            "review_content": "\nProf. Rakitin is a pretty solid guy. His lectures are organized and structured, and he posts them (along with his own additional notes) to CourseWorks. The material is pretty basic and almost all of it can be found in the textbook (which I highly recommend you read since half of his exams are based entirely on the material discussed in the book). In general, his exams aren't too hard; if you really focus on the terms and definitions presented in the textbook, and have a fair understanding of the material discussed during his lectures, it really isn't bad at all. His exams are half multiple choice (from textbook) and half matching/fill-in-the-blank (from the lectures). I managed to get an A on all three exams. The papers, on the other hand, are a different story. The TAs use a tricky grading system (that I never quite mastered) that had me bouncing from an A- on the first paper, to C- and a D+ on the next two. But don't worry, it's still possible (to which I can personally attest) to receive an A in the class, even if you do incredibly poorly on the papers (as I did). I recommend taking this course; you can satisfy the science requirement, as well as, the introductory requirement of the Psychology major.\nWorkload:\n3 exams (2 midterms and a final); 3 papers (2 pages in length); mandatory experiment participation (6 credits worth).\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "January 17, 2008",
            "review_content": "\nThe two old reviews in CULPA do not do Brian Rakitin justice at all. Rakitin was probably one of the best/most conscientious professors I've had at Columbia thus far. It shows that he prepares meticulously for classes, and he's never late. He makes jokes during class too which are sometimes funny, and he answers a lot of questions during and after class; if he doesn't know the answer he's honest and tells you he doesn't know the answer, but he's the kind of prof that will look it up for you and give you the answer next time. Occasionally he shows hilarious or chilling videos that make you want to be a psych major or a minor at least. One down side was that the TAs weren't so great but I don't think that's his fault. Grades aren't harsh at all and turn out to be more generous than he threatens they will be--if you go to class and do the work you'll be fine. I definitely recommend his class. take it.\nWorkload:\nthree exams, not cumulative, and three really short unnecessary, inconsequential essays.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "December 23, 2007",
            "review_content": "\nI don't know where people get off bashing Professor Rakitin. He manages to make an introductory lecture engaging and fun. And even if you're a little bored by the material on occasion watching his giant, curly ponytail is highly entertaining.\nAll of the lectures (in very clear powerpoint format) are posted on CourseWorks. There are more than enough TAs to answer any questions you could have and Rakitin himself stays behind after class to field tons of inane queries from students.\nIf anything, Rakitin is too kind and open, being overly patient with redundant and plain old stupid questions from students during his lecture.\nIt's a great intro course and a pain-free way to fulfill the science requirement.\nWorkload:\n3 Exams and 3 written assignments as well as weekly reading (1 chapter a week).\nThe tests are mostly multiple choice and scaled, if you do the reading and study for them you should get AT LEAST a B/B+ easily. The writing assignments require more attention to detail and are a little harder to understand.\nThat said, about 1/3 of the class gets As, so it's not that bad.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "December 09, 2007",
            "review_content": "\nIgnore the previous two reviews.  Rakitin gives 35% A's, and rarely fails people, which is saying something in a class of 200 that fills up every semester.  I was initially predisposed to judge him harshly because he has a ponytail down to his derriere and because his first lecture seemed too close to the text, but I was completely wrong.  He's one of the most articulate people you will ever meet and his lectures get more fascinating every week.  You won't want to miss them.  The tests aren't bad at all because they only cover what's in the textbook, and there's virtually no graded homework.  The final is just another unit test (no cumulative test) and anyway the material covered in his class offers so much insight into the human mind that you'll wish they'd drilled it into you more heavy-handedly.  I've never gone to one-on-one with him but I hear he's great.  A word of advice, though; get the three hours of experiment participation out of the way early so you don't end up doing shock experiments at the hands of grad students on a Saturday night on the weekend before finals, as I did.\nWorkload:\nThree scantron tests, each covering five or less chapters of the textbook verbatim, three written assignments each two pages double spaced, three hours of participation in graduate research due at the end of the semester\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "May 08, 2007",
            "review_content": "\nI will write a more detailed review when I have more time but I advise that you stay away from this class. Above review is fairly accurate. He almost seems as if his aim is to trick you on these exams.  I walked into the first exam feeling very prepared, however the questions are on very specific details that he often did not even cover during lecture.\nMy guess is that he has no interest in teaching and is here for his research.  This class lowered my GPA significantly.  Stay away!\nWorkload:\nSame as stated in above review.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "December 27, 2006",
            "review_content": "\nProfessor Rakitin is a nice guy.  No, really, he is.  You just won't find it in the class room.  Rakitin likes to berade his students when they're late (as he should).  But his lecture style is a little rough.  He has an aggressive personality in front of the class.  If you visit him during office hours, you'll see him more laid back and understanding.  He'll walk you through what you missed on an exam and why.\nWarning: his exams are impossible.  Through speaking to many of my student peers, we found his exams might have well been written in Greek.  The questions are asked in such a puzzling way that study guides from the textbook will never have you prepared.  The answers to the test questions are just as perplexing with caveats built into True/False statements.  The textbook readings are dense, and Rakitin only skims the surface of these chapters.  If you don't read and memorize and somehow think like he does, you'll lose out on the exam.  Even with a curve, this class is just too hard under his leadership to excel in overall.  If you're taking this to fulfill a core, may the force be with you.\nWorkload:\n3 two-page pagers, mandatory research participation, three impossible exams (graded on a curve with easy extra credit)\n"
        }
    ]
}