{
    "prof_info": [
        {
            "prof_name": "Alexander Madva",
            "prof_id": 5768,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 08, 2011",
            "review_content": "\nAlex is a great guy, and this class was pretty cool. \n1) Pop quizzes - He gave some pretty tough pop quizzes. This assured that you had to read and helped out those kids that did all the work but were just too shy to participate in discussion. The questions could be pretty obscure, though, but he was fair about it. If everyone only got 4 questions right, he knew the quiz was too hard and took that into account.\n2) Discussion - Here's where I had the problem. He's a great and funny lecturer, and had our class let him meander, he would have explained most of the texts to us really well. He didn't, however, have the capabilities to reign in the class when it got really off topic. Partially, I think, because he was interested in our opinions. However, we didn't utilize the texts as much as we could've (it got better towards the end) which made the midterm/papers a little harder.\n3) Papers - I think he is a fair grader. He requires that you get feedback from him on your theses, which was kind of annoying, but helped me find my way in all my papers a little bit better. I reccommend coming up with your topic on your own, because he got really excited for my third paper because it was an idea he hadn't ever thought of. \n4) Exams - Make sure you know the difference between different philosopher's thoughts. This really killed me on the exams, and I don't know if it is just the class or Alex's grading itself, but if you don't know who to attribute an idea to, it's almost better not to use it. \n5) Reading - He trimmed a LOT of the reading, which was fabulous!\nOverall, Alex is a fair and understanding teacher. Maybe I didn't get as much out the reading as I could have, but he made sure to engage every student in the discussion, and on days when we did really focus on the text, I got a lot out of it.\nWorkload:\npop quizzes over the reading, 3 papers, 1 midterm (which was only 15% of the grade), 1 final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "August 08, 2011",
            "review_content": "\nI had Alex for all of my freshman year and at first I was disappointed with his teaching. I expected someone much more experienced at teaching. But by second semester I really grew to appreciate his willingness to help his students. Unlike other teachers who are terrible teachers and put you to sleep in class, Alex really puts effort into becoming a better teacher. He is not a hard grader and is always open to meeting up with you after class to discuss how to approach and write your paper. If you take his class, you most likely will not regret it. \nWorkload:\ntypical lit hum workload\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 18, 2011",
            "review_content": "\nI had Alex for a year, so I haven't really been exposed to too many other profs. That being said,\nif you are lucky enough to get Alex for Lit Hum, do yourself a favor and take it. Out of the 10 teachers I\nhad freshman year, I'd say he was probably the best.\nEngaging discussion, most of the people participate, and Alex knows exactly when\nto jump in when discussion is sparse. He also is very 'forgiving' on comments; even if you give a chip shot comment, \nhe'll be kind enough to acknowledge it and, even if you're wrong, at least consider your point of view. On the major spectrum I'm pretty far from anything english/classics or philosophy related, but i must say that the philosophy aspect of this class was really great. doesn't hurt that Alex is a philosophy phd student himself, and this definitely adds to the discussions. \nThere are reading quizzes (on average once a week, but I don't think we had even one the last few weeks). this may be different from most other classes, but the quizzes (especially when we go over them as a class) surprisingly provide good topics for papers or exam essays. plus, the quizzes go into a huge eclectic cauldron of 'participation' so if you participate well in class, attend most of them, and do most of the extra credit opportunities (of which there are a lot)\ngreat instructor. great class.\nincredibly different than your high school ap lit class\nWorkload:\nweekly readings, he gave the minimum (i.e. only the required texts) because he thought that crunching in 15 texts a semester would stifle discussion. very reasonable midterm and final, you would have had to not attend class in order to be clueless on them. occassional reading quizzes that really don't sound as bad as they are. \nparticipation (15%), 3 papers (45%), midterm (15) and final (20)\n"
        }
    ]
}