{
    "prof_info": [
        {
            "prof_name": "Donlin Foreman",
            "prof_id": 718,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "modern dance 3",
            "review_date": "February 05, 2009",
            "review_content": "\nDonlin is extremely passionate about dance. I admire his devotion to his work, but for me personally, the class was too \"touchy-feely\". We didn't get to actually DANCE (i.e. move around) - it felt like a beginner's dance/yoga class to me. Be prepared to dance with lots of EMOTION!\nWorkload:\nNada\n"
        },
        {
            "course_name": "modern dance 3",
            "review_date": "February 05, 2009",
            "review_content": "\nDonlin is extremely passionate about dance. I admire his devotion to his work, but for me personally, the class was too \"touchy-feely\". We didn't get to actually DANCE (i.e. move around) - it felt like a beginner's dance/yoga class to me. Be prepared to dance with lots of EMOTION!\nWorkload:\nNada\n"
        },
        {
            "course_name": "Solo Repertoire",
            "review_date": "December 17, 2006",
            "review_content": "\nDonlin is a very dedicated teacher. Though, oftentimes, his intensity can be a little intimidating, he is quite willing to work with students as long as they are willing to put in the same effort. His criticisms might seem rather harsh to those who are not accustomed to his bluntness, but he is honest about what needs work, so the student may as well make use of the additional awareness. During the term, Donlin came in on weekends to work with students individually - it is VERY rare for a teacher to be willing to give that much to a class. \nWorkload:\nOutside studio time during nights and/or weekends is expected, and a journal of choreography and commentary. \n"
        },
        {
            "course_name": "Modern V",
            "review_date": "November 18, 2004",
            "review_content": "\nDance does not need to be your life for Donlin to appreciate your work in class.  All that is required of you is that you show up, listen to and try to incorporate his suggestions, and actually work to improve your technique.  If you were interested enough in the class to sign up for it, you should be able to do that.  If you actually care about this class and it shows, you will love it and Donlin will love you.  He is gentile, helpful, and kind; a rare combination in a teacher who comes from a rather strict discipline (in this case, Graham).  Yes, he will deliver one or two soliloquies each class, but they can be interesting (sometimes) and it's worth listening to them.  I loved his class and would certainly take it again as I feel he helped me quite a bit with my modern technique.\nWorkload:\nYou're kidding, right?  Just work hard when you're in class and keep the combinations and critiques in your head.\n"
        },
        {
            "course_name": "Modern ",
            "review_date": "November 21, 2003",
            "review_content": "\nCAUTION. go to the first class if you don't love it, then run away!!! if you do not want to devote yourself and every inch of your being to Graham technique then don't take the class.  he plays MAJOR favorites. and if he likes you, then lucky you, otherwise he will just drive you nuts! he'll remind you a milion times that this style of dance is his life and a way of life and bla bla. he's just a  diffcult person. \nWorkload:\nu (MUST) practice the series and have them perfect otherwise he will get on your case\n"
        },
        {
            "course_name": "Modern V, Solo Rep, Composition",
            "review_date": "November 18, 2002",
            "review_content": "\nDonlin seems to be either loved or hated by his students. I generally love him, but he certainly has his despicable moments. Basically, if he feels like you're working hard and he feels like you trust him (ie. when he gives you a correction you aren't questioning the validity of the comment and rather just trying to apply it), he will treat you well and shower you with attention. If you happen to be thin, have nice legs, or a flexible back, you'll be even more adored. However, if you don't seem to be making an effort to learn the style and spirit of Graham technique, seem bored or annoyed by the class or him, or come late or seldom to class, he will not respect you. Occasionally, he can be really nasty to a student, but this is generally the release of some pent-up aggression or when he feels like the thing he loves (dance) is being disrespected. Be warned that Donlin's class will probably not make you sweat. The first half is spent on the floor doing the Graham floorwork. There are seldom new movements or exercises. The idea of the class is not to develop a breadth of movement, but a depth of it. As for Solo Rep or Comp with Donlin, let me say that his strengths are in cleaning dances. He is very good at taking something and making it better. The main frustration in taking Comp with him was that he never really taught us how to create something from nothing, focusing instead on making something better from an existing work.\nWorkload:\nNothing unexpected.\n"
        },
        {
            "course_name": "Modern III, Dance Composition",
            "review_date": "October 16, 2002",
            "review_content": "\nDonlin is an amazing teacher. He is right that his classes are not \"dancy\" but they expose you to someone who really loves dance and all its applications. He does not enjoy people who are just in the class for whatever reason, because it's pointless for him and he cannot understand why you wouldn't want to dance. But he is a sweetheart and very helpful, and never puts people down. Some people may be intimidated but soon they learn that he is really hoenstly trying to help every individual and takes the time to see people's strengths and weaknesses. The only problem is the vast amount of showoffs in his classes trying to get into his company.\nWorkload:\nnone\n"
        },
        {
            "course_name": "Ballet II, Modern I",
            "review_date": "October 17, 2001",
            "review_content": "\nDonlin, a former dancer with Martha Graham's modern company and the co-owner and choreographer of his own company, is passionately in love with what he does for a living. You don't have to be a prima ballerina to do well in his class, but he demands two things of his students at every level: understand the functions of your body and SMILE. If he sees you looking tired or bored, he's not above crawling around on the floor and barking like a dog or making you waltz with him just to make you laugh. He's a very sweet guy who gives everybody a hug and a kiss on the cheek at the end of the semester and from then on makes you feel like you're some famous dancer every time he sees you. Take his class.\nWorkload:\nNo homework, obviously, but he'll give you a good workout in the studio. \n"
        }
    ]
}