{
    "prof_info": [
        {
            "prof_name": "Mark Watson",
            "prof_id": 3939,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "July 01, 2011",
            "review_content": "\nMark is the best professor I have met so far. He is good at teaching, he knows the stuff of the class, and most importantly, he truly cares about the students. He wants to really communicate with us, and he successed. He is very considerable for students' need. When I ask for discussing my paper with him, he not only agreed, but carefully read my paper before we meet. The discussion turns out to be very helpful for me, and I really apperciate his efforts. He also brings us a new perspective to art. I was never good at drawing but I like appreciating art. Through learning from him, I got to know how to look at art in a critical and analytical way, and found the possible message the artist is trying to convey. \nIn general, Mark Watson is an outstanding and excellent professor, and I feel really lucky to have taken his class. \nWorkload:\nBecause it's summer, we have three paper, and that's it. Although the length is 6-7 pages, which is challenging for art paper. \n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 24, 2009",
            "review_content": "\nMark Watson is one of those graduate students who wants to avoid miserable and dry classes. This makes him very motivated to make the class interested, and he succeeds at it. \nBeing an Art History graduate student, he really loves dealing with the big ideas behind the world of art. He is aware of the limitations of Art Hum, and works around them by encouraging dynamic and engaging classes. \nHe had trouble holding back his opinions on Anarchism, modernism and the \"art academies\" which was wonderful, since we all enjoyed thinking about it all from our own perspective, deprived of an undergraduate major in Art History (if im not mistaken.)\nOverall, a good guy and a potentially fulfilling class.\nWorkload:\nNormal amount, three essays with exotic prompts (very good ones), some sketches, and field trips good preparation for the required midterm and final. Don't take his class if you want a brainless course, your presence will make it harder on him and on others who are actually interested in retaining some of the course and what Mr. Watson offers.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 21, 2009",
            "review_content": "\nReally cool, laidback PhD student in the department. I learned a lot and was actually challenged. He's young and really receptive to student comments in the discussion, even if they are dumb. But he tries to elevate the discussion and if you bite back, class can actually be really, really interesting. He's receptive to e-mails, and I really enjoyed him as my professor. We went on a class brunch at Campo at the end of the semester, too, which was nice (and free!) You will definitely leave this class with knowledge you can take away except perhaps if you're already a serious art history student.\nWorkload:\nDecent amount, but manageable. Three papers, midterm, final, two field trips. Seems like an easy grader, but put effort in and he gives great comments on papers. Started discussion postings weekly, but abandoned them early on when he realized they were useless. \n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 19, 2009",
            "review_content": "\nA great professor! Understands the realm of art thoroughly and makes his classes very enjoyable. Although it is hard to choose professors when taking art humanity, stick with him if you do. Class participation recommended.\n\nWorkload:\n3 papers, occasional written discussions, 1 mid-term, 1 final. \n"
        }
    ]
}