{
    "prof_info": [
        {
            "prof_name": "Gustavo Perez-Firmat",
            "prof_id": 255,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": null,
            "review_date": null,
            "review_content": null
        },
        {
            "course_name": "20th Century Latin American Literature",
            "review_date": "December 07, 2005",
            "review_content": "\nGustavo Perez Firmat is very knowledgeable, in all subjects. He frequently references works of art (art, poetry, literature, philosophy...) from all around the world. More importantly, he knows how to teach. And even more important than this, he is a good person. Funny, amiable, interesting, concerned about others, etc. Perez Firmat is unpretentious and open to differing views. He has written novels, poems, and theory. Just check out his website. He is an amazing human being. \nWorkload:\nVery light. About 30 min to 1 hour (very enjoyable) reading per class. 2 midterms that consist of ids, passage analysis, and a short essay. The final is take home, but quite long...he expects at least 3,500 words divided in 3 essays. Very fair grader.\n"
        },
        {
            "course_name": "20th Century Latin American Literature",
            "review_date": "December 07, 2005",
            "review_content": "\nGustavo Perez Firmat is very knowledgeable, in all subjects. He frequently references works of art (art, poetry, literature, philosophy...) from all around the world. More importantly, he knows how to teach. And even more important than this, he is a good person. Funny, amiable, interesting, concerned about others, etc. Perez Firmat is unpretentious and open to differing views. He has written novels, poems, and theory. Just check out his website. He is an amazing human being. \nWorkload:\nVery light. About 30 min to 1 hour (very enjoyable) reading per class. 2 midterms that consist of ids, passage analysis, and a short essay. The final is take home, but quite long...he expects at least 3,500 words divided in 3 essays. Very fair grader.\n"
        },
        {
            "course_name": "Short fiction in Spanish America",
            "review_date": "March 08, 2005",
            "review_content": "\nBy far the best professor I have had. The best discussions, this man is brilliant. He is funny and besides all of that, he is easy to approach and he will actually listen. He incorporates a lot of the outside world to our discussions and does not limit it to his own ideas. Whoever thinks he's sexist or not acknowledging the underepresented role of women is highly mistaken. Perez recognizes  that women are underrepresented in hispanic literature and he is not sexist.\nI highly recommend this class if you want a fun and intellectually challening class with a great reading selection and a great professor.\nWorkload:\nRead a few short stories for every session, discuss them. Midterm and a final (half which is take home)\n"
        },
        {
            "course_name": "Cuban and Cuban American Literature",
            "review_date": "January 17, 2005",
            "review_content": "\nGustavo Perez Firmat is awesome. He's one of the best profs I've had at Columbia. This seminar had great readings, and he knows just how to lead a discussion-based class. He's able to both keep us on topic but also get us to develop our own ideas. I left this class happy every Tuesday. I highly recommend him. \nWorkload:\na book per class, 5000 word diary entries three times a semester and a book review. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 30, 2002",
            "review_content": "\nGreat professor. Loves the etomology of words. Fun class, good discussion. If you can trek your a** over to the Spanish Casa, then go for Gustavo's class. He is nice and never intimidating and gives good insight to the books. He does have sort of a feminist standpoint though. I do think he feels guilty for being a man, part of the ruling class. \nWorkload:\nGenerous Grader. Don't read the books, just come to class and memorize the notes, especially the meanings of the Greek words.\n"
        },
        {
            "course_name": "US Latino Literature",
            "review_date": "December 31, 1999",
            "review_content": "\nProf. Perez-Firmat has a lot of positive qualities, but students should know that most of the readings he assigns portray women in a sexist way.  While this kind of literature is valid for a class, gender issues are not dicussed, which results, in my opinion, in an exclusion of female students, because the male protagonists are being sympathized with despite their misogyny and ignorance of women. This is too bad, because the class is generally a good exploration of Latino culture through lit. \n"
        }
    ]
}