{
    "prof_info": [
        {
            "prof_name": "Harro Mueller",
            "prof_id": 1623,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Nietzsche (Seminar)",
            "review_date": "October 23, 2009",
            "review_content": "\nExperiencing Harro Mueller was one of the most bizarre encounters I expect to have at Columbia. This is a professor with a razor-thin command of the English language, yet rarely uses a word that has less than three syllables. The result is that a seminar on one of history's most controversial philosophers wound up being reduced to a gigantic effort to decipher the words coming out of Harro's mouth.\nThe structure of his course could not have been less engaging - a rambling, obscurantist summary from Harro of one of Nietzsche's works, followed by a student presentation of another of Nietzsche's works. Since these student presentations happened every day and took up the majority of class, very little actual teaching occurs as a result of Harro's communication problems. What's more, I'm pretty sure he didn't know anybody's name, and I'm also pretty sure he hasn't made the jump to e-mail, so don't bother with trying to access him outside of class. He is definitely an amusing artifact - he's a hardcore German intellectual who doesn't bother to make himself accessible, but one wonders how much of this is out of choice. \n\nWorkload:\nA presentation with a partner on a chosen Nietzsche work, and two 6 page papers. \n"
        },
        {
            "course_name": "Formalism and History (in English)",
            "review_date": "May 14, 2003",
            "review_content": "\nHarro's pretty chill and really brilliant. His English could use some work (understandable, just doesn't always make sense) and sometimes he could stand to ask more provocative questions But has an excellent command of material and seems to care about his students, even though in a class of 11 people I'm not sure he knew anyone's name. Wouldn't seek him out, but definitely wouldn't avoid him either.\nWorkload:\nPresentation, final paper. Not too heavy on the reading.\n"
        }
    ]
}