{
    "prof_info": [
        {
            "prof_name": "Carl Riskin",
            "prof_id": 71,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Economic Organization and Development of China",
            "review_date": "May 21, 2014",
            "review_content": "\nOne of the best classes in economics (and generally) I've taken at Columbia and highly recommended- but not if you don't like writing. \nThe course is an economic history of China since 1949, focusing on economic development first under Mao and then in the Reform period since 1978. The material is fascinating and important and the readings, a mixture of primary and secondary, are some of the best I have ever read (reading the readings before class makes the lectures much clearer, but you can also just read them before tests). \nProf. Riskin is a very kind, light-hearted man, the kind of wizened academic who has been doing his job for so long because he enjoys it. His lectures are slide-based, which is fantastic for tests (see below), but he always adds a lot so it's fun and useful to come to class (which are 110-minute lectures with a tiny 4-minute break in between). \nThe main thing to note is that this is as much or more a history class as an economics class. You will be writing a 15-page research paper (econometrics not necessary) and both the midterm and final are composed of essay questions. \nIf, like me, you like to write and are good at it, this is one of the few places in the Economics Department where you will be able to put this to good use. If not- you should probably stay away from this class. \nIMPORTANT NOTE: This is an economics course in which you write a paper. This makes it one of the few opportunities in the economics department, apart from seminars, to really get to know a professor and make a connection (which may lead to options like supervised research, recommendation letters, etc.). Prof. Riskin is also extremely helpful in helping the research paper (he printed and gave me resources without my even asking) and happy to talk about a wide range of topics in addition. \nAll in all a great, relatively stress-free course, and you can start with next to zero knowledge of the history and emerge with a pretty solid grasp.\nWorkload:\n12-15 page research paper.\nMidterm: essay questions (3 out of 5 or some such), mostly pretty broad and easy to answer if you've followed the slides and done some of the reading. \nFinal: pretty much the same, though our year (2014) he decided to make it a take-home final, so we had 5 full days to complete it. \nThe tests are pretty easy and straightforward and Prof. Riskin is a fair grader.\n"
        },
        {
            "course_name": "Economic Organization and Development of China",
            "review_date": "September 09, 2009",
            "review_content": "\nNot a very exciting lecturer, to say the least.  But the class basically consists of a big paper and a take-home final (5 large essays, choose three).  It's a very manageable class and I'd recommend it if you'd like to get an econ elective out of the way. \nWorkload:\nPaper, Take-home final.\n"
        },
        {
            "course_name": "Economic Organization and Development of China",
            "review_date": "December 31, 1999",
            "review_content": "\nProf Riskin is one of the foremost authorities on Chinese economics. Expect the class to be an economics history class - perhaps not the most exciting 2 hours to sit through. Not a very analytical course such as microeconomics or econometrics. Generous grader.\nWorkload:\npaper and final.\n"
        },
        {
            "course_name": "Economic Organization and Development of China",
            "review_date": "December 31, 1999",
            "review_content": "\nProfessor Riskin may not be the most dynamic lecturer, but he does know his stuff cold. If you are serious about studying the foundations of the Chinese economy, you need to take this class. Like the previous review stated, this class is more of a history class than an economics class. Be prepared for a barrage of facts, numbers, and figures, though, as Riskin has carefully crafted out his arguments. Additionally, don't be intimidated by the large number of graduate students in the course. Most of them are taking the course for the first time and know as little as everyone else. Plus, it's only SIPA students, second-tier at best.\n"
        }
    ]
}