{
    "prof_info": [
        {
            "prof_name": "Victoria De Grazia",
            "prof_id": 93,
            "total_reviews": 15
        }
    ],
    "reviews": [
        {
            "course_name": "Europe since 1945",
            "review_date": "May 02, 2015",
            "review_content": "\nI think Maybe the previous reviewer's comment that Judt's book is the only redeeming part is perhaps strong, but the lectures were pretty dry. I think at one point I heard her say that homosexuality was illegal in europe through the twentieth century, which is clearly a fallacy as France was one country which legalized it during the french revolution prior to the 19th century. The TA apparently graded you each section on a scale of 10 for your level of participation. \nWorkload:\nLots of reading including primary sources for section. Other texts read too including Czeslaw Milosz and Vaclav Havel. there were also movies recommended every other week or so - Battle of ALgiers, Paisan, etc. I'm pretty sure people stopped attending those mid-way. The auxiliary readings generally impeded your time studying for what would eventually be on the midterm and final. \n1 research paper due at the end, 1 midterm, 1 final. \n"
        },
        {
            "course_name": "Europe since 1945",
            "review_date": "October 04, 2008",
            "review_content": "\nWhat do you get when you combine elitism, self-\naggrandizement, and too many feminist workshops? Take this class and you will quickly find out. No structure, no focus, no interest. Judt's book was the only redeeming  part.\nWorkload:\nJust read Judt. Forget the rest. \n"
        },
        {
            "course_name": "Europe since 1945",
            "review_date": "August 21, 2006",
            "review_content": "\nThis woman is incredibly smart, and understands the greater warp and woof of European history; she can take a bunch of different threads and tie them together, and she knows how to take a very focused study of, for instance, Benneton, and amplify her conclusions about that example onto a greater background.  Unfortunately, her voice's cadence recalls the speed of 900 pound quadriplegic turd coming down my constipated intestine.  I fell asleep consistently.  She is always searching for just the right word.  This means she talks very very very very very slooooooowwwwwww.  Be prepared.  NoDoz, Red Bull, and amphetamines are all useless in the face of her soporific genius.\nWorkload:\nTony Judt's Postwar is an excellent read.  You'll need to do the reading seeing as you'll be asleep during most of her class.\n"
        },
        {
            "course_name": "Europe since 1945",
            "review_date": "July 09, 2006",
            "review_content": "\nThis is one class where it is imperative to do the readings before going to lecture. De Grazia assumes that you already know what sheÂ’s talking about, and tends to go over specific events or discuss specific examples. If you havenÂ’t done the reading youÂ’ll be totally lost. Lectures on social history were generally good; lectures on politics tended to be extremely confusing (she gets flustered and gets dates and names mixed-up). To me this was a very interesting class and de Grazia was a very knowledgable professor, but it you donÂ’t have a background in European history/or arenÂ’t willing to do ALL the reading before lecture then I wouldnÂ’t recommend it.\nWorkload:\nNot too bad: reasonable amount of reading, bi-weekly film screenings, two map quizes, 10-15 page paper, midterm, final (for both you get a bunch of terms and questions in advance to prepare and then she chooses a couple on the day of the exam), bi-weekly discussion section (alternates with the movies)\n"
        },
        {
            "course_name": "European History since 1789",
            "review_date": "June 07, 2006",
            "review_content": "\nThis woman makes no sense. Going to lecture was utterly pointless, I would start out taking notes and end up facebooking or zoning out. If you're really interested in European History Since 1945, read Tony Judt's \"Postwar,\" it will save you the angst of taking this class (and you will probably learn more).  And, as always, grading totally depends on the TA.  When I took this class, there was a WIDE range of expectations among them, especially when it came to the term paper. \nSo that was also frustrating. Take this class at your own risk.\n"
        },
        {
            "course_name": "Europe since 1945",
            "review_date": "May 19, 2006",
            "review_content": "\nA mixed bag professor: quite knowledgeable (brilliant, even) and rather warm, but these qualities rarely come out during her lectures. She seems to have a set trajectory for her lectures, and if something sets her off, she tends to fluster for a moment while she regroups. During these moments, she may say something a little silly (like mixing up Gorby and Brezhnev) but this is NOT because she doesn't know the material: she is a professor not comfortable mixing discussion with lecture. Try to talk to her during office hours, and you'll come to appreciate a greater dimension of her personality, which is VERY cool and interesting. Don't expect warm fuzzies though, unless you take a seminar with her.\nTo get the most out of her lectures, which vary significantly in presentation and content, DO ALL THE READING for the week. Her lectures tend to assume that you've done the reading from the major text, Tony Judt's \"Postwar,\" and that you are fully grounded in the political, social and cultural situations that she will discuss. The lectures seem light only if you have not done the reading, because she focuses mostly on varying arguements and gives her own perspective on the politics. A general piece of advice: any lecture on women, culture, social change, immigration will be fabulous; the political lectures can be vague, at best, if you haven't done the reading, and these are the ones that Vikki gets a little flustered on. Give her credit for tackling what is not her specialty, even if she gets nervous during the presentation.\nOverall, a great professor if you can accept one who is definitely NOT an 'edu-tainer.\" Go see Foner if you want that. Take de Grazia's class if you want a very generous and subtley constructed course on European politics and society since 1945, and the opportunity to meet a REALLY fabulous woman. Her TAs were wonderful also, the best of the best.\nWorkload:\nA lot, if you do all the reading to get the most out of the course. Readings from Tony Judt's \"Postwar\" take forever, but are comprehensive and interestingly arranged and argued. About 100-125 pages of assigned reading per week, plus supplementary texts that are unilaterally great. These include Primo Levi's \"The Reawakening,\" Francoise Gaspards's \"A Small City in France,\" Steven Kotkin's \"Steeltown, USSR,\" and Jana Hensel's memoir on growing up in East Germany.\nAside from the copious readings, students are required to see 5 out of 8 movies (ranging from the Italian classic 'Paisan' to Good Bye, Lenin! and l'Haine.) See them. They're required for the final and all quite fascinating: de Grazia references the films frequently during lecture, and even opens up some discussion concerning them.\nFor evaluation, there are 2 map quizzes (easy) a midterm, final, and 10-12 page research paper/essay. The midterm and final require 2 essays, about 10 ids and some extras, which are all given to you a week before the exam. She will give you 5 essay question, pick 4 of them and ask you to write on two. VERY fairly graded. The paper is also fair, and can be written on any topic your heart desires. It can be as hardcore as you want it to be: you can chose to write about something as obscure as Algerian/French advertising, or a comparison of historical memoirs covered in class. It's up to you.\n"
        },
        {
            "course_name": "Europe since 1945",
            "review_date": "May 19, 2006",
            "review_content": "\nPerhaps the addition of an exceptional general text (\"Postwar\" by Tony Judt) has helped this class and made the more negative reviews of the class and of Professor de Grazia irrelevant. The text is so well structured (mainly by theme but with an overarching chronology) that teaching a course using it as a foundation must be rather easy.  I enjoyed Professor de Grazia's book to some extent, but the Judt book really is what makes the class interesting. I guess if I could quantify what I learned in the class somehow, I'd say that 70% of it came from the Judt book.  So if you are an incredibly enterprising student, you could just read that (but it's really fucking long). \nThe word \"endearing\" pops up below and I think that accurately reflects de Grazia's personality.  Even though she can be an awkward lecturer at times, you want to stick around and you're usually rewarded.  If you are on top of the readings you can just stop by lecture at your convenience and get some deeper insight into what you've been reading.\nLet the Judt book guide you through an interesting time period and you'll have fun.  Overall it is a pleasant experience.  Not a course you have to stress about, but the exposure to such a large amount of material ensures that you will learn a fair amount.\nWorkload:\nPlenty of assigned readings and films.  It is not at all essential that you read everything or attend each screening, though all the movies I were terrific.  The questions for the mid-term and final are generously given to you in advance. \n"
        },
        {
            "course_name": "Europe since 1945",
            "review_date": "April 09, 2006",
            "review_content": "\nIf you can avoid it, don't take this class.  It is not worth the time or the tuition.  \nDe Grazia is definitely very knowledgeable of the material, but she is a horrible lecturer.  She is not only boring, but makes mistakes during lecture, like mismatching countries and some dates.\nThe course is very doable, and the tests aren't bad (though the map quizes are a bitch) but I guarantee that if you take this course, you will rarely show up to class, as it is not worth it, especially come the spring.\nWorkload:\nLots of reading, but you don't have to do much of it if you get in a study group and split it up; 2 map quizes that combine to count for 10% of your grade (they're a pain but they're not that bad if you study a bit); midterm (she gives you a list of terms to study and the essay questions, then on midterm day randomly chooses IDs and questions off of what you have been given)-- easy; final (same deal as the midterm); one 10-12 pg. paper, on a topic of your choice-- also not so bad, but just start thinking about it early on.\n"
        },
        {
            "course_name": "Europe since 1945",
            "review_date": "March 10, 2005",
            "review_content": "\nI feel the need to rescue de Grazia from some of the previous reviews.  Although lectures can be mixed in quality,  when the woman is on target she is on fire, passionate, and brilliant.  I  went to meet with her a couple of times during office hours, and she helped me sort out ideas, suggested  great topics, encouraged  me to think hard and be enthusiastic.  If you have sincere curiosity for the subject and want to pursue European History you should definetly take this class! \n"
        },
        {
            "course_name": "Europe since 1945",
            "review_date": "March 08, 2005",
            "review_content": "\nThe amusing thing about this class is that two years ago I sat in on it for the first couple weeks, decided not to put it on my schedule, and then ended up taking it this year.  All I have to say is that Professor DeGrazia did not change one single word of any of her lectures, assignments or anything else.  She didn't even bother to review the syllabus and handed it out with the uncorrected dates.   (I guess the class is typically taught in the spring, so needless to say the Fall 2004 class was a bit baffled by due-\ndates in April and a final exam scheduled in May.)  I often went to class (and trust me, it was a true feat to force myself to go).  And not because she is an amazing professor, simply because she can teach the exact same boring course year after year and get away with it.  While a very nice woman, she is definitely a space-cadet and has a peculiar way of talking that makes listening to her difficult.  The workload is manageable, but definitely DO NOT leave those pesky take-home Â“quizzesÂ” (which end up being about 9 pages) until the last minute.  And expect some of the assignments to be fairly ridiculous Â– such as inventing questions based on maps posted on Courseworks.  Speaking of Courseworks, I will say that it is very helpful for the 75% of the class who never bothered to show up that DeGrazia puts her lecture notes on the website.  You should also actually see the mandatory and annoying Monday-night movies, because guaranteed you will be required to write about them later in the semester.  The final exam is straightforward.  Europe since 1945 is the type of course where you show up to the final exam and see a lot of students for the very first time.  I didnÂ’t even realize one of my good friends was in the class until halfway through the semester.  Take this class if you have to fulfill a requirement and donÂ’t care about being in course that will change the way you think or challenge you.  I do have to say that if you can pay attention, you will come out of the class with fairly decent knowledge of recent European history.      \nWorkload:\nReasonable weekly reading; 2 take-home quizzes consisting of two short essays, definitions, and map questions; mandatory Monday-night movie screenings; occasional and really boring discussion sections; pretty easy final exam.\n"
        },
        {
            "course_name": "Europe since 1945",
            "review_date": "January 06, 2005",
            "review_content": "\nI am a history concentrator and after having taken Carnes America Since 1945 this seemed like a nice compliment. It must be said that Professor De Grazia tries very hard and is very nice, but she has  a lot of trouble effectively communicating. In her lectures, e-mails, and conversations one-on-on she is difficult to understand. That makes this class a bit difficult to swallow because any real information is lost in her confusing language. \nThere is the rare lecture where she is on target and when she is on, she is great. I liked her, but I wouldn't take this class again. I had just taken Susan Pedersen's Modern Britian( which was great) and basically used that class to get through this class. The TA's are good, but avoid this class. \nWorkload:\nShe gives you an option of doing a research paper in lieu of  a quiz and the book review. Otherwise the work load is not bad. Not hard to get an A, go to section and most of the lectures....\n"
        },
        {
            "course_name": "Europe since 1945",
            "review_date": "December 16, 2004",
            "review_content": "\nI can agree with some of the previous comments. Overall she is extremely intelligent and passionate person. She is also extremely helpful if you go meet with her one on one. \nWorkload:\nmedium \n"
        },
        {
            "course_name": "Europe since 1945",
            "review_date": "December 02, 2004",
            "review_content": "\nI felt like this class was anti-educational. I took it in a semester when I also took American, European and Ancient courses to fulfill my distribution requirements. I consider myself a somewhat knowledgeable person who has a pretty good grasp of most modern history, so I thought this class would be much more interesting than, say, Roman Social History. But seriously, it was ridiculous. De Grazia does not engage the students at all, and she speaks at about one word per minute, without  substance. She never says \"today we will talk about x, y, z\" - she just  rambles and emphasizes certain euphemisms as if trying to provoke a response transmitting information. Here's an example: she taught us a bit about May 1968 and would say things like \"A student ... REVOLT ... \ntook ... PLACE\" then pause for five seconds afterwards as if she said something very profound. Given that there is no textbook, it's not as if we had background knowledge, and I'd prefer she speak more efficiently and actually tell us many more specific details. Sometimes would struggle to search for the right word for a while which was surreal for the students sitting there as she talked to herself. I can see how she might be better in a more intimate setting, but attending her lecture in the IAB building was like attending a non-class. People fell asleep and played computer games  without consequences. I understand that an intelligent person with lots of great stuff to say should be accorded  a good amount of respect, but I don't think she did a good job taking into consideration what it was like to be her student. She didn't prepare materials in a way that allowed students  to understand what she expected of you. The readings and lectures were underwhelming, which made the grading on the midterms a total surprise and writing the papers unenjoyable. One of the essay questions asked something like \"Talk about the consumer culture after World War II and how it affected social ties, say, gender relations.\" It literally used the word \"say\" as the transition. When I got my paper back, I got comments that said that I didn't make enough of a big deal out of gender in my thesis. What is most upsetting is that if the essays weren't phrased so vaguely then I could've written a more precise paper. I feel like students were punished for not guessing what the professors wanted. Ultimately, I feel like this class was more efficiently learned and studied if you just stayed home and read the class readings instead of attended lectures for 3 hours/week.\nWorkload:\nlight\n"
        },
        {
            "course_name": "Europe since 1945",
            "review_date": "December 18, 2003",
            "review_content": "\n*The films are quite entertaining.\n*Readings, though, clearly have some anti-capitalist bias.\nWorkload:\nToo many annoying assignments with topics such as 'culture of consumerism.'\n"
        },
        {
            "course_name": "Europe since 1945",
            "review_date": "December 18, 2003",
            "review_content": "\n*The films are quite entertaining.\n*Readings, though, clearly have some anti-capitalist bias.\nWorkload:\nToo many annoying assignments with topics such as 'culture of consumerism.'\n"
        }
    ]
}