{
    "prof_info": [
        {
            "prof_name": "Nadja Rottner",
            "prof_id": 2694,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 09, 2007",
            "review_content": "\nJust about the worst professor one could ask for in this topic, Rottner conveys absolutely no passion for this course. She is stiff, uncomfortable, and will make your life in this class most unpleasant. While the grading is easier on the essays, the exams are graded harshly (and they count most). There are many art hum teachers to choose from. This one was a poor choice for me, and I regretted the entire semester long.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 09, 2007",
            "review_content": "\nJust about the worst professor one could ask for in this topic, Rottner conveys absolutely no passion for this course. She is stiff, uncomfortable, and will make your life in this class most unpleasant. While the grading is easier on the essays, the exams are graded harshly (and they count most). There are many art hum teachers to choose from. This one was a poor choice for me, and I regretted the entire semester long.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 09, 2007",
            "review_content": "\nJust about the worst professor one could ask for in this topic, Rottner conveys absolutely no passion for this course. She is stiff, uncomfortable, and will make your life in this class most unpleasant. While the grading is easier on the essays, the exams are graded harshly (and they count most). There are many art hum teachers to choose from. This one was a poor choice for me, and I regretted the entire semester long.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 11, 2006",
            "review_content": "\nI disagree with the previous review.  I thought Nadja was a good art hum teacher.  Her lectures were clear and straight forward.  She def cares about what she is teaching.  She is not the type to be your best friend out of class, but she can be funny during lecture.  The readings could be long but the reading question (singular) for almost each class asked for the basic theme of the reading.  Therefore you can skim the reading and just get the main point.  Bascially the midterm and final are memorizing the paintings and including key terms in the essays.  Pretty easy grader for the three 2-3 pg essays.  PRETTY EASY CLASS IF YOU ATTEND CLASSES.\n\nWorkload:\nWork: Skim readings for 1 reading question almost each class.  3 essays.  Memorizing for midterm and final (comparison paintings are the obvious ones that we spent a long time looking at).  \n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 11, 2005",
            "review_content": "\nI really disliked this class and I think it was Rottner's fault. \nWE had a ton of reading for each class and no one could ever figure out why it was relevant or what we were supposed to get out of it. In addition, she gave reading response qs everyday so we basically had a quiz each class and you really have to be there. Her exams were random, graded harshly, and she was unhelpful outside of class. If you can, avoid taking Rottner for Art HUm\nWorkload:\n3 papers, midterm and noncumulative final. 15-50 pgs of reading for each class, quiz every day.\n"
        }
    ]
}