{
    "prof_info": [
        {
            "prof_name": "Ramin Amir Arjomand",
            "prof_id": 2766,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "May 11, 2015",
            "review_content": "\nCreativity is the most important part of this class. History of music might not be as important in this class, compared to other Masterpieces of Western Music course. Although the workload is pretty heavy, everything is fun to do and graded fairly.It is not very clear what he wants at first, but you will gradually get a hold of his expectation. He does everything to make the class interesting, such as playing the piano himself, which I enjoyed a lot, and bringing in different classical musicians. \nWorkload:\nFairly heavy. Weekly papers to write, random assignments, midterm and multiple layers of finals. HOWEVER, most of them are very fun to do. I found them pretty refreshing in the midst of memorization and writing papers.\n"
        },
        {
            "course_name": "Ear Training III",
            "review_date": "December 11, 2013",
            "review_content": "\nI feel so conflicted about Ramin's class. On the one hand, the review below seems to say it all -this man is brilliant, and clearly cares very deeply about his students, his own work, and his teaching. On the other hand, the vagueness that exists in his classroom really detracts from one's ability to learn from him. We spend probably 10-15 minutes of the 50-minute period in complete silence, which doesn't seem so useful in a class where we are supposed to be listening to music.\nI also found Ramin's whole lack-of-assignments and grading thing very frustrating. Though it was obviously nice having very little outside work, I have absolutely no idea how I am going to do in this class. I haven't received one grade and have only handed in two assignments, and I therefore have no idea what Ramin will be grading us on. This is very frustrating in a class that is really supposed to be an easy A.\nTo sum it up, I learned a lot from Ramin about what it means to think about music emotionally, critically, and academically. I learned about the process one undergoes when evaluating a piece of music. But I don't think I learned anything that I was \"supposed\" to be learning in Ear Training. I didn't learn any concrete skills or facts to prepare me for Ear Training IV or to aid in the theory sequence, which, as Ramin stresses, is what Ear Training is really for.\nWorkload:\nVery little -3 at home dictations (2 melodic, 1 harmonic), 2 sing-and-play at home exercises, and 2-3 group singing assignments. Very manageable. \n"
        },
        {
            "course_name": "Chromatic Harmony and Counterpoint I, II",
            "review_date": "May 06, 2011",
            "review_content": "\nI am so happy Ramin now has a gold nugget. This man. Where to start.\nHe is a genius. The first day of class he acted that part, literally pacing back and forth in the front of the class and intermittently playing a C major chord and a G major chord. I was definitely shaking/laughing nervously. He makes you nervous. The first day or two of class was spent describing what it feels like when the tonic moves to the dominant, what mood that puts you in, the ways in which you are or are not inching to go back to that tonic chord. This discussion lasted an entire two semesters (if you take Ramin first semester, you must take him the second; even better if you can take all of Diatonic and Chromatic with him), and the discussion is by no means over. He weaved art, literature, poetry, and other media into music. Everything he said was pertinent. \nIf this review seems...vague, it is because each discussion (and the course is discussion-heavy) edged on the vague, until those times (and there were always those times) when Ramin or a fellow classmate tugged it into the specific, and it was there that we began making music.\nThis class was also singing-intensive, which is the best thing. We wrote music. We discussed this music. We tried to understand the feeling of this music. We sang this music. We went places and felt things and understood through singing. This class is a process. Expect to become close with your classmates and except to fall hard for Ramin in a way you would not expect. \nWorkload:\nThis does not even matter. I mean...we had work...there was a point where we were writing a 'sonata' a week (four-part, bare-bones sonatas). It was never really about length; always about incorporation of feeling (the specific feeling of the dominant, that absence) with technique. That being said, expect to really work on the music you write for his class; you will want to.\n"
        },
        {
            "course_name": "Chromatic Harmony and Counterpoint",
            "review_date": "January 08, 2009",
            "review_content": "\nI know it's been said, but I'll say it again:  RAMIN IS THE MAN.  HE IS FANTASTIC.  HE IS WONDERFUL.  HE IS THE BOMB.\nI never thought anyone could ever make me ENJOY music theory, but Ramin has made me love it.  His classes are discussions - there's always a general goal in mind, but he leaves lots of room for questions and tangents and explorations.  There's always enough time for another question.  He is a piano god and is always willing to play something the class has been working on...   We also sing many of the phrases we construct, which is surprisingly helpful.  He is very good at clarifying concepts and explaining complicated ideas, and can ALWAYS come up with an example - he'll write one right there in front of you, or play something from the classical literature (from memory, half the time)...\nHe also has an amazing sense of humour.  Come on - the man has referred to various classical composers as bad@$$es WITH A STRAIGHT FACE.  How can you not love him?\nTake Chromatic with this man.  If possible, get him for both Diatonic and Chromatic.  And then see if you can talk the department into hiring him to teach more classes.  He is incredible.\nWorkload:\nUtterly reasonable.  Assignments after most classes - usually exercises from the book or stemming from a phrase constructed in class, some reading, some listening.  Nothing terribly strenuous.  The midterm and final both involve composing pieces demonstrating usages learned in class - lots of fun.  He doesn't generally grade assignments - he corrects them so you can see your mistakes, but the homework itself is usually completion only.  Again, very reasonable.  No busy work.\n"
        },
        {
            "course_name": "Diatonic Harmony and Counterpoint",
            "review_date": "January 23, 2008",
            "review_content": "\nRamin is the man.  There's really no other way to put it.  His classes are heavy on participation and discussion, lots of room for interesting questions and tangents.  I have yet to be bored in this class.\nWorkload:\nUsually homework after every class, but it's generally not too bad.  There's a lab once a week that isn't listed in SSOL (because you don't register separately for it), but it's fine, just an hour and fairly helpful as a whole.  One midterm, one final, but it's composition/performance based (i.e., compose and play/sing some counterpoint), so it's not stressful at all - either you're prepared or you're not.  Very fair grading.  Good office hours.\n"
        },
        {
            "course_name": "Diatonic Harmony and Counterpoint",
            "review_date": "January 22, 2008",
            "review_content": "\nI've only had one semester of Ramin's Diatonic class so far, but I can say that the man is incredible.  The way he thinks about music is very logical while still recognizing the power of music that cannot be explained.  This thinking carries over into his teaching, and you can tell that he loves imparting the material in his own way. His emphasis on the class singing is a huge help as well.  I hope I can snag him for Chromatic too.  And he's hilarious.  Take himmm.\nWorkload:\nHomework every night, but always manageable and useful, Friday lab sessions for one hour, everything beneficial\n"
        },
        {
            "course_name": "Chromatic Harmony and Counterpoint",
            "review_date": "December 29, 2005",
            "review_content": "\nRamin is an unusual teacher, who spends a lot of time thinking about exactly how to teach the class (often in front of us). The result will sometimes make you feel like the class is dragging on for hours while nothing happens, though it also leads to some very interesting insights that you wouldn't find in a conventional by the book theory class.\nWhether you like the class will depend a lot on your personal opinion. As a music student, I thought it was a valuable experience, though I also found it hard to pay attention.\nWorkload:\nLight--occasional assignments that Ramin specifically avoids grading (he would rather we develop a sense of how we did on our own); we had only a few assignments and a rather open 5 page paper for a final, (though Ramin is hinting that there might be more for 2nd semester).\n"
        }
    ]
}