{
    "prof_info": [
        {
            "prof_name": "Su-Wai Chan",
            "prof_id": 1558,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Lattice Vibrations and Crystal Defects",
            "review_date": "May 03, 2011",
            "review_content": "\nIf you don't have time to read this review to the end, this beginning is for you. YOU SHOULD TAKE THIS CLASS ONLY IF\n1. YOU HAVE INFINITE AMOUNT OF TIME AND MONEY AND YOU WOULD NEVER BE SORRY FOR THE HUGE WASTE.\n2. YOU ARE EITHER A MASTER or PHD STUDENT AND THERE IS NO WAY TO ESCAPE-even in this case (I mean even if you're taking the qualifiers) I'd advise you to talk to your advisor not to take the class and work on it yourself if you need it. You'd save enormous amount of time and your mental health-\nNow the details..Prof Chan doesn't know how to use the smart board but she insists on opening her courses to CVN so everything is recorded and she has to use the smart board.This semester we had the class in one meeting per week and every week we wasted at least half an hour waiting for her to figure out how to do what she wants to do with the board.At first you feel weird, then bored, but then compared to the 'lecture' time you start to feel like they are actually 'breaks' from that 'absolute torture'.\nThe class consists of 2 parts: Lattice vibrations and Point defects. For these two parts, she gives you the required book chapters which are really helpful. For the first part, she tries to derive some of the equations and with the help of the book chapters and homework problems, you get to understand this part. But be careful: She loves to teach longitudinal and transverse waves by picking students and pulling them in front of the board and make them dance. I think in one semester she did this dancing thing 10 times, and each time we wasted another 10 minutes. YOU HAVE TO LOVE DANCING AND BEING RECORDED WHILE LOOKING LIKE A 5 YEAR OLD KID to pass this class.\nWhen the second part of the class starts, she gives you her own notes which are probably 100 years old and have never been checked or corrected. She tries to teach point defects, diffusion, ionic conductivity and all that stuff by projecting her notes (word documents) and trying to read all the formulas line by line. Even she can not read the notes herself properly and the notes have no pictures. It's just a bad compilation of formulas thrown onto the paper and there's absolutely no way that you can learn anything from them. Then comes the homework problems..Most of the time it's impossible to solve them either because you don't understand anything from the question or there is missing information that should've been given. One time I asked a question about the homework and she didn't answer me because 'we hadn't covered that part yet'.Also there are no solutions to the homeworks, she refuses to give the solutions to the class because she asks them in the exams. ( So your best chance is to talk to the TA and learn as much about the problems from him/her. ) You think once you get your midterm paper back you'd learn the answers finally but NO! SHE DIDN'T GRADE OUR MIDTERMS! You either did the question right or wrong, you never know. And they may be in your final too! Good luck!\nAnd there are also review sessions she mentions but forgets that she mentions..There may be a week left for the final and you may all come to the class for the session but you may end up waiting for half an hour in front of her office.Anyway..That's life right ?     \nOne last thing: Your grade will be a surprise to you in any case, it would've been nice if you could predict if it would be a good or a bad surprise, but sorry! \n\n\nWorkload:\n7 homeworks of 3-4 questions; not long (first 4 are OK but the last 3 are not doable with the notes she distributes, good luck)\n1 mt that is never graded. Good luck again.\n1 final- May include anything, you never know. One more good luck to you.\n"
        },
        {
            "course_name": "Structural Analysis of Mateials",
            "review_date": "March 13, 2011",
            "review_content": "\nTo save you time, I will say this in the first line - DONT TAKE HER CLASS! For me, the 2 reasons you want to take any course are:\n1. You learn something.\n2. It helps your grade.\nIn her course, 1 wont happen. Her teaching is extremely disorganized. She wastes 20 minutes ( I am not exaggerating) in every class talking about the weather, her student's national cultures and such things. She teaches out of old, incomplete notes. She tried to teach us lattice defects with notes, that had no diagrams. \nAlso, if you are uncomfortable holding the hands of strangers and dancing in front of the class - this course is not for you. To explain wave motion, symmetry, etc. this is what she will make you do with your classmates.\nGrading: You think you are doing very well in the class, and you will get a C. I wont go into details here, because that will surely reveal who I am. But if grades are important to you - you are taking a gamble by choosing her class.\nWorkload:\nWorkload is very light. Late submission of HWs is tolerated. \n"
        },
        {
            "course_name": "Lattice Vibrations and Crystal Defects",
            "review_date": "April 17, 2003",
            "review_content": "\nProfessor Chan is a really nice professor, but she is pretty ditzy.  Her class is really complicated and oftentimes no one really has any idea what she's writng down or talking about.  She uses notes that are several years old and sometimes can't understand them herself.  However, if you can get past the frustrations of the lecture itself, she's totally willing to go over homework in great detail, take questions of any sort, and her review for the midterm consisted of mentioning questions that might be on it and actually were.  She might not know the answer when she feels put on the spot, but she's clearly brilliant and will get back to you with all the detail you could want, and more.  Basically, if you're into the material, this class can be very interesting, if you're not, you'll probably still do great.  She's eager to help you understand, and if you can get past the communication barrier (she is really slow at understanding specific questions, but when she does her answers are very satisfying) then the class is a fairly enjoyable one.  It is really frustrating that there isn't a specific book for the course, just suggestions, and she assumes a basic amount of knowledge that a lot of people don't have, but she's lenient and helpful, so it all works out in the end.\nWorkload:\nproblem sets about every other week, a midterm, and a final\n"
        }
    ]
}