{
    "prof_info": [
        {
            "prof_name": "Flora Armetta",
            "prof_id": 2067,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 09, 2009",
            "review_content": "\nbasically awesome. She's smart, gives a damn about her students, is a bit of a mess, but always super endearing (you'll want her to be your new bff). She knows most of the material exceedingly well, and in the cases where she doesn't, she admits it and goes out of her way to contact someone in the field and resolve whatever issue we're having. \nHer grading is very fair (maybe a bit lenient even) and the midterms were both rather easy (everything on them had been covered extensively in class). Outside of the in-class work though, she demands a level of originality, or at least demonstration of some sort of though process. If your papers have ideas, they'll be marked highly. If your papers are well crafted but without much insight from outside of class, they'll still be graded reasonably, but won't get A's. Basically, if you give yourself a few days to think about the papers before you write them, you'll be much better off despite little additional effort. As I mentioned before, she's a bit of a mess and therefore sometimes a slow grader, but she's pretty fair about that as well: if she's late giving us back an assignment, she'll give us more time with whatever we're working on. \nOn participation: you won't be penalized for not speaking up (she'll sympathize with your shyness), but if you do, it will help out your grade. She's engaging and the environment is quite friendly to an extent that it's the first class I've really ever felt comfortable speaking up in. \nShe's really wonderful and she never condescends to her students (occasionally she curses! ... and it is adorable), and every once in awhile she'll send us a surprise \"class is canceled\" e-mail. This is of course a positive (2 free hours!), but this class is the only at Columbia which I almost (almost) regretted having to miss a day of. \nI've learned more in this class than any other humanities course at Columbia (or anywhere), and it's just sorta fun.  \nWorkload:\nReading: normal Lit Hum, she did not add 'choice' texts first semester, and second semester she added only Stoppard's \"Arcadia\" (a short play)\nWriting: 2 Papers (5-7 pages, no more/no less) per semester. To get an A: it's your ideas that count.\nTesting: Midterms were fairly easy, most of the class did very well. Just listen in class (honestly, I don't think you even need to have read). Final is the standard course finals. \nMore things:\nPostings: once a month or so on courseworks. not graded, but if you don't participate much in class, this is a good way to make up.\nQuestions: once or twice a semester you'll have to pose a question to start that days discussion. no big deal. \nFood: she brings it for you! \nGrading: I think most of the class was in the B+ area and it's hard to get much below that. For a solid A, do most of the reading, study the lines specifically cited in class, and really just familiarize yourself with (and have ideas about) the works you find most interesting. Your insight and passion will come across in class and your writing. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 23, 2005",
            "review_content": "\nWow, I really liked her. I think we all really liked her. And as the others are saying, we all liked talking when we were around her. Class was mostly discussion, when we were talking about the readings was usually interesting. \nPainless when it comes to grammar and stuff like that, just forceful reminders about what to do with commas and semicolons and stuff. We didn't go into it a ton. She didn't seem to like dullness. This one time she was trying to explain the metaphor of why it was called a constellation essay, and she broke down like, \"alright, i can't do this.\" it was the most liberating thing ever. take her class, do it.\nWorkload:\nsame as every other u-writing class, they're definitely standard\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 08, 2005",
            "review_content": "\nI really enjoyed Flora's class. She is not a stickler about class participation, but makes you WANT to participate because the discussions are casual and interesting. I agree with whoever said that she should be more guiding/critical during discussions, because some of the stuff people said was pretty off the wall. She was VERY helpful with papers and I actually found myself enjoying writing them. She is NOT easy on the grading, but hard work is definitely rewarded. Though at times she seems a bit unsure of herself as a teacher, Flora is approachable, kind, and seems to genuinely care about her students. In her class you will work hard but (hopefully) enjoy it.\nWorkload:\nNormal UW. The research paper was pretty brutal, but (sadly) unavoidable.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 06, 2005",
            "review_content": "\nOutstanding instructor. I actually took UW last Fall, and I can say that of all the core classes I've taken, her class discussions were the best. She has a natural ability to raise engaging questions and get everyone deeply involved in discussion--it was a class I always looked forward to going to. She's also very dedicated and wonderful to discuss papers with in office hours or scheduled  meetings. My only criticism is that she had a tendency to be too lenient both in criticizing ideas presented in class and in papers--I think because she was new to teaching (I think positive criticism to improving as a student and writer). Grades on the generous side. Overall, wonderful professor and person. You're lucky if you get her.\nWorkload:\nStandard for UW. More writing than Lit Hum, significantly less reading. Readings are a lot of fun and go by quickly, the writing will take some time-- especially the final research paper.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 01, 2005",
            "review_content": "\nArmetta is an amazing instructor.  I would always look forward to her classes and at the end of class, during a good discussion, would find it difficult to leave, as did many other members of the class.  Armetta is passionate about the material and communicates that to the class.  She asks interesting questions and participates in the debates and discussions that follow.  I found that many other students would complain about their respective University Writing classes and said that it was just another dull requirement that they were forced to take.  However, Armetta proves that a teacher really can make a class.  Even if it was not a requirement, I would want to take a class with Armetta, because she truly is a great teacher.\nWorkload:\nNot too bad.  Some nights there would be longer readings than others, but they were mostly interesting, so it wasn't that bad.  There were 4 essays (2 five page, 1 ten page, and 1 four page), but since we had to write outlines and first drafts, it really wasn't that bad.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 21, 2004",
            "review_content": "\nI think she's probably better than the average UW instructor based off what other people say. She has useful commentary and is very open to multiple drafts. She's flexible with due dates, and makes class relatively fun. Eh, I haven't heard of many better UW profs. \nWorkload:\nVery fair grader, reflect what you put in, but don't make your drafts seem too polished or she'll punish you for not \"improving enough\" Standard otherwise. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 07, 2004",
            "review_content": "\nCompared to what I've heard about other UW sections I believe this one was typical.  Flora is a very nice person, and she dressed nice to every class.  She was flexible, which is good if you are a procrastinator but frustrating if you are trying to plan your schedule with the due dates.  Her class is fun to go to; discussions are interesting, and the essays are not unreasonable.  Her comments and conferences can be very helpful, and unlike some people I found this course to be very helpful to my writing and making an argument.\nWorkload:\nTypical of UW classes.  Three essays plus a retrospective; ungraded exercises and drafts common.\n"
        }
    ]
}