{
    "prof_info": [
        {
            "prof_name": "Christopher Burney",
            "prof_id": 3138,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "New York Theatre",
            "review_date": "February 16, 2007",
            "review_content": "\nI took this class the first semester Chris taught it. I loved it, and I adore him. I can't, however, say the same for his TA, Caralyn, who seems to think herself God's gift to the theater industry and Columbia University itself. Her position is totally unnecessary anyway, really. \nChris knows his stuff incredibly well, and is full of random theater trivia. He is kind, witty and smart, and though his sense of humor isn't quite for everyone, he's one of the funniest people I've ever had the pleasure of knowing. \nHe's wonderful at making his students feel comfortable with voicing their opinions in class. \nThe course itself was fairly loosely structured and very laid-back, so it's not terribly academic, but you get what you put in with this one. You can choose to BS your way straight through, or you can take it seriously (because although Chris jokes a lot, he does) and learn a lot about New York's theater scene, past and present. \nMy favorite part of the course, though, was the huge variety of theater Chris exposed us to. I got to see a lot of things I wouldn't normally go to. It's a great course for anyone who's interested in the theater, be that interest casual or serious. \nWorkload:\nThe course has been heavily restructured since I took it; we had a midterm exam and a final project, but the former's been replaced by a second project. Additionally, weekly journal entries commenting on the productions you see. Extra credit for journals written about shows you see outside of class. Fairly light reading. \n"
        },
        {
            "course_name": "New York Theatre",
            "review_date": "January 09, 2007",
            "review_content": "\nProfessor Burney and his lovely assstant Caralyn Spector are pathetic. This has got to be the least academically worthwhile class I've ever taken, or hopefully ever wiil. A horrible combination of gay-man's-talk-show-host and 3rd rate academic, the teaching in this class WILL NOT inspire you.\nBUT...\ntake this class anyway! Seeing a play every 2 weeks for an entire semester is worth every moment of humorless tedium. Really really really.\nWorkload:\n2 excessively long projects and a short journal entry for each show. Basically just show up to class and cobble together some BS for the papers. Also, read The Empty Space, not because you have to, but because it is an incredible work (and as an added bonus if you use it in your work you have a guarenteed A).\n"
        }
    ]
}