{
    "prof_info": [
        {
            "prof_name": "Anders Stephanson",
            "prof_id": 345,
            "total_reviews": 35
        }
    ],
    "reviews": [
        {
            "course_name": "US Foreign Relations 1890-1990",
            "review_date": "May 22, 2013",
            "review_content": "\nThis class is a good, good call if you're willing to put in the work. It is an absolute ton of reading, all of it rewarding, but none of it easy to get through just due to density. I took this class this semester as a freshman, and I learnt a great amount about really interesting issues, but it took up a lot of my time. Make sure you take good notes in lecture, and go to all of them - they're interesting, so it isn't hard. Also, the readings that you do (you can't do all of them, but try do most), take notes or make a summary of some sort. It'll be REALLY helpful.\nStephanson is a genius. He is a very engaging professor, and has a lot of interesting material to present.\nWorkload:\nIntense. Two take-home mid-terms (manageable, but not easy), an actual mid-term which is hard, and final that is manageable but super hard in the sense that it is 9 essays in 3 hours, so you have to know your stuff. Reading is massive. MASSIVE.\n"
        },
        {
            "course_name": "US Foreign Relations 1890-1990",
            "review_date": "November 08, 2012",
            "review_content": "\nTook this course as a sophomore, and almost two years later I still think about the major themes/concepts...yikes. The great thing about US foreign relations is that what you get out of it doesn't depend on what you think about Stephanson's personality and lecture style (personally, I thought he was pretty funny and organized, though he couldn't care less about student questions). The class is just really well-designed. The reading list is excellent--like previous reviewers have noted, you come away with a real sense of the history AND the historiography of the period, which many other history courses don't provide. By the end of the semester, I actually looked forward to doing the (huge amounts of) reading (!!). \nStephanson has a great knack of balancing the US 'in the world' with domestic events and ideology. Discussion sections made the class--they're a nice opportunity to tease out the finer points of the readings. Oh, and this course completely changed the way I look at the world. All in all, probably the most fulfilling academic experience I've had at Columbia.\nWorkload:\nOkay, so it's hard. One week we definitely had upwards of 600 pages of reading. But grading is fair, and if you make an effort and go to section, you'll get somewhere in the A range. Readings are extremely rewarding; midterm/final are scary verging on inhumane.\n"
        },
        {
            "course_name": "Problems in International History",
            "review_date": "April 16, 2011",
            "review_content": "\nStephanson is a brilliant professor with a dry sense of humor. It is quite an experience to hear him carry on in his Oxford Swedish English. The reading list is excellent and the class discussions engaging. Even though there are few formal requirements, I found myself doing all the reading out of interest. A class with Stephanson is a unique experience, he can be challenging, and his intelligence is intimidating,  but it is undoubtedly rewarding. Highly recommended. \nWorkload:\nPresentations\n"
        },
        {
            "course_name": "US Foreign Relations 1890-1990",
            "review_date": "January 21, 2010",
            "review_content": "\nI can say that Professor Stephanson's class was the best course I have taken at Columbia, and I have had some excellent professors. I found Stephanson's droll, unabashedly left-leaning remarks during lecture to be amusing and charming (although the effect might have been partially attributed to his accent). The focus of the class was heavy on the Cold War, and we never quite reached the year 1990, as promised in the course title. More time than I had anticipated was spent on the years before 1890, but everything that Stephanson lectured on was pertinent and interesting. He has lots of amusing factoids on American presidents. The class was intense and the pace was relentless. However, the effort you put in will be reflected in what you get out of the class. I worked hard, and I found it incredibly rewarding. This class made me a U.S. history major. Even my T.A. was fantastic. Take this class if you have a serious interest in history. It's awesome.\nWorkload:\nHeavy. A ridiculous amount of books, all of which are very good, and worth the read (although it is humanly impossible to read them all). Be ready to have this class be one of your top priorities for the semester, and do some wrist-strengthening exercises before you attempt the exams -- they are LONG.\n"
        },
        {
            "course_name": "US Foreign Relations 1890-1990",
            "review_date": "May 16, 2009",
            "review_content": "\nFrom the perspective of a Political Science major, Stephanson's class presents an alternative view on the events which have shaped U.S. Foreign Relations.  This can be both interesting and frustrating - while the (in)famous \"World's Fair\" lecture does leave one with lots to ponder in terms of the origins of western conceptions of \"other,\" the fact that the Cuban Missile Crisis is covered in less detail than the 1851 London Exhibition does seem strange for a class on U.S. Foreign Relations 1890-1990.  In fact, the material covered by this class (Spring 09) would be better served by the title \"U.S. Foreign Relations 1823-1976.\"\nThat being said, this is quite a good class despite the fact that it is a large lecture. Stephanson speaks well despite his frequent fumbling with (often unnecessary) Powerpoint slides, and his viewpoints are original and thought-provoking.  Unfortunately, the reading list is rather one-sided, typically espousing views that Stephanson himself holds (read: leftist, although not extreme) and tend towards a great-man interpretation of history.  \nIn short, HIST3491 is a worthwhile undertaking for those interested in American History or Foreign Relations, bearing in mind the aforementioned caveats.\nWorkload:\nModerate-High\nWeekly readings (necessary for the midterm/final)\nWeekly Discussion Section Postings (TA dependent)\n2 Short Take-home Papers (750 words, 2 days to complete)\nMidterm (4 short essays in 1hr15m)\nFinal (9 short essays in 3hr)\n\n"
        },
        {
            "course_name": "US Foreign Relations 1890-1990",
            "review_date": "May 14, 2009",
            "review_content": "\nThis is quite simply the best class that I have ever taken in my life here or anywhere else. You will learn so much that your brain will feel like its melting. TAKE IT! You will not regret it. \nWorkload:\nLots of reading, so be ready to make this class your focus of the semester. But if you put in the work, you will get out a great deal. 4 of 5 essay questions on the midterm. 8 of 9 essay questions on the final. Your wrist will hurrrrt. Also, two take-home essays of 500-750 words due next class day as well as an optional extra credit research paper of 20-25 pages that I don't think anyone did.\n"
        },
        {
            "course_name": "US Foreign Relations 1890-1990",
            "review_date": "August 15, 2008",
            "review_content": "\nPersonally I think people are being a little bit dramatic about the grading. I think roughly half of the students in the Spring 2008 semester scored in the A-range. Now that could be self-selected because this is certainly a challenging class, and he has a reputation. Tons of students I knew took him because of his reviews on here.\nAll that aside, this class is definitely worth it; it completely altered my view of the world and made me a history major. \nDefinitely a LOT of reading. \nHe's also really funny.\n\nWorkload:\nlike 12 books or something ridiculous\n"
        },
        {
            "course_name": "US Foreign Relations 1890-1990",
            "review_date": "June 19, 2008",
            "review_content": "\nAs mentioned by others, this is both a tough and enjoyable class. Stephason does a good job of organizing material both historically and thematically and adds a nice, dry wit to his lectures. \nA few tips to surviving Stephanson. 1) TA sessions are generally useless, but you should go so that your TA gets to know you and can associate your papers/exams with your name. 2) It's true that there's a ton of reading and most of it is very good, so I would recommend doing as much of it as you can. That said, it is probably impossible to do ALL of the reading if you're taking other classed. In short, you can survive this class if you have a good study group that splits up the readings and summarizes them. Also, what many people don't realize is that Stephanson often repeats the thesis of any given book in lecture--though he justly claims that his lectures are supplements to the readings, not mere summaries of them. For the exams, all you really need to know is the thesis of each reading and you'll be fine. 3)Write quickly on exams. You'll have to. 4)Don't fret if you don't do well on the take home exams. These are short two pager that are assigned twice during the semester. They're helpful for reviewing the material, but they probably won't smash your grade if you do well on the midterm and final. Stick to the word count and quote the readings, and you'll do fine. \nStephanson is a delight. His lectures are packed, and he expects you to learn both history and the historiography behind it. It's a class that is well worth taking if you want to learn something--and retain it. \n"
        },
        {
            "course_name": "US Foreign Relations 1890-1990",
            "review_date": "May 20, 2008",
            "review_content": "\nStephanson is a smart, handsome Swedish man and he is extremely aware of this. I'm not saying he's arrogant, but he understands the real value of making outrageous statements in the world of academia and then playing with your own mind to see if you can support them. I think he has built his career off of his ability to do this. Beyond this his lectures are very interesting but usually pretty hard to follow; he is very interesting to watch, though. Beyond this, this class is ridiculously hard. And not because I was frustrated by the amount of sheer work, but moreso because the amount of work is counterproductive. There is basically no way to do all the reading for this class unless it was maybe the only class you were taking. If the syllabus had half as much reading, everyone would probably learn twice as much as they do currently. The take-home short essay assignments are extremely broad, which everyone was freaking out about but I thought wasn't that bad since an open-ended question means you can say whatever you want, right? No. When Stephanson asks an open-ended question, he wants a specific answer, which is pretty unfair. \nThat said, if you have a knack for foreign relations and/or warfare and are into the individual personalities of presidents and perhaps political science, you might excel at this class. After not doing very much of the reading, I still feel much more knowledgeable about the subject matter, but not very confident in that. \nWorkload:\nRidiculous. Be prepared to read a lot of things and have to remember the argument of the author, as if that matters. If you don't do the reading or go to section be prepared to freak out at midterms and finals. \nDon't take this unless you're interested in the subject matter; you will hate yourself otherwise. \n"
        },
        {
            "course_name": "US Foreign Relations 1890-1990",
            "review_date": "August 07, 2007",
            "review_content": "\nYou will learn more in a lecture in this class than you will in a whole semester in a political science seminar, hands-down, but you'll have to work at it. Stephanson is brilliant (and knows it), and although his world view could be kindly described as \"what would happen if Hobbes and Foucault had kids,\" he plucks TAs from a wide range of ideological spectrums and encourages them to pick him apart. Watching his better lectures will give you an understanding of why people used to revere academics. Even lighter ones, such as the rather dry material on Kennedy, are elegantly designed. This's the only class where my jaw actually dropped at the end of a lecture about the design of World's Fair pavilions, Columbia's own campus, and Manila when I saw what he was getting at. I wanted to start clapping - it's that good.\nThat being said, the reading is PUNISHING, not just in amount presented, but in denseness as well, and you'll be expected to draw your own conclusions from it. Stephanson's book is the easiest to read - if you find it difficult, drop the class. Assigned papers and in-class exercises are one-sentence questions that're virtually limitless in scope (\"The War of 1898 was an aberration of American policy. Evaluate and discuss.\"), usually focused exclusively on material drawn from the readings, and scrutinized very carefully by the TAs.\nYou can't skip readings in this class. You might be able to miss a lecture or two, but they're really designed like building blocks - missing one leaves you with no foundation for the next one. It's a lot of work, and you're expected to actually interpret things on your own rather than parrot his views back to him (you'll get dinged on papers if you do this).\nIt's a hard course. But I felt like I really learned something, and that made me stick it out, even when the reading got almost inpenetrably difficult. \"Good\" professors and courses are a dime a dozen here if you know where to look, but \"outstanding\" ones like this, that make you willingly bear the workload, are rare. Take it if you have any interest whatsoever in how the last century happened.\nWorkload:\nA stunning array of difficult weekly reading (there's a brief let-up when he assigns \"The Quiet American\" for Vietnam) that you need to actually understand the arguments of to pass any exams; 3 short (1,000 word) papers to be completed 48 hours from the assignment date; 5-short-essay midterm (lowest-scored answer dropped); 11-short-essay final (two lowest-scored answers dropped due to an error in the printing, should've only been one); mandatory weekly sections that you'll need anyway to make sure you understand the reading.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 12, 2006",
            "review_content": "\nAnders is the man. No doubt about it. If you are only worried about getting an \"A\" in your core classes, switch immediantly. However, if you have a general interest in history, philosophy, and a handful of other topics he has a mastery of, Anders is the professor for you. Class discussions are interesting, but they dont always stick specifically to the texts. \nSome people here like everything outlined nicely for them, so they can calculate exactly what they need to do for an A, while absorbing nothing and only worrying about their GPA. Anders' class is not for these people. Nothing has a specific percentage for the final grade. He looks over all your grades, thinks about how he feels you did in the class, and picks a grade for you. To me, especially in a class like CC, that is much better than the alternative.\nHis views are interesting and he is good at connecting texts to the present day and if you like a laid back style of teaching, then this is the man for you.\nWorkload:\n1 Presentation on a book, 2 Papers, Midterm, Final...His bark is worse than his bite, you can do fine in the class if you work hard and stay active in class.\n"
        },
        {
            "course_name": "US Foreign Relations 1890-1990",
            "review_date": "January 23, 2005",
            "review_content": "\nThis is a tough class, and Professor Stephanson is not the easiest teacher you will have.  That said, it was a thrilling course form the perspective of learning.  While the material tends to lean to the left with Prof. Stephanson, there are a variety of viewpoints in the readings and there is no penalty for having your own view on events, so long as you can back it up.\nThe weekly discussion sections are a good tool.  They allow for deeper understanding of the prolific readings and often pointed me in the direction of chapters to read in depth which I had previously only skimmed.  There are lots of books - about a dozen.  Save some money and do lots of reading in the Butler or Lehman reserves if you like, but do take reading notes. \nMostly though, study for the exams.  Two short take home exams were easy, but the two in-class exams were brutal to say the least.  The first was five questions demanding four answers (with sufficient time for three) and the final was ten questions demanding nine answers.  The questions ranged from histriographical comparison to policy analysis to current foreign policy implications and demanded actual knowledge.  \nAll that being said, this was the best class I have ever taken.\nWorkload:\nBrutal.  Heavy reading, separate material in lectures and all covered on two sadistic exams.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 04, 2005",
            "review_content": "\nYes, so he's not a generous grader. Despite most people saying that he is harsh and him admitting that he is a harder grader than most other CC professors, he is fair nonetheless. However, his comments on your essays/exams are not really helpful. They are sparse and unreadable, and if you ask him what they say, he admits that he is often unsure what he wrote. Still, he is an incredibly interesting professor with a unique personality. If you want to learn, be excited to have him for a professor. If you want an A, don't count on it unless he thinks you are brilliant. And I really don't know why a reviewer said that you shouldn't let him know if you have political leanings to the right because Anders is certainly no liberal. In fact, he had a UN-bashing rant (certainly not leftist in nature) which was quite comedic. My guess is that he's a libertarian, but then again, I could be wrong: he's hard to decipher.\nWorkload:\nOne presentation (kicking off the discussion on one text) on a reading assignment (preferably 15-20 minutes long; just don't  summarize or else your classmates will have to watch him make faces during your presentation). Two papers of 1250-2000 words each. Midterm (10 ids, counts 9). Final (11 ids, counts 10 and 1 essay). No percentage breakdown for the worth of each component of the workload (it's mostly up to him).\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 04, 2005",
            "review_content": "\nOh, Anders. Let's just say when I asked him how much our midterm would count as compared to our papers he states \"Oh, but  it is all but a NARRATIVE in your academic life, sometimes it goes up, sometimes down\". Then and there I knew I should have switched classes. The way he teaches CC is not condusive to learning unless you have already taken many history classes and this is often the focus of his lecture. Besides from the obsure remarks he makes in class and the utter confusion you are left with at the end, everything was wonderful.\n\nWorkload:\nMidterm and Final very difficult, don't even think about skipping readings...Papers - half of the work is coming up with your own paper topic (example - \"Machiavelli and Hobbes can be seen as different or similar, write what you think\" -- if you can handle it, it's a learning experience you will never forget.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 23, 2004",
            "review_content": "\nBefore all the negatives I'll give him the benefit of the doubt.  Anders Stephanson is a very smart professor with an extremely deep knowledge of the historical context for the books on the CC syllabus.  You will probably learn a little more in his class....Given that, stay as far away as you can from his CC section.  He is undoubtedly one of the most obnoxious, pretentious, erudite professors that I have ever encountered.  He is unfair and inconsiderate to his students in the way that he conducts his class.  This lack of consideration for his students stems from how highly he regards himself.  As for his grading system, he is possibly the hardest CC professor in that regard.   He doesn't give you any options for the essay questions and grades them very harshly.  His midterm and final are also more difficult than other sections.  On the first day of class Anders told us this: \"For the sake of transparancy, I will admit that I am one of the more difficult graders.  But I tell you this knowing that usually they will not let you switch into another section because of a professor's grading.\" \nWorkload:\n2 essays (6-8 pages).  Midterm: 10 obscure quotes (choose 9).  Final Exam: 11 quotes, 1 essay.   Adds supplementary reading to the CC syllabus.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 23, 2004",
            "review_content": "\nBefore all the negatives I'll give him the benefit of the doubt.  Anders Stephanson is a very smart professor with an extremely deep knowledge of the historical context for the books on the CC syllabus.  You will probably learn a little more in his class....Given that, stay as far away as you can from his CC section.  He is undoubtedly one of the most obnoxious, pretentious, erudite professors that I have ever encountered.  He is unfair and inconsiderate to his students in the way that he conducts his class.  This lack of consideration for his students stems from how highly he regards himself.  As for his grading system, he is possibly the hardest CC professor in that regard.   He doesn't give you any options for the essay questions and grades them very harshly.  His midterm and final are also more difficult than other sections.  On the first day of class Anders told us this: \"For the sake of transparancy, I will admit that I am one of the more difficult graders.  But I tell you this knowing that usually they will not let you switch into another section because of a professor's grading.\" \nWorkload:\n2 essays (6-8 pages).  Midterm: 10 obscure quotes (choose 9).  Final Exam: 11 quotes, 1 essay.   Adds supplementary reading to the CC syllabus.\n"
        },
        {
            "course_name": "US Foreign Relations 1890-1990",
            "review_date": "November 10, 2004",
            "review_content": "\nExceptional class.  Very hard, filled with extremely intelligent students, but worth the effort.  The readings are interesting, the lectures entertaining, and the tests doable.\nWorkload:\nA lot of reading, of course.   Midterm, final, two short essay assignments.\n"
        },
        {
            "course_name": "US Foreign Relations 1890-1990",
            "review_date": "January 26, 2004",
            "review_content": "\nFirst of all this class is not for the faint of heart (see workload) Anders Stephanson takes this class seriously and expects as much of his students. On the bright side he is ABSOLUTELY HILARIOUS in his own dry way, he will make you guffaw in the middle of a lecture on Kennan. Stephanson is also highly intelligent and has a supreme grasp of his subject. He spices his lectures with words of his own creation (I like to think of them as Stephansonisms) has a wild look in his eyes, occasionally humps the desk for emphasis, and keeps bursting into spastic sticulations, all this just adds to the Stephanson experience. He is without a doubt one of the best professors I've had at Columbia. I learnt an enourmous amont from this class, partly due to the fact  that the reading list is nothing if not brutal (although far from impossible, I actually managed to keep up with the reading.) On the final and in the papers, he expects you to have a good grasp of not only events but different historiographical strains of thought. This is not a class for those of you who want to sit back and take it easy. \nFor those who actually want to learn and like a professor who respects your intelligence by stretching you to your limit, this is it, the bomb, el ultimo experience in the history department. \nWorkload:\nHardcore. 11 books. Three 750 word take-home exams (you get 2 days to finish them). A final consisting of 11 essay questions (you'll get graded on 10 of them). If you do all this and find your self wanting more there is always the optional research paper.\n"
        },
        {
            "course_name": "US Foreign Relations 1890-1990",
            "review_date": "January 04, 2004",
            "review_content": "\nStephanson is BRILLIANT! He is an excellent lecturer. If you're paying attention, you'll find he is actually very funny. Although he might seem intimidating, he can also be quite understanding, so don't be afraid to approach him. Nothing much left to say except he is as wonderful as everyone makes him out to be. You will learn A LOT in his class. It is definitely worth your time.\nOn another note, only take this class if you're willing to spend HOURS reading. Stephanson is defintely a hard grader, but if you show up to class, do the readings and go to the discussion sections, you should be fine. BEWARE of the final: no matter how much you've studied, you will feel like you haven't studied enough. Pay attention to small details; he is out to trick you. Pay attention to the TA's: their advice helps & they grade your papers, so make sure you know what they like/dont like. \nWorkload:\n3 (250-750 word) papers; final\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 18, 2003",
            "review_content": "\nHe is awful awful awful!!! I can't imagine why it would be okay to show up about an hour late to the final *and not apologize*! Not mention one single word about the fact that he kept 25 worried, nervous, hungry, tired, stressed-out people waiting for so long! Not even a simple \"I'm sorry, my mistake.\" The rudeness and irresponsibility is the worst of it, but the ironic thing is, he's not a good teacher, either! He historicizes and politicizes absolutely everything; he plays favorites very obviously, and he only responds to those students who match his political agenda. He talks entirely too much for a discussion-based class. Generally, I would say that even great brilliance does not excuse the lack of consideration and rudeness that he showed us, but he lacks any redeeming qualiites either way.\nWorkload:\nReading, presentation, two papers, midterm and final (both with impossible IDs that no one could guess). \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 15, 2003",
            "review_content": "\nProf Stephanson is undoubtably brilliant.  he is able to lecture on end about anything, especially history.  he \"tries\" to nudge along dicussion, but ends up lecturing the class the entire time.  I probably got the most out of the class just because it forced me to read some interesting texts.  perhaps this class would have been less boring if there were more people in my class who were willing to speak up in class.  \nWorkload:\nhe has an annoying habit of assigning papers that are due on the same day as the readings that the paper is supposed to be written on.  thankfully, only 2 papers, midterm and final.  midterm consisted of in-depth IDs, final of IDs and an essay.  and yes, he did show up half an hour late to our final...  he is also not an easy grader.  \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 13, 2003",
            "review_content": "\ni'm guessing it would be much better to have this guy for a foreign policy class than for cc. he is smart, but he speaks in such abstract terms and never answers questions, even his own. i got nothing out of cc the semester i had him. he doesn't really encourage class participation even though he says he does. whenever someone besides him starts talking, he interrupts them over and over again and follows up whatever they say with a twenty minute comment of his own. oh and he showed up thirty minutes late to the final. avoid him if possible.\nWorkload:\nDO the readings, two 5-8 page papers, midterm, final\n"
        },
        {
            "course_name": "US Foreign Relations 1890-1990",
            "review_date": "August 04, 2003",
            "review_content": "\nThe good news: he is brilliant, interesting and knows it all. The bad news: you will be lost in his lectures and so will he. I have a feeling that his morning NY Times dictates his theme of the day more than the syllabus. \nWorkload:\nTOO MUCH readings. Otherwise reasonable.\n"
        },
        {
            "course_name": "US Foreign Relations 1890-1990",
            "review_date": "February 27, 2003",
            "review_content": "\nThis is the sort of class that makes me wish, in retrospect, that I actually did the reading.  Yes, there is a lot of it, but it's all pretty worthwhile stuff.\nI didn't find Prof. Stephanson to be quite the person some other reviews make him out to be.  He's got a remarkable sense of humor, of that dry, European variety, and if you're paying attention the lectures are peppered with moments of subtle hilarity.  As far as lecturing itself goes, Stephanson is probably the best I've seen at Columbia.  His mastery of the subject is more than evident, and it's true that one gets the sense he could lecture on randomly assigned topics for hours at a time without anyone being any the wiser.\nHis interpretation of American foreign relations is a little left, but even as a right-leaning student I certainly didn't feel that he made any attempt to project his views in any radical, unjustifiable way.  His overall conception of the time period seems to make quite a bit of sense.\nAll in all, the class is well worth taking.\nWorkload:\nThe reading is on the heavy side, averaging maybe 200 pages a week?  It's doable, though, and it's pretty interesting.  Otherwise, one in-class midterm and one final, both with very little, if any, \"choices.\"  That is, you're going to answer what Stephanson wants to ask you.  There was an optional research paper, but from what I understood the previous classes made (and perhaps future classes will make) it mandatory. \n"
        },
        {
            "course_name": "US Foreign Relations 1890-1990",
            "review_date": "February 26, 2003",
            "review_content": "\nI would never recommend this course to anyone.  I am a history major, and found the lectures to be extremely boring and very left of center, to the point where I would leave class frustrated.  I often wondered if Stephanson was really pursuing historical accuracy or suppressing evidence in order to promote his view of history.  There was never anytime for questions, as he would drone on without asking for questions or feedback.  There is something certainly negative to be said for professors who never ever involve their students in lecture.  Weekly discussion sections were ok.  If you are not a history major, do not take this course.  If you are, l would still look for another history class to fulfill your requirements. Dull, way too much reading (this isn't a seminar), a very biased leftist view. \nWorkload:\n1 midterm and 1 final-- very demanding\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 24, 2002",
            "review_content": "\nTrue, this man is not afraid to interrupt you, change topics from the ones you brought up, and tell you in his own quasi-Swedish way that you're dead wrong, but you end up forgiving him because he just plain knows his stuff and knows how to teach. If you want to get the most out of CC, take Stephanson. He might scare you a bit, but you'll find out he's a pretty good guy [and once you see him walking around campus in his squash get-up, your fear will subside anyway]. Bottom line, stephanson is a real character [his wardrobe is Jon BonJovi meets Joe Namath], and you'll leave the class feeling educated. If you came to Columbia to take the Core, I recommend good ol' Anders.\nWorkload:\nMidterm and Final were tough, but he loves teling you your answers were subpar so he pitied you with inflated grades. 1 fifteen-minute [not too bad] Presentation. 2 papers with EXTREMELY broad topics [the whole point of your essay is to figure out what he was asking in the first place]. All in all, keep up with the reading, and don't be afraid to speak your mind in class [even if he shoots you down] and you'll get by with a decent grade. He's not out to screw you, just maybe intimidate you a bit.\n"
        },
        {
            "course_name": "US Foreign Relations 1890-1990",
            "review_date": "December 19, 2002",
            "review_content": "\nAt times Stephanson seems to be a caricature of himself, with his strange accent, terrible clothes and jargon-laden diction.  However, I found him to be quite a good lecturer.  I don't think that he is remarkably brilliant, just a smart man who has a very good and nuanced understanding of US foreign policy.  All of the lectures were fairly informative, and many (e.g. on the domestic impact of the Cold War, on FDR and Stalin) were really quite interesting.  In fact, this class is definintely worth taking just for the excellent lectures.  There are some drawbacks, however.  Stephanson doesn't really leave any time for questions, which I found annoying sometimes.   A weekly section is required, which was the low point of the class.  After listening to Professor Stephanson present a complex and intelligent version of the history, hearing the TA give the high school version, with some poorly thought out liberal dogma mixed in was tiresome. (Stephanson, by the way, does not seem to follow any particular orthodoxy, although his interpretations are generally a bit left of center.)  However, she did grade the exams, which probably made the curve easier.  Also, the amount of reading required was excessive, in my view.  I would have liked to have done it all, but there was just far too much.  My only criticism of the lectures themselves is that  they were sometimes a bit too theoretical and focused too much on ideological and historiographical issues.  This is a minor complaint, though.\nWorkload:\nLots and lots of reading, a midterm, final and optional twenty page paper (I like most of the class chose not to do it.)  The midterm was moderately difficult, the final was harder.  However, I managed to get an A-, while skipping significant parts of the reading.  So it's not impossible.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 15, 2002",
            "review_content": "\nthe man, the myth, the legend....anders stephanson.  quite possibly THE best teacher i've had in my life, even though i was terrified of him for the first month!  This man can lecture about ANYTHING, from current foreign poltics to the development of fashion; he's clearly brilliant and, clearly, very sure of himself.   A terrific class when you do the reading and if you can handle being told that you're wrong, in no uncertain terms.  Aside from my bruised ego, I thoroughly enjoyed listening to Stephanson take someone as seemingly dull as Aquinas to levels I'm not even quite sure I knew existed prior to this semester!  I'm actually upset that I won't be in his class next semester (apparently, he rarely teaches both semesters).   By all means, track him down and enroll in his class...he is amazing.  One of Columbia's greats, for sure.\nWorkload:\nnot too much reading, but two extremely difficult papers which usually are fairly graded.  midterm and final both are HIGH stress, but i doubt anyone really does well on them anyway\n"
        },
        {
            "course_name": "Historian's Craft",
            "review_date": "January 30, 2002",
            "review_content": "\nProf. Stephanson stands out in the history department, and even in the college, as an extraordinarily demanding taskmaster. However, the pressure does not come from him holding your grade over your head, but from his energy and the high standards he holds for everyone with whom he comes into contact. His intellectual curiosity seems to know no bounds, and he will give lectures off the cuff on ANY subject--clear evidence that whatever he expects from his students, he expects more from himself. Although many find Prof. Stephanson to be curt and unfeeling, he is pretty good about reaching out to students who show an interest in the material, and he has been known to go out of his way for such students on more than one occasion. The best part about studying with Stephanson, though, is working through his often quite stimulating interpretations. Usually, you only half understand what he is saying when he says it, but then it hits you with full force a year later as you are walking down the street. Plus he's quite funny.\nWorkload:\nUsually pretty overwhelming. Even when the actual assignments aren't that bad, you spend twice as much time on them as you ordinarily would because you know that he's going to be going over your work very carefully.\n"
        },
        {
            "course_name": "US Foreign Relations 1890-1990",
            "review_date": "March 31, 2001",
            "review_content": "\nStephanson has been known to say \"If you don't read a book a day you'll fall behind.\" If you can handle one of his classes then you're a better man than I.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 31, 1999",
            "review_content": "\nRun like hell from this pompous man. Stephanson will constantly interrupt and tell you that you are wrong and your interpretations suck. He seemingly refuses to address any important points in the books that we read and instead tries to impress you with his extensive knowledge of history. Stephanson definitely teaches like he's got a severe case of ADD but nothing that he ever talks about ends up interesting. Definitely to be avoided.\nWorkload:\n2 papers, 1 midterm, 1 final. All graded hard. He doesn't believe in A's. The midterm was a list of 10 ids, all one sentence long and could have been from any work that we read.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 31, 1999",
            "review_content": "\nStephanson is an arrogant one, but he can back it up. The man literally knows everything, but he's not too lecturecentric. The discussions in this class have been some of the best I've been in, and he has the ability to really make you interrogate the way you think. That having been said, he can be strident, grades very harsh, and gives pop quizzes and impossible midterms. A great experience, but not good for your GPA or your sleep.\nWorkload:\nTwo papers, an oral presentation, and a midterm, which consists of ten impossible IDs, each of which is one sentence long and could have come from any of three books. He grades very, very harsh, but generally fairly. I fear for the final.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 31, 1999",
            "review_content": "\nProfessor Stephanson knows everything, which is just a teensy bit intimidating for the rest of us who know (you got it) nothing. The syllabus/course handout from the first day of class calls for \"vigorous\" participation in disussion, but unless you are unusually quick on your intellectual feet and don't mind a bit of buffetting (A.S. buffets unreservedly), keep quiet and thank the lord he never ever picks on individual students to speak. Within about three meetings, the class sorted itself into the talkers and the mutes, with A.S. as the head of the talkers and me as the head of the mutes. (Random story: I once heard another professor describe him as \"A great big pussycat underneath.\" Don't you believe it....)\nWorkload:\nTwo papers, rough midterm (ambiguous I.D.s), rougher final to come, oh, and a presentation.... \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 31, 1999",
            "review_content": "\nBrillant. Brillant. Brillant. Everyone that complains about how difficult he is or how arrogant he is doesn't realize that he actually challenges the students to gain a true understanding of the material. You can participate if you want, and if you do, you will get a lot more out of class than the people who sit silently in the corner. If you are wrong, he will tell you, and while some may not like that, it's certainly better than a wishy-washy professor that \"agrees\" with everything uttered in class. Switch out of his class if you are timid, sensitive, grade-obsessed, or just plain dumb. If you don't fall under any of those categories, stick with it, and I promise that you will be rewarded.\nWorkload:\nTwo 5-8 page papers, 1 short midterm, and 1 final. He is a very hard grader, and his exams are very difficult, especially if you haven't listened in class.\n"
        },
        {
            "course_name": "US Foreign Relations 1890-1990",
            "review_date": "December 31, 1999",
            "review_content": "\nBrilliant. Stephanson is extremely intelligent, and his expectations are high. You have to be comfortable dealing with the kind of pressure (both from work and from the force of his personality) that he's going to put on you, but it's worth it. The lectures are jam-packed with information and interpretative nuances, such that you have to pore over your notes afterward. The mid-term and final are very difficult. Highly recommended for serious students willing to work. Otherwise, I imagine that the class would be a painful experience.\nWorkload:\nA good deal of reading, for which you are held directly accountable. A research paper, midterm, and final.\n"
        }
    ]
}