{
    "prof_info": [
        {
            "prof_name": "Tianqi Jiang",
            "prof_id": 13602,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Elementary Chinese I (N)",
            "review_date": "May 24, 2019",
            "review_content": "\nGo for it. 100% take Jiang Tianqi's class.\n1. She is hella chill and has a dry sense of humor. \nIf you are going to go to class 4 times a week, you want to be with someone who is enjoyable to be with and she is certainly enjoyable. If you are looking a sunshine rainbow all-is-good kind of teacher go look somewhere else. Instead once you get friendly with Jiang teacher, she exposes her true dry sense of humor and its pretty wonderful. Her hilarious and cold advice on human relationships is enough to convince you to give up on friends. That being said, she is surprisingly kind. If you f up, she will help you 100%\n2. She cares alot.\nWhile she will never admit it, she loves her students. She puts a lot of effort into trying to make the classes fun. Legit the best time I have every week is when we learn new Chinese characters, and she always brings interesting questions to make it fun.\n3. She will make you actually learn Chinese.\nI've learned a lot. And she will push you to digest a lot of Chinese whether you want to or not.\n* I never learned Chinese before, and that meant there was a fair bit of time I had to invest. But I had a blast, and Jiang Tianq is a great Chinese teacher.\nWorkload:\nDaily character/grammar quizes (its a language course, what else did you expect)\n=> the workload is plentiful, but never overwhelming\n"
        },
        {
            "course_name": "Elementary Chinese I (W)",
            "review_date": "November 03, 2018",
            "review_content": "\nI love her! She's has a great personality, very humorous and a great professor. She is very understanding and if there's any problem, shoot her an email. My Chinese did improve with her and I really enjoy going to class even though learning how to read and write in traditional Chinese is such a struggle. Make sure to get your book early, makes your life a lot easer and if you can find a second hand one, even better. Participation is a huge in this class. She expects you to converse and talk in mandarin. But all in all, it's not a hard class, just you gotta work and study. \nWorkload:\nDictation/listen-write quizzes everyday, several homework assignments based on the book, unit exam for every 2 units finished\n"
        }
    ]
}