{
    "prof_info": [
        {
            "prof_name": "Susanne Knittel",
            "prof_id": 2901,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": " Elementary Italian I",
            "review_date": "December 07, 2006",
            "review_content": "\nProfessoressa Knittel is an amazing professor! She's so young and lively, and she really cares about her students! The work can be quite challenging, especially in the beginning, but she is always willing to help if you need it. If you take a class with her, you will most definitely speak better Italian by the end of the semester.\nWorkload:\nStandard Elementary Italian workload -- tedious but very fair.\n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "December 07, 2006",
            "review_content": "\nProfessoressa Knittel is an amazing professor! She's so young and lively, and she really cares about her students! The work can be quite challenging, especially in the beginning, but she is always willing to help if you need it. If you take a class with her, you will most definitely speak better Italian by the end of the semester.\nWorkload:\nStandard Elementary Italian workload -- tedious but very fair.\n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "April 30, 2006",
            "review_content": "\nSusanne is an absolutely fantastic instructor in every regard. This was her first year teaching Italian, but she was more enthusiastic and knowledgeable that many more seasoned professors that I've had. Although the course syllabus is standardized by the department, she kept things interesting by coming up with lots of interactive exercises (including a lot of skits) and focusing on what students wanted to cover in class. I think she's unique in the sense that she truly listens to the concerns of her students and will do whatever it takes to help people do well (she was always available outside of class and responded to e-mails within a few hours). The course itself is not life-changing (and sometimes covers too much vocabulary in too short a period of time), but Susanne always recognized these deficiencies and was more than willing to spend additional time working the more troublesome concepts. She made it so everyone looked forward to class, even though it began ridiculously early in the morning (well, 9AM); she was always chipper and ready to get working, which was crucial on those groggy Monday mornings. If you're taking Elementary, you should definitely consider having her as your instructor (many people in my class were dismayed that she wouldn't be teaching Intermediate). She will be one of your favorite professors, I promise.\nWorkload:\nWeekly chapters out of the workbook, as well as lab activities that can be done quickly if you're in a hurry. Semi-weekly compositions (none longer that 150-200 words), graded very fairly. Weekly quizzes that vary in difficulty, but are nothing to worry about if you study (Susanne will usually tell you what to focus on beforehand). One five-minute presentation per semester on a topic of your choice; again, graded very fairly. A mid-term that is not much longer than a quiz. A final that touches on everything but is not exhaustive, especially in terms of vocab. A lot of busy work, but it's relatively easy and even enjoyable at times.  \n"
        }
    ]
}