{
    "prof_info": [
        {
            "prof_name": "May Ahmar",
            "prof_id": 3276,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Arabic I",
            "review_date": "January 19, 2010",
            "review_content": "\nI have long graduated, but this woman still haunts me ever time I think about Arabic at Columbia.\nFor non-native speakers, she's perfect, because she perfers to have those students in her class. As for native arabic speakers or muslims, she will tear your work to shreads. \nIn the beginning, I thought I should just work harder. Nope. No matter how hard I worked, my grades would not move from C's to low B's. She never had any mercy and made us write a 2500 word essay for 2nd year Arabic, AND DID NOT GRADE BASED ON EFFORT WHATSOEVER. This woman has no mercy and has a bizzare personality outside the classroom (acts like she's your best friend.) \nI advise you not to take May Ahmar if you are Arab or Muslim. You will not do well in her class. You will go home and cry in the fetal position for years after you took this class. \nWorkload:\nRegular Arabic at Columbia workload. Hours of homework, random quizzes, regular tests and long essays. \n"
        },
        {
            "course_name": "Elementary Arabic II",
            "review_date": "December 22, 2008",
            "review_content": "\nI didn't write a review about May for almost a year because I did not know how to explain her and did not know to what extent she had influenced my Arabic. She is an extremely capable teacher, and she knows how to teach Arabic to English speakers. I must say that the class is extremely challenging. May's class is probably about 25% harder than all other Elementary Arabic classes because she goes beyond the book in explaining certain grammar points, has us do much longer presentations, grades harder, etc. But because of this, our Arabic improved quickly and with much more precision than many. In Intermediate Arabic, May's alumni already knew most of the grammatical points that were supposed to be new. We also had done longer presentations and so were not afraid of the presentations that we had to give. She makes second year easy by comparison, which, depending on your constitution, can be either a good thing or a bad thing. May is quite demanding, and she expects you to learn on your own before coming to class. If you end up in her class, be sure to know the vocab before class because she will test you, and she will make a note if you can't form sentences with it. However, although she expects you to learn on your own, she is willing to go over difficult points with you (providing you make an appointment) and she has a knack for explaining things in a way that makes them easy due to her background in linguistics. Arabic is a difficult language, and May is a difficult professor. However, frustrating though it sometimes was, it is unbelievably rewarding to have worked for a grade and a grasp of this language and to achieve it. May really wants her students to succeed, and her tough love approach is the most valuable one she could take in this because she forced us to work hard and to get the very most out of our Arabic study. She is responsible for keeping my interest in this language high, and I am still in contact with her a year later. She is the one teacher at Columbia that I would recommend wholeheartedly because if you are willing to work hard, she is the best one possible to teach you.\nWorkload:\nDepartmental standardized syllabus. Several hours of homework a night, about 25% of your grade. May tends to add more creative homework assignments like little pieces of writing, but she also lets you correct your homework and takes this into account. Bi-weekly standardized quizzes which are easy in May's class, and final presentation/final. Final is not challenging with studying, and the presentation is manageable with time. All in all a manageable class though completely time consuming due to the amount of information you are expected to learn and the hours of homework each night. But it's a five point class, so you know what you're getting into.\n"
        },
        {
            "course_name": "Intermediate French I",
            "review_date": "May 19, 2008",
            "review_content": "\nEverything previous reviewers have said about May is true- she is a nice person, tries to be fair, and tries (successfully) to make class engaging and useful. \nMy only criticism of May is that she does not seem to know how hard Arabic is, and sometimes equates not doing well and not trying hard. I guess this is not an uncommon problem among language teachers, and May is no different.\nWorkload:\nDepartmental syllabus. \n"
        },
        {
            "course_name": "Elementary Arabic I",
            "review_date": "April 01, 2008",
            "review_content": "\nMay is an unbelievable professor. She is (in my opinion) the best and most capable professor of this specific class, and our class has consistently out-performed all of the others on standardized tests, etc. \nHowever, do not take her class if you are not prepared to work extremely hard. She is HARD. She is a fair grader, but tough, and she does not make exceptions when, for example, you forget to turn in the daily homework. She is very good at explaining the material, however, and truly wants to bring her students up to a level of understanding and competency in Arabic that. If you're not afraid of a challenge, take her class. I plan to take her classes for as long as possible.\nWorkload:\nDaily homework, several hours a night, which is like 25% of your grade. Bi-weekly standardized departmental quizzes (no midterm, which is nice), challenging final. With May part of the final grade is a 15-20 minute presentation in Arabic, but you work up to it. Also, if you get below a B- in the class you can't continue on to level 2, and you're not allowed to pass/fail it. Fyi.\n"
        },
        {
            "course_name": "Intermediate Arabic I",
            "review_date": "March 11, 2008",
            "review_content": "\nMay is the best professor that I have ever had at Columbia. She, without a doubt, changed my view on things and made me want to study Arabic to fluency. Be aware - she is not American, and therefore does not adhere to American standards of grade inflation - nonetheless, if you work hard, you will be rewarded (she will give you an A if you prove that you deserve the A). She likes students that are polite and dislikes those who are arrogant - which isn't too hard to understand. The class sessions are a breeze, and I always looked forward to going to class - homework, on the other hand, is not (but these are the departmental rules). With all said and done, I learned more from May than from any other Arabic teacher at Columbia, and if you have the chance to take her class, do so - if you care at all about your Arabic. She is always available to help you and her office hours are a great help.\nWorkload:\nThe usual for Arabic. Perhaps a little bit more because she likes to give creative assignments on top of the normal homework. Correct your homework after you get it back so that you actually improve - people who do not will keep getting bad grades.\n"
        },
        {
            "course_name": "Intermediate Arabic I",
            "review_date": "October 29, 2007",
            "review_content": "\nMay is very nice, approachable, and a clear teacher. She tries to make class enjoyable and by and large succeeds, even when we're covering some rough grammar. She really wants the students to succeed and will make time to try and help you- she is a fair grader, but follows the language departments standards, so its not really an easy A.\nWorkload:\nDepartmental Syllabus- a few hours a night, par for the course for Intermediate Arabic.\n"
        },
        {
            "course_name": "Intermediate Arabic I",
            "review_date": "October 01, 2007",
            "review_content": "\nMay is an amazing professor. She has a history in linguistics and it shows! But for the light of heart - be warned - May is incredibly challenging as a professor. Every detail is important to the learning of the language. She is a tough grader, but is very open to student input and is always looking for ways to improve the overall classroom experience. Be prepared to participate in class - and always be prepared with the new vocabulary and grammar.\n\nWorkload:\nPretty general - workbook exercises due every day, quizzes every so often, for my class our midterm was a typed essay - and then a final.\n"
        },
        {
            "course_name": "Intermediate Arabic I",
            "review_date": "October 01, 2007",
            "review_content": "\nMay is an amazing professor. She has a history in linguistics and it shows! But for the light of heart - be warned - May is incredibly challenging as a professor. Every detail is important to the learning of the language. She is a tough grader, but is very open to student input and is always looking for ways to improve the overall classroom experience. Be prepared to participate in class - and always be prepared with the new vocabulary and grammar.\n\nWorkload:\nPretty general - workbook exercises due every day, quizzes every so often, for my class our midterm was a typed essay - and then a final.\n"
        }
    ]
}