{
    "prof_info": [
        {
            "prof_name": "Emily O'Dell",
            "prof_id": 10567,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Ancient Egyptian Civilization",
            "review_date": "November 17, 2011",
            "review_content": "\nEmily O'Dell is PHENOMENAL. She is everything that a professor should be and more. She is passionate, inspiring, and can make any subject interesting. Taking a seminar with Professor O'Dell is a privilege. Every class is fun and engaging, with lively discussion and lots of stories from her worldwide travels. She is incredibly intelligent and has a unique ability to pass on her passion to her students. There will not be a single class you sit though without laughter -- she is a wonderful story teller. There are also lots of options for class field trips (which often include eating food)! Simply put, if you have a chance to take a class with this woman DO IT. \nWorkload:\nModerate. There is a fair amount of reading, but nothing unmanageable, especially given that the class meets only once per week. Two short midterm papers, one final paper. Attendance and participation is about 1/3 of your grade. Be enthusiastic, do your work, and make sure that your papers read like a college student wrote them and you will be fine. You will NOT regret taking a class with Professor O'Dell. \n"
        },
        {
            "course_name": "Ancient Egyptian Civilization",
            "review_date": "January 15, 2011",
            "review_content": "\nProfessor O'Dell is exactly the kind of teacher that Columbia needs. She taught each lecture using slides from her past trips to Egypt where we were able to see inside ancient tombs and archaeological sites that no one else in the world has the ability to see. She is extremely intelligent and knowledgeable about ancient Egypt and she's easy going about practically everything. She made a college seminar become a course where I actually felt like I was learning something just for the joy of learning something quite spectacular. \nWorkload:\n2 papers about anything you want related to the subject. Stickler about writing a well structured paper, but she tells you exactly how she likes them written, so you can't mess that up!\n"
        }
    ]
}