{
    "prof_info": [
        {
            "prof_name": "Zhixing Chen",
            "prof_id": 11111,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Organic Chemistry",
            "review_date": "January 18, 2011",
            "review_content": "\nCornish was great, though probably not who you want to take if you're just trying to skim by. If I had to give Cornish a grade I'd probably give her a B+ and maybe I'm being too harsh. Regardless, I'd recommend her to anyone who actually wants to learn organic chemistry without a second thought. \nI understand most of what has already been said about her. Some of it's bogus though. She's strick, but she really does care, and you will benefit from both if you choose to. I'll try to help you figure out if you want to take her course. \nFirst, she does a pretty good job at letting you know what to expect. The format of the test is always the same. Some of the questions cover fundamental material that would be inexcusable not to understand. A greater amount of the test is about understanding how those fundamentals relate to each other (like considering resonance vs. sterics or the effect of the solvent in boundary cases like secondary carbons). You need to understand all the mechanisms, reagents, solvents, and be able to draw free energy diagrams for every type of reaction. Period. No surprises. \nIf you don't spend some time in the beginning of the semester on fundamentals you will probably hurt later on. And she tells you this. Memorize your pka values, sure, but even more important you need to understand those values relative to each other (i.e. Why does a ketone have a lower pka than an ester? And why is the pka of carboxylic acid anhydride between the two?).  \nNow, Cornish will tell you not to memorize rules and mechanisms and such. She's not lying, but she's also not telling the truth. Memorize all of it. Everything she puts in her notes-- which is not nearly as bad as it sounds. She writes legibly and very, very, slowly-- but you need to understand it too-- as in \"defend your answer to your peers\" understand it.  \nOk, so once you go through all of that (it'll take a while, I promise), it's also about your ability to take a test. She'll tell you that you're probably not going to get the last answer right, and she's probably right. So look at it in the beginning if you want, but only commit to it once you know that the rest of the test is as perfect as your going to get it.  \nWith that said, some advice for that last question. It will surprise you-- and you just might panic and forget to breath just like the rest of the class-- but before your hand cramps from scribbling for partial credit remember two things: \n1. Every time she went over the answer after the test it was always simpler than I had guessed. Follow the hints. Follow the hints. Follow the hints.  \n2. Maybe it's a bit masochistic, but I learned something from every one of Cornish's tests. That last question is designed to teach you something. Even if you dont get it the first time through go back to it and figure it out. It might not help you answer that next big question, but she's going to assume that you understand it all the same. \nOrganic chemistry is an elegant subject. While Cornish's lectures might not be great at helping you see that, she asks that kinds of questions that will.\nWorkload:\nStrenuous, fair. Four midterms, weekly quizzes, and a final. The quizzes count for some negligible amount of your grade, the final counts as four (or maybe it was three?) midterms and you drop the lowest two. \nI got an A- in the course. My first test was just a few points above teh average, and every test I climbed higher above it. I probably didn't understand the material any better (relatively), but I actually started taking her advice and not making foolish mistakes. \nYou'll do fine. You'll learn lots. \n"
        }
    ]
}