{
    "prof_info": [
        {
            "prof_name": "Thai Jones",
            "prof_id": 12807,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Human Rights Senior Seminar",
            "review_date": "January 07, 2014",
            "review_content": "\nPROFESSOR:\nThai Jones is a great professor. Friendly and accessible (he goes by Thai).\nThe level of class participation was nothing special, but Thai's written and in-class comments were helpful. He was particularly good at explaining and reviewing assignments. His specialties are urban studies and the history of radical movements. As such, Thai's focus was on academic quality as opposed to strictly coaching us under a human rights framework. I felt that he cared about our work, which made me confident that what we wrote would be fairly and thoroughly considered by someone who knew what they were talking about...really all you can ask for in a thesis/pre-thesis seminar I guess.\nThat said, Dr. Jones' single-minded obsession with museum laws, of all things, was out of place in a human rights class. His constant references to obscure cultural artifacts were distracting at best. He told us fanciful stories about when he discovered the Holy Grail and escaped from Nazis.\nCOURSE:\nYou're taking the course because it's mandatory for all human rights majors.\nI was cold on this class coming in (a rehash of Intro to Human Rights done by an unknown TA?) but the professor more than salvaged it. That said, the majority of our time was spent discussing yet another human rights article or listening to yet another one-off guest speaker. We're all majors, we've all read and heard way too much about random human rights topics already.  I think it was strongest when we were doing peer exercises such as drafting op-eds or reviewing each other's essays.\nThere was also a visiting student in the class. Fine, but pretty unexpected for a departmental senior seminar.\nWorkload:\nThe workload and readings are mostly set by the human rights department. Average of 75 pages per week. Professor Jones cut back a bit on the readings by the end, which was appropriate.\nClass participation (20%, not too tough); thesis proposal (1-2pg, 5%); op-ed (2-3pg, 10%); a thesis-related literature review/midterm essay (10pg, 15%); and a final paper OR thesis draft, depending on if you go on to take the optional thesis course in the spring (25-30pg, 50%).\n"
        }
    ]
}