{
    "prof_info": [
        {
            "prof_name": "Jacqueline Olvera",
            "prof_id": 3349,
            "total_reviews": 15
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Urban Sociology",
            "review_date": "January 23, 2012",
            "review_content": "\nSo basically the class was a waste of time. While it did fulfill my Barnard Social Analysis Requirement, I was quite often zoning out and there was really no need to go to the class if you could understand her power points. The class is mainly how race (black vs white basically) works in the city, so if you find that a little aggravating don't take the class. I got aout with a B+. The TA's grade the paper and honestly depending on who grades your paper and what mood there in your grade can change exponentially. \nA lot of work outside of class is required and you will be expected to interview strangers who quite often cop a tude.\nWorkload:\nIf you do all the \"required reading\" its ALOT. If you go to class and take notes on EVERYTHING she says because its hard to write the final exam paper without it - its still a good amount of work. If you're really good at writing sociological papers and like writing them...take it. IF NOT, DO NOT.\n"
        },
        {
            "course_name": "Introduction to Urban Sociology",
            "review_date": "January 13, 2012",
            "review_content": "\nThis class was an absolute waste of time save for the interesting field work. Professor Olvera simply summarized the various readings in each class and as a result most people just stopped showing up. I found her lectures to be boring at best and terrible at worst. I did not complete any of the readings after the first week and I was just fine in the class grade-wise. Overall, if you are interested in urban sociology, perhaps take this course but skip lecture and do the readings or just don't take the course at all. \nWorkload:\nthree 4-5 page papers about a specific census tracts and a 5-6 page take home final. pretty light overall. \n"
        },
        {
            "course_name": "Introduction to Urban Sociology",
            "review_date": "November 16, 2011",
            "review_content": "\nI actually enjoy this class and would generally recommend to someone who might want to be introduced to a different way of looking at the environment we study in. Prof. Olvera is a nice lady, she does explain things well, she obviously knows what she is talking about, and I do like the fact that, despite being in a lecture hall, she asks questions and tries to get people to analyze and discuss the topics at hand (which is can be borderline painful when either the entire class is reluctant at the same time, or, more likely, didn't read the big ass urban ethnography she had the audacity to assign for an intro course). Granted, I'm an Urban Studies major, and I actually love Urban Sociology--I'm specializing in Sociology for my major--so I could read urban ethnographies all day; However, I don't think the vast majority of the class has acquired the...taste... for such works just yet and feels little motivation to read them. But the material, if inconsiderately long at times, is interesting if you like to think about how people interact and stuff; to be completely honest though, I took Sassen's Global Urbanism and Baic's Craft of Urban History last year and have already learned everything she's teaches, so I don't put much effort in.\nI do think it's a bit of a pain in the arse for her to base 60% of your grade off of these written reports you have to do field research for and only 25% on the material that we literally spend the entirety of the class discussing. Not only are these assignments really easy to fake (why travel to Far Rockaway on 3 different days to observe the census tract when you could just make it up?), but, being currently enrolled in Methods for Social Research and knowing just how REAL sociological research can get, the fact of the matter is that these students are not going to walk away with any significant understanding of what social research is actually like. I get that she wants to  introduce us to both theory and the methods of urban sociology; but I think she needs to reverse her priorities because the major strength of this class is the material itself, not the half-arsed attempts to \"get our hands dirty\".\nPlus, I always harbor some animosity towards any prof who takes attendance, at EVERY SINGLE LECTURE, and makes attendance/participation 15% of your grade. I'm pretty sure I have my HS diploma so don't treat college students like their little teenagers who need to be coerced into being responsibility. You are educating ADULTS--so act like it.\nBut that's just me.\n\nWorkload:\n5 pg report describing a census tract in new york - 20%\n5 pg report describing field observations in the census tract - 20%\n5 pg report describing interviews with ppl in same tract - 20%\ntake home final - 25%\nattendance/participation - 15% (and if this is true, i don't know how many are passing....)\n\n"
        },
        {
            "course_name": "Introduction to Urban Sociology",
            "review_date": "November 08, 2010",
            "review_content": "\nShe's a very nice lady and will help you in any way possible. Plus she actually learns your name. If you want a relatively easy class, you should take this one. You basically have weekly assigned readings and the classes are composed of powerpoints so you don't have to take any notes as you can print the powerpoint before class. All the readings are summarized in the powerpoints so it's not confusing at all. You have 3 papers that concern a census tract in Manhattan so you do have to prepare in advance because they take up a lot of your time. The class is really interesting, and the class discussions are too. It's worth taking this class to fulfill a requirement.\nWorkload:\nWeekly readings, 3 papers (5 pages) and a final take-home essay. no midterm.\n"
        },
        {
            "course_name": "Introduction to Urban Sociology",
            "review_date": "March 31, 2010",
            "review_content": "\nI found the course material interesting and the lectures helpful and informative.  Prof. Olvera's PowerPoints are thorough and her lectures provide a deeper analysis to the material.  It's not always fascinating stuff, but I do feel like I learned a decent amount about urban life. \nThe problem with the class is that the grade is mostly based on a series of assignments you do; you pick a census tract in the city and write three different essays about different aspects of it over the course of the semester.  So the grade ends up mostly being based on your ability to do a sociological study...thus even if you've done all the reading and kept up with everything, you might not really get credit for that.  The TA (Dave) is a harsh grader and can write some genuinely rude comments...not cool at all  especially when you're struggling with an assignment.  \nThat said, Prof. Olvera is very nice and gets to know everyone's name. And she was very supportive when I needed some extra help and an extension on one of the essays, and she allowed me to hand a rewritten essay into her rather than to the TA--I think her generous grading on that saved my GPA last semester...So go to her if you need help, it's worth waiting during office hours, she'll be nice if she sees you're making a real effort.\nWorkload:\nweekly readings about 75 pages, 3 5-page papers, 5-page take-home final \n"
        },
        {
            "course_name": "Introduction to Urban Sociology",
            "review_date": "December 17, 2009",
            "review_content": "\nWorst. Class. Ever. Boy, do I wish I had dropped this class when I had the chance. She gives an absurdly large amount of reading for an intro class, and all of it is DENSE, PRETENTIOUS, and BORING. She types up \"notes\" (AKA a summary of the reading, NO ANALYSIS) and puts them on a power-point and reads off the power-point, VERBATIM. That is not teaching. That is reading out loud. She never graded any of the papers, and the TA was kind of a hard grader. On the plus side, Olvera's a nice lady and she actually learns your name. She also seems to care for her students, even if kind of on a superficial level.\nWorkload:\n3 essays. Too much reading. BO-RING. 1 final take-home essay.\n"
        },
        {
            "course_name": "Introduction to Urban Sociology",
            "review_date": "December 16, 2009",
            "review_content": "\nThis class is boring at best, completely worthless at worst.  While Ms. Olvera seems like a perfectly nice person, her lectures simply rehash the readings, providing few interesting points in a straightforward shallow manner.  The readings themselves are arduous in their length and most would only appeal to the most dedicated sociology scholar.  Luckily, you do not have to read them if you don't want to since they are summarized in class, and you are never tested on them anyway.  All grades come from three inane paper assignments and a final paper.  The three assignments require you to do \"fieldwork\" in a NYC census tract, which basically entails watching people as if they were birds and trying to come up with some profound insights that relate back to the topic discussed in class.  I'm not sure how you do well on them.  You have to be able to bullshit like a sociologist I suppose.  The T.A. who grades the papers wrote I was not \"sociological enough\" for one. Do not take it unless you know you are passionate about sociology. Find some other class if you are fulfilling an urban studies requirement. \nWorkload:\nRelatively heavy if you do all the readings, not too bad if you only read what you want.  Most of the worst comes from the census tract assignments, which will really try your patience.  The final paper wasn't so bad luckily. \n"
        },
        {
            "course_name": "Introduction to Urban Sociology",
            "review_date": "December 16, 2009",
            "review_content": "\nI have Professor Olvera for Intro to Urban Sociology, and she's definitely been one of my better professors this semester. She obviously knows a lot about the topics at hand, and while the Power Point format of the class wasn't always the most easy to pay attention to, the in class discussions really helped my understanding of the theories and concepts, in addition to being mentally stimulating. Prof. Olvera's best attribute, however, is her attention to individual students. She actually makes an effort to learn names, and is happy to pay you individual attention. Although our TA does the grading, Prof. Olvera certainly notices discrepancies, and follows up on them. At least in my experience, she's been extremely reasonable about grading and given ample opportunity to do well on assignments.\nWorkload:\nReadings for each class, 3 papers and a take home final. Participation and attendance also go into your grade. Manageable as long as you keep up.\n"
        },
        {
            "course_name": "Immigrant Experiences",
            "review_date": "June 23, 2009",
            "review_content": "\nHere class was good. We got to engage in a lot of interesting talks about immigration expereinces. However, I did feel at times that our one converation extended for the entire semester and I did not truly feel that we were attacking the issues from multiple standpoint. However, she is really a sweet woman and I did gain a much greater appreciation of the immigration debate. \nWorkload:\nmanageable. paper, book report, take home final. lots of class particpation. you will be more than fine\n"
        },
        {
            "course_name": "Communities and Social Change",
            "review_date": "January 26, 2009",
            "review_content": "\nProf. Olvera was a terribly frustrating professor, which made discussions seem scripted and undebateable.  She seemed to be extremely set in her views on community theory (which is total BS now that I've been subjected to this class), which made me feel like I couldn't argue with her, although I certainly did anyway.  \nWorkload:\nweekly response paper, which she grades A-F (who does that?!?!), final paper 15-20 pages\n"
        },
        {
            "course_name": "Introduction to Sociology (Barnard)",
            "review_date": "January 04, 2009",
            "review_content": "\nProfessor Olvera is clearly passionate about sociology and is willing to share her expertise with students who take the time to meet with her. While the power point lecturing is inherently limited (but oftentimes the most organized way of lecturing to a class of 100+ in an introductory course), do not let this deter you from taking her more challenging courses. The upper-level sociology courses she teaches are intellectually stimulating and demanding, with carefully selected readings she presents in an interesting and understandable way. I recommend stopping by her office hours- she is perhaps the most approachable and helpful professor I've had.   If you make the effort, you'll walk away from her courses satisfied.\nWorkload:\nFair- the amount of reading is typical for sociology courses and the papers/exams are fairly graded.\n"
        },
        {
            "course_name": "Introduction to Sociology",
            "review_date": "December 13, 2008",
            "review_content": "\nThis is a fairly good introductory class. The reading material is very interesting, but it all stems from a liberal viewpoint. It exposes you to a lot of societal problems that you may not be familiar with. As for the class itself, it's fairly boring: Olvera basically reads off of her powerpoint. You can print out the powerpoint from courseworks ahead of time. Her idea behind this is that students will be able to listen and add supplementary notes instead of rushing to copy everything down, which is nice. However, Olvera doesn't add much supplementary info, but the occasional anecdote she does add is usually interesting. Olvera encourages class discussion, but a class of 100 people doesn't usually make for great discussions. The same few students usually speak each class. Attendance is 25% of your final grade and is taken every class, so its not a class you can cut all the time. Overall, a good introduction to the study of sociology, but not an amazing class in itself.\nWorkload:\nNot too bad. Readings for every class, between 40-80ish pages. In-class midterm, research paper involving interviews or observations (a baby sociological study, basically), and an in-class final. Both the midterm and the final have short-answer IDs and one or two longer essays.\n"
        },
        {
            "course_name": "Immigrant Experiences",
            "review_date": "August 22, 2008",
            "review_content": "\nThis class is very interesting, but do not take the class as a walk in the park. Assignments that ask for a discussion of your family history, for example, require you to use the texts and possibly an outside text for historical support. The workload was not heavy by any means, but take time to be detailed and thourough in your essays. Use the readings!! And if you need to research about your family, find short articles or ask family members, etc. but do not try and produce vague answers. She likes students that break down main points and explain their significance in accordance to the theories we learn in class. Think in terms of theory first and foremost. Also, make sure you attend classes. More than a couple absences will affect your grade.\nWorkload:\nTwo 5 pages papers, 5-7 page book review, in class essay final exam (questions were provided in advance for this year), short 5 minute presentation about a contemporary issue affecting or caused by immigration (present news article). Not overwhelming.\n"
        },
        {
            "course_name": "Introduction to Sociology",
            "review_date": "February 21, 2008",
            "review_content": "\nOlvera's class was boring and participation counted 25% in an Intro lecture course with over 100 people, which was ridiculous. She also misquoted Marx, which is a sin at Columbia. The classwork itself was relatively easy, but her expectations for papers were poorly defined and nobody seemed to understand her assignments. However, the readings were generally interesting. Overall- a mediocre class. \nWorkload:\neasy\n"
        },
        {
            "course_name": "Introduction to Sociology",
            "review_date": "December 28, 2007",
            "review_content": "\nOlvera is a pretty good professor, but she does tend to preach her point of view fairly vehemently. This is a good Intro Soc course (at Barnard) and will give you a solid background in the subject. The work is certainly not excessive and the weekly readings are generally very interesting (and short).\nWorkload:\nWeekly readings (20-40 pages, mostly articles). Midterm, paper (5-7 pages), and final exam. \n"
        }
    ]
}