{
    "prof_info": [
        {
            "prof_name": "John Coatsworth",
            "prof_id": 3015,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "Economic History of Latin America",
            "review_date": "May 21, 2010",
            "review_content": "\nThe class has the potential the be really good; I would highly recommend it to anyone who's a) an amazingly good and efficient reader and b) has the background knowledge to coherently pull together your own understanding of a million different viewpoints on a very complicated subject. If you're interested in Latin America or economic history in general, you'll find this class interesting--in order to truly enjoy it, though, you have to be a crazy super student. \nI think the problem was in the structure. Each week you address a component of economic history, like schooling or government control or physical welfare, and read a million million-page articles on the subject, many which contradict each other (and all of which are very data-based, FYI, I felt stupid for not realizing this beforehand). Then you listen to two very sweet old professors summa-ruminate-chuckle over the subject and meet up in a discussion section to sit awkwardly and be confused. I ended up falling so far behind in reading and understanding that even though I had learned a lot about different concepts in economic history, I couldn't really apply them to Latin America, specifically. \nMaybe it's just really difficult to fit the economic history of Latin America into one class. The professors were wonderful--Coatsworth really is as funny and down to earth as all the other reviews imply, and Salvatore was so sweet. They are the kind of professors that you wish you could get to know if you had the time, or have as your grandpas or uncles or something. Likewise, this was the kind of class that you wish was your favorite and to which you wish that you had hours and hours of time to devote. \nWorkload:\nOverwhelming. Four to seven articles to read each week, roughly thirty pages each, and only some of which have conclusions and abstracts to find the main idea. 10-15 page paper on a subject of your choice, with plenty of time but a five page precis that seemed kind of unnecessary. Midterm and final that are supposed to require explicit references to article authors (Holy Mother of God), but I only knew like three and I did alright. Pretty easily graded in the end. \n"
        },
        {
            "course_name": "Economic History of Latin America",
            "review_date": "May 17, 2010",
            "review_content": "\ndescriptive haiku:\neconomic his\ntory of latin amer\nica: why so long?\nI came into this course struck by Coatsworth's (former) golden nugget CULPA rating, my interest/major in economics, and a searing fervor for all things Latin American. I came out of it with an addled, uneven understanding of Latin American economics tinged with a superfluous degree of actual history.\nIn some ways, this class could have been brilliant (and for a friend of mine, it was). The organizational structure of the lectures are, as mentioned in other reviewed, centered on weekly questions. The questions did a very good job of stringing together the various articles we had to read that week, but the problem was that sometimes they did not flow together quite as well from week to week. It felt as though we were jumping around from topic to topic, and only were able to put things together several weeks later, when we had fuller pictures of what we were talking about. Some of the other issues that were brought up in my discussion session was that as a survey class, we were never able to fully delve into one country's economic history as a case study. Of course, this was supposed to be resolved by the case study papers we were to write for the semester, but these were nothing compared to an officially led discussion on the matter. The syllabus showed great organizational potential; it just never came together.\nThis is partially the fault of the readings. At the beginning of the semester, we were presented with a manageable number of articles (3-4) at manageable lengths (20-25pg). I'll admit, the readings were hard for me to understand at first (even having taken Principles of Economics), but under the advice of my TA (Ben Lyons) and my own experience of a few weeks of reading, it became easier and thought-provoking to do the readings. Slightly tangential, but I have to say this: Ben is probably the best TA I have ever had at Columbia. He encouraged our class to read the articles strategically how to skim, what to skip, and how to boil them down to three sentence summaries. This was beyond helpful for studying for the midterm and final. He also always let us speak about the articles before he put in his own interpretations, which were always helpful and raised new questions for our section to discuss. If it wasn't for him and our weekly discussions, I probably would have dropped this class. This is not even his area of specialty!\nThe lectures, in contrast, were astoundingly disappointing. Salvatore, who taught half of the lectures, was hard to understand, and when you strain to understand him, you find out that he's only summarizing the articles of the week in a less articulate way. No new ways of interpreting the texts, or help on how to read them. Coatsworth, on the other hand, may have been easy to understand, but he gave out so much information at such a quick pace that it was almost impossible to take comprehensive notes of his lectures. Not that you would be missing much--his lectures were basically summaries as well, with interjections of his own opinions in between (usually found in one of the articles anyway, as we read his stuff rather frequently). None of this helped after the midterm, when the readings became denser and longer.\nOverall, what I'm trying to say is this: don't take this class unless you really, really like economic history.\nWorkload:\nA geographical identification quiz at the beginning of the semester, one long, 10-15 page case study, and dense economic readings. 4-7 articles per week, each ranging from 20-50 pages (on average ~150 pages/wk).\n"
        },
        {
            "course_name": "Economic History of Latin America",
            "review_date": "May 03, 2010",
            "review_content": "\nThis was one of the worst classes I've taken here. The readings were either too dense or were disjointed. Coatsworth was an interesting lecturer and very impressive with his encyclopedia-like knowledge of Latin America. But Salvatore, who taught half the classes, was a complete bore and could not speak English quickly enough or well enough to communicate what he was trying to say. Salvatore must have gotten the idea that the students found his lectures terrible, since on the days he taught less than half the class showed up (and then kids left in the middle) but he failed to improve or organize his lectures. \nAlso, whatever you do, DO NOT have Carlos as a T.A. This guy was such a self-absorbed prick. He rarely stayed on topic in class, preferring to talk about his phD work and to namedrop the professors he has worked with. I found him very annoying both on an academic level and on a personal level. \nWorkload:\nToo much reading. \n"
        },
        {
            "course_name": "Economic History of Latin America",
            "review_date": "April 08, 2010",
            "review_content": "\nI've come to not trust CULPA reviews after taking this class based purely on the reviews here. If you like economic history--and only ECONOMIC history--go for it. All others, beware. The readings were dense, lengthy, numerous, and failed to substantially connect with each other. Each week was centered around one overarching question/theme, so the entire course felt disjointed and awkward. Coatsworth's lectures were alright but felt a little dumbed down in comparison with the readings, and Salvatore's lectures (the class was taught by both of them) either put me to sleep or failed to keep my attention. Perhaps I just don't do well with lectures, but this class was a waste of my time. \nWorkload:\nTry to get a good TA. Map quiz that my ridiculous TA graded harshly, midterm also graded harshly, case study, final, discussion section worth 20% of the class which is annoying when your section is full of the usual know-it-all-out-to-impress-the-TA Columbia type. \n"
        },
        {
            "course_name": "Economic History of Latin America",
            "review_date": "May 23, 2008",
            "review_content": "\nAMAZING professor. Honestly one of the people that I have learned the most from. I took it in  Fall 2007, when he was interim dean for SIPA, so he co-taught the class with another professor. Coatsworth is incredibly knowledgeable (he pretty much authored any piece worth reading over Mexico), and his lectures are very clear. The class basically seeks to answer why Latin America fell behind and Coatsworth does an excellent job synthesizing all of the readings with his own perspective. Don't be frightened by the title; you don't need to know a lot about economics to get something out of this class. Start your term paper early! The midterm and final will go alot more smoothly if you thoroughly outline all of the possible essays beforehand, as most were pressed for time. Put in the effort, and you won't regret it. \nWorkload:\nINTENSE. About 100-150 pages of reading per week. Discussion section with Courseworks postings, a midterm, final (both are based off a review sheet with ids and possible essays), and a term paper on the country of your choice. \n"
        },
        {
            "course_name": "Economic History of Latin America",
            "review_date": "December 12, 2007",
            "review_content": "\nAlthough I am feeling bad to be ruining Coatsworth's golden nugget board, I must warn every student who are attracted to the title of the class. Unlike other reviewevers, I found some of the readings inadequate, some redundant and some irrelevant. Every week starts with a question about an issue prevalent in LA's econ history, and the readings are intended to help you to create an idea of your own on the subject. I sometimes found that really hard to do with the given readings, due to reasons i stated above; sometimes readings were inadequate to find a legitimate claim. I thought I was having these problems because I am an econ major. However, everytime I met with study groups for a major assessment, I heard very similar comments on the readings from non-econ majors.\nOn the other hand, Coatsworth is indeed a central figure in the field and his knowledge of the material is immense. \nIt was great to hear his personal stories and comments on the material. His lectures are mostly dry and hard to follow, but he is friendly and very approachable. \n\nWorkload:\nmid term final 15pager discussion map quiz(seriously)\n"
        },
        {
            "course_name": "Economic History of Latin America",
            "review_date": "June 19, 2007",
            "review_content": "\nOne of the best Professors I have ever taken at Columbia.  When I heard that he was extending his 'visiting professor' status to become SIPA's interim Dean, I was thrilled!  Meaning: I'll possibly get the chance of having him as my instructor again.  Being from Latin America,  he certainly changed the way in which I used to see things of my region.  His influence was so great that after his class I changed my major, and I couldn't be more satisfied.  Certainly, there is a heavy bulk of reading, but ALL worthwhile.  Then... one of the most approachable Professors.  You go to his office hours, and being who he is, he treats you with respect (even if your questions are, let's say not very smart!).  Anyway, I could go on bragging about Coatsworth, but suffice to say: catch him before he leaves again for Mass. \nWorkload:\nBe ready for lots of articles.  Good side: you won't mind reading them because they are very interesting.  \n"
        },
        {
            "course_name": "Economic History of Latin America",
            "review_date": "January 23, 2007",
            "review_content": "\nThe only time I had been jealous of Harvard students was when I found out that Coatsworth is a visiting professor from there. I'm a history major, and he is, by far, the best professor I've ever had. I have absolutely no interest in econ, but he made the material accessible, and even entertaining. Some of the lectures are dry, but that's probably more due to the material. Like the other student said, this guy is a pivotal figure in his field, and is super friendly too. If you can get him for a class before he goes back up to Massachusetts, I strongly suggest you take it. \nWorkload:\nReading load is heavy, but you could definately get away with reading only one article of the three/four he assigns. One research paper-- grading dependent on TA (mine was generous), midterm and final, both which he gives all the questions and IDs beforehand so you really can't complain. \n"
        },
        {
            "course_name": "Economic History of Latin America",
            "review_date": "January 14, 2007",
            "review_content": "\nCoatsworth was a pretty great instructor. He does seem to be an encyclopedia of knowledge, and the kinds of varied data he used to discuss economic history were very interesting to me (besides just GDP and real wages, height statistics, literacy rates, etc.). Very honest and straightforward account of subjects too (his account of the Cuban Revolution, for instance, was the most balanced I've ever heard at this school). He can be funny, and was also eagerly available during office hours. He also does a good job of answering students questions about the subject during class, and he really does seem to know everything. The opportunity to take a class with this giant in the field of Latin American economic history is really priceless and should be taken advantage of.\nMy one complaint would be that class sometimes was just a summary of the readings, which made doing them or attending the required discussion section kind of pointless. \nThe class required a midterm and final (which most people felt were harshly graded), and a 9-11 page paper, which I found fun to write. Overall, gradewise, my grade didn't at all reflect the amount of work I put into this class, and in a bad way. \nWorkload:\nMidterm, Final, 9-11 page research paper (\"case study\"), and weekly 50 minute discussion sections.\n"
        },
        {
            "course_name": "Economic History of Latin America",
            "review_date": "October 30, 2006",
            "review_content": "\nWanted to right an early review for anyone about  to apply for seminars next semester.  Visiting professor Coatsworth is amazing!  Sorry to gush but his class is great. His material is extremely well organized and relevant.  Never a bad article.  He is an encyclopedia of knowledge and fields questions covering the breadth of Americas History from the class.  Extremely available.  Encourages his students to take creative approaches to interpreting economic history.  You'll work but you'll be engaged enough to enjoy it.  If you have any interest in development, economics, or history of the Americas, take this man's spring seminar.  When you start publishing, you'll be like everyone else in the field and thank Coatsworth.  Literrally, everyone in the field starts with this man.  And he's lovely.  \nWorkload:\nOn the heavier side but all worth it.\n"
        }
    ]
}