{
    "prof_info": [
        {
            "prof_name": "Katharina Ivanyi",
            "prof_id": 12859,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Islam",
            "review_date": "December 05, 2014",
            "review_content": "\nProfessor Ivanyi is one of the nicest professors out there. She is genuinely enthusiastic about this subject and sports a smile throughout every lecture. Overall, her lectures are organized and broken down into the simplest possible terms, which I found to be especially helpful since I had very little prior knowledge of the subject. She will always write down important vocabulary terms on the chalkboard and explain their meaning and significance. If you take no other notes in this class, at the very least be sure to write down the definition of these terms (they will make up a majority of the vocabulary that appears on the quizzes). The reading is, more often than not, helpful but not always necessary. However, it is very diverse and usually quite interesting, so I wouldn’t rule it out altogether. \nI both enjoyed this class and learned a great deal from it. I highly recommend it to anyone looking to fulfill a global core requirement or simply to expand their knowledge of world religions.\n\nWorkload:\nThe workload is manageable and I only ever felt overwhelmed by the midterm book report, but that’s mostly because I left it for the night before it was due\nYour grade is broken up as follows:\n4 In-Class Quizzes: 20%\n8 Reading Responses: 20%\nTake-Home Midtereview_contentk review_content: 25%\nFinal: 35%\n\n"
        },
        {
            "course_name": "Islam",
            "review_date": "April 03, 2014",
            "review_content": "\nProfessor Ivanyi needed a culpa review because she is just such a lovely person. I took her Islam class in fall 2013 and loved it. For starters, she is an adorable person. You really couldn't find a nicer professor. On top of that, her lectures are interesting and she assigns interesting readings. The work is never overwhelming and it was really a joy to be in her class. She will assign lots of readings, and you should read them because they're interesting, but they're not essential. Her grading wasn't too harsh and it was distributed well so you had ample opportunity to make up for a bombed quiz. You definitely need to go to class, and not just because she takes attendance--it's honestly interesting stuff and if you listen and take good notes you won't have to study for the quizzes very much. Plus, showing up gets you like 10% of your grade. Definitely take Professor Ivanyi's class. She is lovely. \nWorkload:\nReadings for every class, 4 reading quizzes spread throughout the semester (she'll give you a list of terms and you really only need to know those), 8 reading responses, midterm book review, final essays. It sounds like a lot more than it is because everything is spread out really well throughout the semester such that you never feel overwhelmed by it.\n"
        }
    ]
}