{
    "prof_info": [
        {
            "prof_name": "Jason Hill",
            "prof_id": 3037,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Morality, Self, and Society",
            "review_date": "January 15, 2007",
            "review_content": "\nIf you love philosophy, you'll adore Professor Hill; if you aren't quite so passionate about the subject, you will probably never want to take it again. His grading in this Barnard intro class is harsher than certain graduate seminars (he is rather into overthrowing gender stereotypes) and goes into great detail in the texts - most of the books we read are on the C.C syllabus, but I learned a lot from his lectures. Despite his rigor, he's a really nice man who gives everyone a chance to speak and does his utmost to be graceful in response to completely idiotic comments. I'd take another class with him without any hesitation, but I would not recommend him to anyone who wants to bullshit their way through, or who can't deal with criticism.\nWorkload:\na very light amount of reading, 2 papers, midterm, final. \nit's in your best interest to participate, too.\n"
        },
        {
            "course_name": "Morality, Self, and Society",
            "review_date": "January 13, 2007",
            "review_content": "\nProf. Hill is an extremely intelligent man who clearly knows what he's talking about...even if he loses the rest of us during MOST of his very long, very monotonous lectures.  That said, he loves when others try to jump in and will build on whatever you say -- even if it's totally wrong -- to encourage participation, which is lacking because the readings are so difficult to understand.  Tough grader, but he's eager to meet with you and help make your paper better.  He's incredibly friendly and welcoming as long as you do your work, and it will work to your advantage to go see him during his office hours because he'll remember you.  Overall, he's a great guy who teaches a dense class.\nWorkload:\nTwo 6-8 page papers, midterm, final, readings for every class that aren't too long but can be very dense.\n"
        },
        {
            "course_name": "Morality, Self, and Society",
            "review_date": "January 13, 2007",
            "review_content": "\nI dreaded attending this class. If you're using it to fulfill a requirement, you might want to look elsewhere. The material is very dense, especially for a freshman (I took it first semester, freshman year). Most of it went over my head. Intermittently, there are fun lectures, like the first two classes, which caught my attention because he seemed to add humor to his lectures. But when we started to get into the material, I quickly lost interest. There are, of course, people who seem to have been born with Frued, Aristotle and Plato wrapped around their finger. Let them take this class. I found it difficult and painful.\nWorkload:\nTwo essays (together, half of your grade), a midterm (1/6 of your grade), final (a third of your grade). i believe all of them (at least the midterm and two papers) were graded by the TA. \n"
        },
        {
            "course_name": "Morality, Self, and Society",
            "review_date": "January 05, 2007",
            "review_content": "\nIt was a very interesting class, with not too much reading. Hill is a pretty good teacher but he gets off on tangents that makes learning in the class difficult. He indulged students' dumb questions that seemed to be asked just for the sake of wasting time. He is a very nice guy, though. My biggest problem was the TA who was absolutely horrible. One time in the middle of class it looked as if the TA was almost asleep and HIll asked him, \"what do you think about this.\" The TA's response? He laughed and said I don't know. Great. Considering this is the guy who will be grading our papers on the material. \nWorkload:\n3 papers and reading\n"
        },
        {
            "course_name": "Morality, Self, and Society",
            "review_date": "November 27, 2006",
            "review_content": "\nHill should be a great professor. Key word being should. He is extremely knowledgable and in theory would be able to teach his students something. However, half the time it is impossible to hear his rants - as he delivers rants not lectures- and his tangents are too impossible to bear. If approached during office hours one would assume that he is at least slightly more personable than he is in the classroom, but sadly he seemed to me just as cold, if not colder- when I approached him for help on the paper that I nearly failed (yet worked for days on) without a word he took the paper from my hand, read it. wrote things down and handed it back to me. I wish I was exagerating. He is so hard, and there is no reason to put yourself through such an excruciating semester.\nWorkload:\nHEAVY and harshly graded. \n"
        },
        {
            "course_name": "Morality, Self, and Society",
            "review_date": "November 27, 2006",
            "review_content": "\nHill should be a great professor. Key word being should. He is extremely knowledgable and in theory would be able to teach his students something. However, half the time it is impossible to hear his rants - as he delivers rants not lectures- and his tangents are too impossible to bear. If approached during office hours one would assume that he is at least slightly more personable than he is in the classroom, but sadly he seemed to me just as cold, if not colder- when I approached him for help on the paper that I nearly failed (yet worked for days on) without a word he took the paper from my hand, read it. wrote things down and handed it back to me. I wish I was exagerating. He is so hard, and there is no reason to put yourself through such an excruciating semester.\nWorkload:\nHEAVY and harshly graded. \n"
        }
    ]
}