{
    "prof_info": [
        {
            "prof_name": "Frank Sciulli",
            "prof_id": 533,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Mechanics and Thermodynamics",
            "review_date": "December 24, 2003",
            "review_content": "\nThough this class is technically intended for students who do not have a background in physics, like myself, it is close to impossible to grasp the amount of required material in one semester. Ontop of that Sciulli does not make it any easier. Firstly, his lectures are straight out of the amazingly horrible text book. except for the occasional video clip. Out of the over 100 students in the class only a good 1/3 bothered showing up to lectures mostly cause they already knew everything. The only good thing about going to the lectures is that some of his demos were interresting. Otherwise he breezed through about 15 chapters of the book and spent forever on the easiest things like thermodynamics and fluids. To say the least, this was not an enjoyable first experience with physics. If you have the oppertunity to take the other section by all means do so!!\nWorkload:\nDecent: One graded problem set a week consisting of 8-10 problems. Two midterms and a final all with an average mark of around a 50-60%. \n"
        },
        {
            "course_name": "Introduction to Mechanics and Thermodynamics",
            "review_date": "November 15, 2003",
            "review_content": "\n\"Those who can, do.  Those who cannot, teach.\"\nThat being said, Sciulli can apparently DO very well, as implied by his noted prowess as a physicist.  As far as teaching is concerned...\nPlease, as a message from the proverbial graveyard of physics students who were unfortunate enough to choose Sciulli, DON'T take his class.  You won't learn anything, you'll be bored out of your skull, you'll become depressed because the homework are graded in such an arbitrary manner (ninety percent of the grade seems to lie in one randomly chosen problem from the set; all the others make up the rest)... and the curve is ridiculous.  I guess I should be happy when my grade of 52 on a midterm is curved up to a B, but it just makes me sad; I did want to learn something about physics, o so long ago...\nI agree with the previous reviewer about the subject matter; it is all algebraic substitution; my friend tells me all the time about her wonderful physics class where they talk about fascinating theories.  I can't do anything but grumble about my phony homework assignments, impossible tests and my exponentially decreasing desire to have anything to do with science.\nWorkload:\nHomework due every Wednesday, 2 midterms?  1 final.\n"
        },
        {
            "course_name": "Introduction to Mechanics and Thermodynamics",
            "review_date": "January 21, 2003",
            "review_content": "\nI have nothing good to say about this class. The department and the course itself are awful. The workload is simply unmanagable. The only people who are successful in this class have either taken physics before or are excellent cheaters. What's the point of teaching a class for students who already know the material? You simply can't do this course without collaborating with other students on problem sets. If you can, you shouldn't be taking this course. The problem sets are extremely dificult. The problems SHOULD start off relatively simple and than become progressively more difficult. However, they are nearly impossible, right from the start. There is nowhere to get a foothold in the problem sets. They don't focus on understanding any CONCEPTS of physics, which is what you SHOULD be learning in an intro physics course, they only deal with endless algebraic substitution. So much so, that a math nerd can wanker through this course without learning ANY physics concepts. The department help room hours are pitiful. Don't expect any significant help there.  Don't expect any feedback on your problem sets either. Our TA lackey, Michael Cheng, who graded our problem sets was awful. The problem set answers he provided online were totaly useless and explained nothing. His notes were very hard to follow and he really liked to skip as many steps as possible. It's the steps and process that matter the most in physics, you idiot! I was tutored by an MIT nuclear physics graduate and she had a difficult time following his steps. Now to Scuilli. His lectures are boring. Reallly, really boring. His demonstrations seldom work. He rambles on in monotone. TA's grade your problem sets. Other people administer his exams. He is very hand-off. His lecture method is all mathematical explanations. For some reason, he thinks that showing derivations of formulas lead to a better understanding of physics. It doesn't. The textbook is also pitiful. Whoever chose this text for the course ought to be stabbed in the face with a hot soldering iron. If you look at a physics book from any other school, even a high school, you will notice that it is a thick, heavy book. This text is very thin and light. Why? Because it skips a bunch of very important material. Material that is important if you wish to actually LEARN physics for the first time. It is substandard and if you try to learn from it you will just waste alot of time trying to figure out what they have left out. I would reccomend getting another physics book if you nedd to teach yourself. Almost all physics books are written in the same order, so any will do (unless it't this book). If you have never taken physics before, avoid this class if you can. If you can't, maybe you could audit it before you take it.       \n"
        },
        {
            "course_name": "Introduction to Mechanics and Thermodynamics",
            "review_date": "December 06, 2002",
            "review_content": "\nIf you're taking this class, you're either a biochem major, a lazy SEAS student, or a premed who decided that you were too good for 1201. The class is definitely boring, and it's taught straight from the book. You're better off spending the time doing toe problem sets, which will really help you on the exams. Don't worry about missing class, because all the lectures are online (pointless, since they're straight out of the book anyway). Curve is centered at B+. There is no calculus involved, but having a previous physics background really helps. Overall, class is pretty easy. \n"
        },
        {
            "course_name": "Introduction to Mechanics and Thermodynamics",
            "review_date": "November 19, 2002",
            "review_content": "\nProf. Sciulli's class was an interesting experience. His lectures are straight out of the book, but very well put together. Attendence is not necessary, but he does go over some of the problem set questions in the problem sets in class. The tests are tricky but definitely doable, however dont be fooled by how easy the first midterm is because the second is much harder.\nWorkload:\n10 problem sets, 2 midterms, final\n"
        },
        {
            "course_name": "Introduction to Mechanics and Thermodynamics",
            "review_date": "November 17, 2002",
            "review_content": "\nThis professor is by far the most soporific being I have ever met. The class size was initially very high and as the semester progressed, only a few seats in the class were filled. The class features the topics which are briefly covered and the exams features problems which one has never seen, or has any oppurtunity to see how these problems are worked out. The physics is being taught by concepts whereas the exams are all application problems. Very frustrating and if there wasnt a curve, most of us would not pass the class.\nWorkload:\nToo much material covered relative to quality of professor\n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "December 31, 1999",
            "review_content": "\nI don't know a single student who enjoyed this class. Sciulli has a knack for making an unbearable subject like physics even more unbearable. His lectures are dull as stone. The highlight of the year is at the very beginning when he shoots down a falling stuffed monkey to demonstrate projectile motion - it's all downhill from there. He has no enthusiasm for teaching and this reflects in the rapidly diminishing attendance for the class. Expect to never have to fight for a seat.\nWorkload:\nMidterms, final, graded homework sets. Tests contain questions that vary from ridiculously easy to undecipherably hard. Doing the homework is essential to understanding the material (particularly if you don't attend class, like the overwhelming majority.) Curve is usually favorable, but by no means an easy A.\n"
        }
    ]
}