{
    "prof_info": [
        {
            "prof_name": "Richard Sacks",
            "prof_id": 115,
            "total_reviews": 25
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "August 27, 2015",
            "review_content": "\nProfessors Sacks is the man. He deserves a gold nugget. His class is everything I hoped for in a Columbia core class. He really knows his stuff, but he never dominates the discussion. He uses his knowledge of the material to enhance the discussions, but he encourages you to draw your own conclusion. He values your opinion. He's so so smart, but not pretentious at all. He will ask the most deep-cutting questions but still keeps a great sense of humor throughout the class. I wish all my professors were like him. He's such a cool dude. \nAs far as grading goes, he doesn't assign much work, but he expects your papers to be thoughtful and well written. Honestly, if you're a good writer and insightful reader, he'll give you an A. If not, well then you're shit out of luck. \nWorkload:\nMinimal for lit hum \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 30, 2014",
            "review_content": "\nProfessor Sacks embodies everything I imagined the Columbia Core experience to be and more. He is dedicated to his class of undergraduates (rare for this university), and he brings interesting materials/supplements to class. He brings the perfect combination of discussion and lecturing/direction to the course. He is quirky and slightly in your face about backing up your ideas with evidence from the text and the evolving dynamic of various themes/motifs, but that is exactly how a professor should be. The only downside to his class was that he cut out a few works due to extended looks at Genesis and The Iliad (for fall semester). But, he did offer optional one-day reviews of the works we skipped.\nI cannot recommend Richard Sacks enough, and he is by all definitions a gold nugget professor.\n\nWorkload:\nVery reasonable. \nChoose 3 of 5 ungraded responses that add to the \"participation\" portion of the grade. \n2 papers, one of which you can turn in two weeks late.\nA midterm and final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "September 08, 2012",
            "review_content": "\nI will say it. Sacks deserves a gold nugget. \nHe gives his all to every class, and if you do too then you will get an experience you will read for a life time. He is a gift to our university. \nThat being said Sacks treats his students like adults, and if you don't act like one: you don't read the texts but try to bullshit your way with spark-notes, or just fall asleep (and come on guys, that is adolescent. Why are you even in the Ivy League?) then you will probably get nothing from this class and wonder what the hell everyone else was talking about. He leaves it up to you and teaches this course almost as if it is some type of graduate do what ever you want thing, instead of a freshmen identification of quotes course. He asks more than most professors seem to, but he also gives you more.\nHe cuts the readings and the paper word limits, so this might have the most realistic expectations of any LitHum class but he also asks you to go the furthest with your ideas. I loved this course, and I reaffirm that he deserves a gold nugget. If you can switch to him I'd do it for sure. But honestly only if you buy the whole Ivy-league thing and the intrinsic value of knowledge and the joy of philosophy etc etc. If you wanna coast and come to class hung over, I'd look somewhere else, you'll probably be miserable, and give more work to other students (see below).\nSo I say if you have Sacks then stick with him. But do your damn readings, and stay awake in class. If you don't, then like about half of my class you might wonder why the other half was so excited and happy to be in class every day. You are very fortunate to have someone who cares so much, not to mention how great of a professor he is. You will find many great professors in your years at Columbia, but few will care as much as Sacks does, and in the way that he does.\nWorkload:\n2 papers and midterm + final and depending on if your class sucks or actually has discussions either\nParticipation (if people in your class talk)\nStupid discussion posts (If people in your class refuse to have discussions in real life he forces you to do it on the computer, and his deadlines can be strict. SO don't suck. Do your readings.)\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 12, 2011",
            "review_content": "\nIf you're looking for an easy A, Sacks is not your man. If you're looking to really better your knowledge and understanding of literature, Sacks is everything you can ever ask for. Sacks is one of the most hardworking professors I've ever seen. He does not take his job lightly at all and he really feels like he owes his students the best. This is evident when he apologizes for not being as on top of his game as he wanted to be in the last class. It's kind of endearing, really. \nI think it fundamentally comes down to what your academic ideology is. If you believe that you came to Columbia to learn and leave as a wholesome person, then Sacks is THE professor to take. You won't forget this class. \nWorkload:\nMuch much less than other classes because he cuts out readings and the papers are 1000 words max. This justifies his extremely high expectations for what you do turn in though. All in all, it's a fair load. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 11, 2011",
            "review_content": "\nProfessors like Sacks make Columbia University the highly acclaimed academic institution that it is. With such teaching skill and a vast body of knowledge in mythological texts and literature classics. Professor Sacks is a sharp, analytic professor who is fantastic at what he does.\nProfessor Sacks delicately balances contributing his own ideas while engaging his students in intellectual discourse. He clearly has an impressive knowledge of the subject material and conveys that to his students. But at the same time, he is constantly challenging his students to challenge HIM and provide the alternative argument. This balancing act always impressed me. Many tenured professors like the sound of their own voice and just want to hear themselves lecture. Not Professor Sacks. He is constantly engaging his students in debate and picking their brains. Daunting at times, yes. But he truly teaches us to think with an open mind and confront all possibilities.\nHis feedback on both exams and papers is excellent and it is obvious that he spends time grading each piece of writing meticulously. The effort he puts into both the class discussions and writing feedback is very impressive, and it is clear he wants to see improvement among his students.\n\nWorkload:\nTwo papers, 2 responses, 1 midterm, 1 final. If you care about the material, and you show him, you can succeed. Meet with him before papers are due (no, not the day before!) and it will really help your thought process and thesis development. He is on your side and wants you to maximize your potential!\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 21, 2010",
            "review_content": "\nReally great Lit Hum professor. He cuts out the worst readings so we can spend more time on the more interesting stuff and he discourages the superficial analysis of texts that seems to go on in other classes. Obviously a brilliant guy, but also laid back and funny. He somehow manages to hold my attention for the entire 2-hour class. He also understands that we have lots of commitments and makes the workload extremely manageable. Maybe a little harder on grading than I'd like, but his section is definitely still worth taking. \nWorkload:\ncuts out a ton of the readings, 2 papers (<1000 words each), midterm, final (he changes the coursewide one to make it better/easier), 2 one-page courseworks postings\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "August 24, 2010",
            "review_content": "\nAlthough he may not be for everyone, Professor Sacks is exactly why I wanted to come to Columbia. If you really care about the core, and want to take it seriously and do the heavy lifting, Lit Hum with Sacks will be incredibly rewarding. \nI don't want to write too long a review that will get boring and turn people away with too much detail. BUT please please give this professor a chance if you have his section or are able to switch into it. Professor Sacks has put a tremendous amount of thought into both the content and method of the core curriculum, and all I can say is that the more that you are willing to put into the class the more you will get out of it. You will be hard pressed to find a more knowledgeable, enthusiastic, and fair teacher across the board on all of the books. Remember that he has been around in the English department for a long time, and has discussed the minutiae of works outside of his immediate expertise with many of Columbia's greatest professors from other specializations. His own is Homer, a real treat for any classicist, and a great way to start off the year with Homer.\nIt also means that if you stick it out for two semesters, you will get to read Omeros, Derek Walcott's epic poem set in St Lucia, which was one of the most astounding and beautiful things I have ever read, an experience infinitely enhanced by Sack's enthusiasm and knowledge. \nI cannot say enough wonderful things about Richard Sacks. Lit Hum was made for guys like him and you should consider yourself very lucky to be a part of it. \nWorkload:\n2 x 1000 word essays (harder than it sounds!) per semester, 2 ungraded one-page responses. Significantly alters the weighting of the coursewide final to take emphasis away from passage IDs and onto analysis.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 20, 2010",
            "review_content": "\nProf. Sacks was great. He knows so much that sometimes it's hard for him to put all his thoughts together and convey them to the class. However, our discussions were for the most of it great and he leads in a way that encourages people to think about more in depth but cutting all the poetic and pretentious bullshit that usually constitutes most literature classes. He even invited us over to his house for brunch, and it's really a privilege to talk to a man that knows so much and is so passionate about it. Consider yourself lucky if you get him. If you listen to his advice for your papers and tests you'll be fine, he's a fair grader, and the nicest most approachable professor. \nWorkload:\nFirst semester: 2 papers, mandatory midterm, final (our final is slightly different and I would say harder than most classes but still manageable) \nSecond Semester: 1 paper, optional midterm (if not taken the final is worth more), 20 min oral presentation, final \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 10, 2009",
            "review_content": "\nLit Hum with Sacks was infuriating. The man spends far too much time making ridiculous arguments based on word frequency in the texts or on contradictions in classical mythology. He pushes \"important themes\" on you -- regurgitate those on the midterm and final and you'll be set -- and while you can voice competing ideas in discussion, you'll wish you hadn't. If your mind is completely devoid of original thoughts about literature, you'll probably like Sacks. But then there isn't much incentive to actually read the books, is there?\nWorkload:\nFirst semester: 2 papers, 2 responses, midterm, final. Second semester: 1 paper, 3 responses, 1 group presentation, midterm, final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 10, 2008",
            "review_content": "\nProfessor Sacks is an absolute all-star.  I almost feel bad for people who don't have him as their LitHum professor.  He is that wonderful.  As a Homeric scholar, he is incredibly knowledgeable about every single work and effectively transfers that knowledge to his students.  His ability to engage his students is truly astounding.  He is incredibly passionate about these works and has read them over and over again until (literally) the bindings break and the pages fall out.  Friends of mine in LitHum have joked about \"majoring in Sacks,\" because we're confident that if he taught any class, it would be the best class we've ever taken.  He could teach a class on the intricacies of a paper lunch bag and would still have students begging for more.  He raises issues about passages in the works that other sections skim over.  Sometimes this attention to minute details results in falling behind, but we always catch up in time for midterms and finals, so it's not too big of a deal.  If you have Professor Sacks, you'll fall in love with him and with literature.  \nWorkload:\n2 no more than 1000 word papers, 2 out of 4 ungraded one-page responses, cuts out some works so we can read the other books more closely\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "October 05, 2007",
            "review_content": "\nI wrote a longer, more specific review, but it wasn't posted, probably because I disagreed strongly with the negative review below. Professor Sacks is incredibly smart and modest and works harder to help his students than any other teacher I've ever had. He taught me to appreciate literature like I never had before. Absolutely take his section if you can. He treats his students like equals and debates the texts with them like peers, which I guess can make some students feel like their points are being shot down too quickly, but all in all, he is very understanding and his section is less superficial than others. I actually came out of it feeling bad for the other sections, because the thematic synopses that they learned about each text would have been dismissed immediately in our section.\nWorkload:\nLess than most, but with higher expectations.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "September 19, 2007",
            "review_content": "\nI couldn't leave the review below as the last word on Professor Sacks' Lit Hum class. He is sensitive, as someone mentioned, but only because he cares deeply about the quality of his teaching, and is deeply conflicted about the goals of the course and his job as an instructor. What emerges from this is that his course is more profound, and less structured and superficial than others. Where other classes came out thinking that the Iliad is a poem about the glory of war, I came out without an opinion, but able to see ambiguity in every passage. He may not have given us the survey of literature that others got, but I really did learn to appreciate literature more. I understand how he could aggravate some personalities (he is quick to counter any opinion that is too narrow), but I tend to side with him. I do not think that he is opinionated, and he treats his class very well, as if really thinks he can learn something from them. These are qualities that I can imagine being problematic for someone who wants a different kind of teaching, but for my part, I thought he was amazing, and I thoroughly enjoyed the wisdom that complemented every class.\nWorkload:\nLess reading and writing, but higher expectations.\n"
        },
        {
            "course_name": "Form in Poetry",
            "review_date": "May 18, 2007",
            "review_content": "\nIt's a little hard for me to criticize Professor Sacks, as I like him a great deal as a person and enjoyed getting to know him. He's basically an obsessive about poetry and various mythologies, and he has enthusiasm to burn once you get him going on a subject of interest. He also does a good deal of outside research to prepare for discussion, so he was always introducing us to helpful outside sources (what's more, he designed this interesting website for the class to facilitate the use of online resources alongside our written responses--that was pretty helpful). But despite all these qualities to recommend him, he can be a bit of a tyrant in class. He gets worked up very easily, and he presents very creative interpretive arguments (which are enjoyable and thought-provoking, even if their validity can be questionable at times)--but he can be very quick to shoot down points raised by others that seem just as valid. He also doesn't really teach all that much; he just expects you to participate in the discussion and learn through osmosis, which, I suppose, works for some people. He dominated most of our discussions with his opinions, which, like I said, were very interesting; it just would have been nice to have had a more open discussion. Still, I like him so much on a personal level that I can forgive this. On the plus side, he responds to e-mails very quickly, will meet with you in office hours for as long as you want, and is very helpful/sympathetic when you're stressed. I guess what I'm trying to say is that, while he definitely has his flaws, he's a good person to get to know, and he can be very helpful (even if his teaching could be more direct and less opinion-based). I'd probably take a class with him again, and I guess I recommend him overall.  \nWorkload:\nShort online postings most weeks, and a term paper at the end. Contrary to what an earlier commenter said, I found his grading to be exceedingly fair. Also, given that this class focused on very close reads, the reading was minimal.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 23, 2007",
            "review_content": "\nProfessor Sacks is a Lit Hum professor to be avoided at all costs. He is far too vested in his own opinions, which are shallow. He considers himself to be somewhat of an expert on the Iliad, but, despite some knowledge of Greek and a smattering of Latin, he is incapable of making any interesting claims. His general lack of any brilliance is rendered completely infuriating by his self-importance, rudeness, and inability to modulate his voice. You're probably better off with a TA. Actually, you'd probably even learn more reading the books on your own.\nWorkload:\nunbelievably light. but it's not as great as it seems, because you really don't learn a thing.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 08, 2007",
            "review_content": "\nI really can't give Prof. Sacks a great review nor a terribly bad one.  His grading is somewhat ridiculous (the highest grade you'll probably get is an A- if you're lucky)and he emphasizes, no demands deep and insightful analysis on papers limited to three pages.  He's very enthusiastic about the novels, but he's also easily offended, takes things very personally, and acts, at times, very contentious.  Though, at other times, he brings candy and sweets and nostalgically talks about his own college days.  Bottom-line:  if you're looking for an easy A, Sacks is not your man.  If you're looking to form a deep and insightful understanding, learn a couple of greek words, and don't mind a teacher who's a little sensitive, choose Sacks.\nWorkload:\nCuts down the number of books, and goes over some of the more important ones in more detail.  Warning: he demands deep analysis on his midterm and final even though there is a time limit.  He changes the final so that your analysis of the works is worth more (simply ID's don't cut it).\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "March 22, 2005",
            "review_content": "\nSacks is simply amazing.  He definitely knows his s**t when it comes to Lit Hum---he's been teaching the class since '78!!  But that doesn't mean that the material is dry and boring.  Quite the contrary.  He is incredibly enthusiastic about the texts and wants his students to learn from them.  It's true...you do have to do the readings and read them closely to really get something out of class.  But you will be greatly rewarded if you do that.  He gives you two papers to do, which are passage analyses.  He is big into form and structure and what they reveal about the themes and developments in the text.  But really, he just wants you to use all of the information you've been given in class, analyze the text, and come up with some insight into the text using background knowledge and an analysis of the form.  Sounds complicated, but he gives good (if illegible) comments on your papers and lets you redo the first one if it's handed in on time.  Oh, that's the other thing.  Out of the two papers, you can turn one of them in up to a week late no questions asked.  No grade deduction, nothing.  If you turn the first one in on time, you get the chance to edit it and turn in back in for another grade, which will be averaged with your first one.  All in all, he's a great teacher, the best I've had so far.  He cares about his students, is VERY willing to help, and knows his s**t.  I would recommend taking any course with him.\nWorkload:\nHe cut down the workload from 12 to 10 books, taking out the two worst.  Two close analysis papers, a midterm, and a final.  \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 23, 2004",
            "review_content": "\nGreat teacher. Knows everything there is to know. I came into the class knowing nothing, finished a semester knowing about all of the Greek gods, etymology of greek words, being able to recognize parallels and structural differences between different pieces. Sacks is very enthusiastic (he loves Homer - he even wrote a book on him). \nHe is a hard grader though. His grades are fair, but he definately does not give an easy a. Better if you're in the class to learn that just in it for a gpa boost.\nI would recommend taking lit hum with Prof. Sacks.\nWorkload:\n2 papers, short midterm, department final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 08, 2004",
            "review_content": "\nProf Sacks is, in a word, incredible.  What makes him so remarkable is that he treats us like adults rather than students - he knows that half of us don't do the readings, he lets you hand in papers up to a week late, and he gives much less work than other Lit Hum teachers.  And, since he gets so excited about the discussions, we always end up falling a few classes behind on the readings, so the reading load becomes relatively light compared to other sections.\nAlso, he really knows his stuff.  He has The Iliad memorized in both Greek and English, and he's very familiar with the other texts as well. BUT, his classes are not boring lectures of his own ideas.  On the contrary, he often remarks that we likely couldn't care less about what he refers to as his ridiculous and crazy thoughts.  Instead, he really wants to hear what we have to say.  The class dynamics therefore turns into a discussion in which he joins us in pondering issues in the texts.  And you know that he really listens to what students say because he almost always asks follow-up questions - which seeems like it would suck if you're trying to BS an answer, but it's rare that you're forced to do so in his class because you'll find that his questions usually provoke you to actually think.  And his follow-up questions are not meant to test you, but to make sure that he really understands your comment.\nProf Sacks is truly there for his students.  If you need help with a paper, go to his office hours and he'll flood you with ideas.  If you need an extension, just ask.  He is perhaps a bit eccentric, but what professor isn't?  Taking Lit Hum with Prof Sacks is really really worthwhile - and you know that he feels that his time spent teaching you is worthwhile as well.\nWorkload:\nWe read 10 books while most other classes read 12, and thankfully Prof Sacks chose to leave out Thucydides and Herodotus - two of the biggest (and longest) snoozes.  Two 1000 word papers, one of which can be revised.  Midterm and final, like every other class.  Very fair grader.\n"
        },
        {
            "course_name": "Classical Myth",
            "review_date": "May 11, 2004",
            "review_content": "\nHe is extremely nice, very self-effacing, very very very committed to his work, both teaching and studying (which I find to be rare at this institution).  For him, it's all about close-reading and the texts--if you don't like doing that, you will not like this class.  His major problem is that his thinking on the texts, which I think is fundamentally sound and ultimately very interesting, is nonetheless pretty disorganized, and I (and many others) found the lectures very very hard to follow once the class had moved beyond stories we had all heard and number of times and read at least twice (Odyssey, Iliad, Metamorphoses).  But he really seems like he wants you to do well, that is, wants those who are decent at close-reading to do well, because he bends over backwards in assigning to fit your needs.  \nWorkload:\nOne book every two weeks or so.  Very flexible assignment scheme, which can be tailored both to hard workers and total slackers.  He sympathizes with both types (though that doesn't mean he'll give them both good grades).\n"
        },
        {
            "course_name": "Myth & Literature",
            "review_date": "April 27, 2004",
            "review_content": "\nI had Prof. Sacks for Myth and Literature, and it was an extremely informative and engaging class.  Ancient epic poems (Greek, Roman, Norse, and Celtic) are apparently Prof. Sacks' thing, and he has a frightening, frightening amount of knowledge about  them.  From what I gathered over the course of the class, he understands ancient Greek, Latin, Anglo-Saxon, French, possibly German, and Celtic (both Welsh and Irish varieties).  His analyses of the texts are thus extremely, extremely, detailed.  He works as much as possible with the original language of the epics (though the class reads translations), and his lectures are crammed full of extremely elegant linguistic/thematic connections that are really just fantastic.  It's almost impossible not to learn something new every class.\nSo, as far as lectures go, this guy's great, assuming you have some kind of rudimentary interest in learning about ancient mythic systems.  However, his grading's on the hard side (especially considering few students in the class have the tools or ability to analyze the texts as deeply as he does).  Be warned.\nAlso, it's worth commenting that in my year, there were three different possible grading tracks -- one involving just the final and the midterm, and two others involving either three 3-page analyses or a 10-page final paper.  This flexibility was, for me at least, really convenient and helpful, especially considering the difficulty of getting a handle on the texts.  However, it can lead to certain administrative complications that may prove irritating to some.\nWorkload:\nVariable.  See above.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 22, 2003",
            "review_content": "\nThis guy is a good teacher. He knows a lot about the texts and genuinely has an interest in the class and helping out all of the first-years. He cuts out excessive readings and his paper assignments are minimal compared to other Lit Hum instructors. The only downer about him as that he does laugh at his own jokes... but hey at least he makes them.\nWorkload:\n2-3 papers of 2 pg. length midterm and final\n"
        },
        {
            "course_name": "Introduction to the English Major",
            "review_date": "April 23, 2002",
            "review_content": "\nThe most amazing english teacher i have ever had. not only is sacks hillarious (and he does his best to be entertaining), but his brilliance defies words. he is not afraid to just bask in the beauty of a poem or even a sentence. be warned, however, that he is serious about literature. he will spend hours on one passage, and he 'analyzes the hell' out of everything, as another reviewer wrote. but if you're serious about english, then his class is an unforgettable (and very valuable) experience.\nWorkload:\nthree 600-900 word essays, one of which can be replaced by the optional final.\n"
        },
        {
            "course_name": "Introduction to the English Major",
            "review_date": "January 01, 2002",
            "review_content": "\nFor this section we had to read 3 books-Hamlet, to the lighthouse, and omeros (a 300 page modern epic) and a handful of poems. Because these texts are all incredibly dense and there's a good chance you've read them before, Professor Sacks analyzes the hell out of the language. Sometimes this can be really interesting, especially with the poetry, but others, he goes overboard and spends entire classes on minute sections with little emphasis on the whole and/or themes. In the end, it depends on whether you care about the larger stuff. Professor Sacks is ridiculously smart and I can't imagine anyone doing close textual analysis better than he can, but it's not a course in the lit hum tradition of big ideas. His style is scattered, with him throwing out ideas more than organizing them, but he's such a brain it's at least interesting to watch. he's also an incredibly nice guy and is very understanding. I recommend him and the class, but it's important to know what you're getting into with the close reading.\nWorkload:\ntwo 600-900 word papers and one 6-8 page textual analysis on omeros. not that much reading, although the idea is that you'll keep coming back to the texts.\n"
        },
        {
            "course_name": "Introduction to the English Major",
            "review_date": "April 28, 2001",
            "review_content": "\nWhile Sacks often appears to be interested in sparking discussion, his monologues and tangents lead the class nowhere. He dotes on the insignificant and fails to keep the class's attention. To his benefit, he is understanding about missed classes and late assignments.\nWorkload:\n3 papers, final, oral pres.\n"
        },
        {
            "course_name": "Introduction to the English Major",
            "review_date": "April 28, 2001",
            "review_content": "\nWhile Sacks often appears to be interested in sparking discussion, his monologues and tangents lead the class nowhere. He dotes on the insignificant and fails to keep the class's attention. To his benefit, he is understanding about missed classes and late assignments.\nWorkload:\n3 papers, final, oral pres.\n"
        }
    ]
}