{
    "prof_info": [
        {
            "prof_name": "Page Knox",
            "prof_id": 1214,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 08, 2015",
            "review_content": "\n\nPage is AMAZING. I absolutely loved her class. At first she was slightly off-putting and came off a little aloof and too good for us but as the course went on, she became so approachable and so kind. I highly recommend emailing her to ask for museum suggestions if you ever travel anywhere because she will jump on that as an opportunity to give you a list of like 50 places to see complete with her personal annotations.\nThere are a lot of museum trips involved in her section, partly because she's a lecturer at the Met which really comes in handy for getting privileged access to certain appointment-only rooms which is awesome. Page is a clear, concise lecturer who made an 8:40 section worthwhile and extremely interesting. Take this class! \nWorkload:\nFour papers (around four pages each), Midterm, Final\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 22, 2015",
            "review_content": "\nThe biggest benefit of Knox is that she's been teaching for a while, and she works at the Met and is well connected to the museum scene. So she'll offer lots of field trips, which are actually kind of fun, and an easy way to get face time with her. She's pretty passionate about lots of the art, and is well organized. She offered a review section for the final, alternate times for field trips, etc. \nThe downside, IMO, is that she often seems to want a single right answer from the class, and when she asks questions she doesn't really embrace alternate or conflicting opinions. \nThe midterm had some tricky identification questions, and involved a bit more memorization, and a little bit of writing. The final had easy IDs for unknown works by artists (but come on, at the end of the semester if you can't tell pollock vs rembrandt vs picsasso you deserve a poor grade), plus a bunch of written responses/essays. \nOverall she's a totally fine art hum professor and offers a very acceptable and normal section. You can easily do well if you show up to class, pay attention, and actually visit the museums to write your papers.\nWorkload:\n3 papers based on trips to museums. Fairly standard midterm and final, with more memorization/identification on the midterm and more writing/analysis on the final. A few reading responses. Lots of readings, which you don't have to do.\n"
        },
        {
            "course_name": "Art Hum",
            "review_date": "December 18, 2013",
            "review_content": "\nWould DEFINITELY recommend taking Art Hum with Page. Very straight forward instruction, little to no reading. 3 short papers, and a basic midterm and final exam that shouldn't stress you if you take good notes in class. \nProfessor Knox is an incredible instructor, who makes sure you walk away from the class having learned a thing or two about art, and an appreciation for the vast opportunities to experience it here in the city. (While we may have taken one trip too many to the Met, there is no other way to appreciate being so close to the Monets you learn about in class.) \nMost important thing would be to participate, which shouldn't be too hard given her light-hearted and engaging character. Such a sweet instructor, wish I had more like her! TAKE ART HUM WITH HER. \n\nWorkload:\nLittle to no reading. 3 short papers, and a basic midterm and final exam that shouldn't stress you if you take good notes in class. Just show up to class and talk up. \n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "January 23, 2005",
            "review_content": "\nPage is a great teacher. Although class is somewhat reminiscent of high school, I came out having learned a lot about art. She is very accomadating, and knowledgable. I would definitely recommend her for fulfilling the requirement. \nWorkload:\nVery little. Just go to class.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 11, 2004",
            "review_content": "\nPage is really sweet.  This is a class that really favors the beginning-- upon starting, I couldn't have told you the difference between Bruegel and Bosch if my life depended on it.  She is always ready to help you out and give you a hand.  Show the least bit of effort, and you'll get rewarded for it.  She's really cool about things-- like we had Jackson Pollack day (take a guess) and she took us out to dinner after field trips.  Page's class is neither challenging nor particularly ground-breaking, but it's a fun, easy-\ngoing way to fulfil art hum.\nWorkload:\nThis is probably as easy as it gets.  Three papers (Page'll look over and edit as many drafts as you like, which essentially guarantees you an A) and an extremely doable midterm and final.  Reading is assigned but there is no expectation that it will get done.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "November 19, 2002",
            "review_content": "\nShe's a great teacher, my ass. She's insipid, stupid, idiotic, dull, (add synonym for stupid, don't worry, it won't be excessive). She grades papers based on how they agree with her thoughts, not how well-argued or knowledgeable they are. She's a tricky one too, you'll find out when you take tests. It's surprising how someone this stupid can be crafty.\nWorkload:\nOh man. Not that much. Castration is key.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "November 15, 2002",
            "review_content": "\nI totally disagree with any negative comment made about Page. She is an increadibly informative teacher and her coarse was not only interesting but fun. She took us on many amazing field trips and obviously spent a lot of time preparing fpr this class. She is responsible for all of my newfound knowledge about art in general and is a great teacher !!! \nWorkload:\nnot to much work and not to little, very well - balanced\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "September 14, 2002",
            "review_content": "\nIf you like next to no work, take a Page Knox art class. However, if you like professors who don't deliberately misdirect students, please don't. She'll put arbitrary pieces of art on the exam (art shown in class for 1 sec) and arbitrary comments on your papers. Next to no work, easy to get out off with a decent grade.\nWorkload:\nshe gives the standard arthum assignments at the start, then starts cancelling some cause she's super lazy.\n"
        }
    ]
}