{
    "prof_info": [
        {
            "prof_name": "Ezra Tawil",
            "prof_id": 940,
            "total_reviews": 14
        }
    ],
    "reviews": [
        {
            "course_name": "Feminist Texts I",
            "review_date": "December 14, 2009",
            "review_content": "\nFabulous fabulous fabulous fabulous fabulous. This is the best professor, and the best class I have encountered at Columbia so far. His excitement about literature and the subject carried over to us, and it was clear that because of him, just about everyone had done the readings for every class. We got a full sense of the history of feminism and all the texts he chose were fascinating. Respect, depth, and intellectual rigor were the marks of this class and of the environment Professor Tawil fostered. The seminar setting made for a great exchange of ideas, and by the end you knew each member of the class' intellectual personality. Tawil is a great facilitator of discussion, hilarious, endearing, and sensitive.  Don't miss out.\nWorkload:\nweekly reading, 5 1-2 response papers at your own pace throughout the semester, midterm and final paper or just a longer final paper\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 21, 2007",
            "review_content": "\nEzra is a fantastic professor.  Admittedly I only had him for the first semester of Lit Hum before he was forced to ditch us to teach a non-core class, but while he was here I truly enjoyed Lit Hum.  Ezra has a great, quirky sense of humor and the welcome ability to lead insightful discussions that cover the important material without forcing his agenda.  Ideas brought up by students were discussed in depth, and challenged in a productive manner.  In addition, with each paper he attached nearly a full page of typed, single-spaced notes filled with dead on, incisive comments and suggestions to improve your writing.  I really could not have asked for a better Lit Hum teacher.\nWorkload:\nRequired Lit Hum reading, 3 papers/semester, midterm (exactly what he tells you to expect and designed in the same format as the standardized final to help everyone prepare), and the final.\n"
        },
        {
            "course_name": "Concept of a National Literature",
            "review_date": "July 01, 2006",
            "review_content": "\nEzra is one of the most chilled out instructors in the English Department - possibly even the entire university. Don't mistake his easygoing nature for intellectual laziness, though. He's passionate about his chosen area (pre-Civil War American lit) - perhaps not the most obviously fascinating field of study, but Ezra's dedication to his work and to his teaching made discussing even the most obscure texts provocative. The man could make studying sawdust interesting - he's that dynamic in a classroom. And I quickly learned to appreciate both obscure texts and the \"greatest hits\" from high school (think Hawthorne, Fenimore Cooper, Whitman, etc.). A great professor who makes the cultural aspects of pre-CW America seem fascinating and vital to current debates. Highly recommended \nWorkload:\nIf you put the work in, you'll def. be rewarded, but he won't go easy on you either (he's great at picking out exactly where you're weak as a writer). Term paper, biweekly response papers, a text per week (approx.).\n"
        },
        {
            "course_name": "American Renaissance seminar",
            "review_date": "August 21, 2005",
            "review_content": "\nEzra is possibly the most enthusiastic professor I've ever had. When a professor gushes about Charles Brockden Brown or Melville as much as he does, you can't help but read a bit more carefully. In other words, his enthusiasm is contagious, and that makes for a good seminar. The reading list provides an excellent overview of the American \"classics\" (in quotes, since the premise of the class is to discuss how and why the American literary canon was constructed), as well as key works of criticism. Novels are alternated with criticism week by week. This is an excellent format--we could actually pay attention to criticism we might have overlooked if it had just been assigned as secondary reading. Ezra is extremely accessible and helpful at office hours, and for lack of a better adjective, he's, well, cool. I think most of the class probably wanted to be him.\nWorkload:\nA few close readings (2 pages each) which are helpful in deciding the topic of your term paper, 10-15 page term paper, good books (Melville, Hawthorne, Brown, Stowe, Thoreau, Fiedler, Lawrence, etc)\n"
        },
        {
            "course_name": "Early American Novel (Revolution to Civil War)",
            "review_date": "April 16, 2005",
            "review_content": "\nEzra is an amazingly energetic and interesting professor.  He is everything but intimidating and humorously self-depracating so both lectures and visits to his office hours are really enjoyable.  When it comes to this time period in American Literature, it might (for some) take quite a lot to draw someone's attention, but I think if you give it a chance he will do it for you. Ezra will surprise you with his fascination with the sentiments and the ways that Americans tried to define their nationhood through novels. He finds really unique ways to look at each novel and believe me, you won't see any of it coming.  Most of the books on the reading list are pretty obscure and if you really want to get something out of the class it pays to read the novels and come to his lectures.  I recommend it for American Studies majors interested in literature as well as English majors because it is a good introduction to the methods used to define a specific American quality in novels.\nWorkload:\n4 1-2pg close readings, a fair midterm and a final, and attendance is taken\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "August 17, 2003",
            "review_content": "\nEzra is bar-none the best LitHum teacher at Columbia.  After hearing countless horror stories of LitHum tyrants and sleep-inducing lecturers, I've realized the great luck I had when receiving Ezra as my professor.  Not only is this man brilliant, friendly and fair, he has a genuine passion for the material that I believe to be rare among Core professors.  Ezra didn't gloss over any of the readings, but focused equally and comprehensively on each one.  He guided class discussions but did not dominate them and he has the ability to foster an incredible class dynamic where every student feels comfortable adding to the discussion.  Being a science major, I very much appreciated his broad prespectives and coverage of the material.  He is truly the type of professor that we all chose Columbia for.\nWorkload:\nStandard Lit Hum Readings, 3 papers and fairly simply midterm/final...don't slack off on the papers, he's a tough grader\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 12, 2003",
            "review_content": "\nI do not have anything but praises for Ezra's teaching and for his enthusiasm in class. Having him as my lit hum professor really enhanced my first year in Columbia. He will teach you how to read a passage extensively and exhaustively (a positive and useful tool to have if you are thinking of attending other English classes in Columbia). As said, Ezra knows how to blend his own ideas with students' own and to lead Lit Hum with apparent ease. Having heard some of Ezra's comments in class, I am sure he is a great professor in a lecture setting as well. He certainly knows how to read a text carefully and insightfully and enthusiastically -- what more can you ask in a professor? \nWorkload:\nusual Lit Hum load\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 08, 2003",
            "review_content": "\nI had Ezra last year for Lit Hum.  And I miss the guy terribly.  He was one of the better professors I've had, and he was a wonderfully nice man too.  Feel lucky if you have him.\nWorkload:\nNothing out of the ordinary\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 20, 2003",
            "review_content": "\nEzra is a great professor. His classes are never boring, they actually make time fly. The students usually participate a lot, because he doesn't make anyone feel unappreciated: even the smallest comment will get him to look at you approvingly and smile.  The class isn't easy, though. You have to do the readings or at least find a way to participate because it counts a good percentage of your grade. He's also a tough grader, more leaning towards fair.  Feel lucky if you have him!\nWorkload:\n3 4-5 page essays, midterm, final, participation, no extra reading. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 20, 2002",
            "review_content": "\nEzra is a fantastic professor and his class is a joy. He leads class discussions (rather than lecturing himself), is knowledgeable and supportive. Perhaps even more importantly, he makes classes fun to attend and was, himself, a great friend to all the students in my Lit-Hum section.\n"
        },
        {
            "course_name": "Early American Novel (Revolution to Civil War)",
            "review_date": "September 04, 2002",
            "review_content": "\nI don't know when (or even if) this course will be offered again, so i'll try to briefly summarize Prof. Tawil's style rather than any course specifics. One could do worse than to describe Tawil's approach to literature as historical; both his supplementary readings and bursts of enthusiasm reveal a sensitivity toward a piece of literature's status as a cultural document. Toward this--broadly speaking--cultural status of a given piece of literature, Prof. Tawil's mind is as open as 7-11. There is more to say, but I am tiring here by so eloquently stating my case. My experience in Prof. Tawil's course has made my choice of English as a major worthwhile. \nWorkload:\n5 response papers 5-7 page paper 10-12 page paper\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 12, 2002",
            "review_content": "\nEzra is an ideal Lit Hum professor in that he truly believes in the idea that the class should be an introduction to most Columbia students' discussion courses. He moderates discussion well, allowing students to bring up the points that interest them while steering talk to specific issues that he has in mind. When discussions get out of hand, he doesn't hesitate to put them back on track. Sometimes his lecturing seems a bit scarce, especially when multiple students are clamouring to state their smart-sounding points. In critique of his style, when he does start to lecture on a topic (which is always very insightful and interesting), as soon as someone raises their hand to comment he stops and calls on them. Sure, this builds confidence in each student's discussion abilities, but because of this tendancey, be prepared to have some discussion flag when members of the group don't quite hit on the right subjects - Ezra would rather let you flounder and learn from it then jump in and totally control the class. Lit Hum is, afterall, designed to be a student discussion moderated by the instructor, and Prof. Tawil pulls this off nicely - just pray there aren't any pompous wind-bags in your section (though I guess I learned a good deal from the experience of the occasional wind-bag, even if that learning wasn't quite Lit Hum specific).\nWorkload:\nThe Lit Hum midterms and finals are pieces of cake if you actually do the readings. That said, for Ezra's 3 essays per semester, you'll need to get into very close textual analyses. If at first you're not so good at the specific style of essay he wants, his comments and advice is priceless. I learned a lot and always found his comments on papers and tests accentuated this. If you're lucky enough to get him, stick with him.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 04, 2002",
            "review_content": "\nEzra did a fantastic job with this course, and in his first year teaching it no less. He balances his own ideas for discussion with students' preferred approaches to the texts, making for engaging classes in which everyone learns from their fellow students as well as the professor. Ezra focuses on the material without adhering to any absolute format and holds a real dialogue with his students. Students who do not participate actively in class discussions might not enjoy Ezra's classes as much as more talkative types, but the quality of discussion was consistently high and one could learn from other students' insights without necessarily saying much oneself. As far as grades go, Ezra assigns them fairly and offers helpful feedback on papers without nit-picking. If you need to switch your Lit Hum section and have a vested interest in a truly fulfilling experience with the course, you would do well to take the course with Ezra.\nWorkload:\nStandard Lit Hum requirements: reading and active participation in class discussions, three papers of roughly 5 pages each, midterm in same format as coursewide final exam, final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 24, 2002",
            "review_content": "\nIf you have a choice of lit hum professors, Prof. Tawil is a good bet. He's extremely nice and far from being an old fart of a professor (he's actually quite young). You must keep up with your reading because the class consists mostly of guided dicussions about the work, if you don't read, you can't keep up with the discussions, and you won't learn. If you do keep up with reading, the discussions are engaging and a good way to pass the four hours a week that are Lit Hum. \nWorkload:\nClass participation (proper reading), three papers, a midterm, and a final.\n"
        }
    ]
}