{
    "prof_info": [
        {
            "prof_name": "Jeffrey Helzner",
            "prof_id": 2146,
            "total_reviews": 14
        }
    ],
    "reviews": [
        {
            "course_name": "Epistemology",
            "review_date": "May 07, 2013",
            "review_content": "\nProfessor Helzner is brilliant at what he does, I'm sure. I think he would be a great professor for a logic course, or for probability or rational choice, etc. I felt like in this class, however, he was not very effective. For one thing, I was not happy with the readings on the syllabus. The class was taught almost exclusively out of a textbook, each class's reading simply following the last two readings from Huemer's \"Epistemology.\" Some of the excerpts from that book were interesting and important works, but others were not. In a survey course, I prefer not to read some obscure 20th century analytic philosophers, especially since we didn't read even a short excerpt of Kant! I also found his lectures to be hit-or-miss. Sometimes, especially towards the beginning of the course, we would really dig into one of the subjects of our readings and explore all of its possibilities. Prof. Helzner is extremely thorough and when we stayed on topic, this was extremely helpful. Other times, though, this thoroughness would be directed at totally irrelevant exercises. Frequently, students would raise their hand with, in my opinion, stupid questions that Helzner would take almost the whole lecture responding to. We also spent an inordinate amount of time on digressions about probability or technology-related scenarios. I eventually stopped going to lecture. I think the class was a useful exercise but hopelessly disappointing.\nWorkload:\nFour short assignments and a 10-12 page final paper. Readings for each class 5-20 pages, usually pretty straightforward.\n"
        },
        {
            "course_name": "Philosophy of Science",
            "review_date": "May 09, 2010",
            "review_content": "\nFirst off, Helzner is a really nice professor. I thought of him more as a dude. Very approachable, jokes with his students, but very conscious of bullshit.\nGo to his office hours for homework help and he will help you more than is due. But he expects you to try very hard.\nRational Choice and Philosophy of Science tackle pretty technical subjects in philosophy. You won't ever have had anything like it. The readings are dense, and his lectures will work off of them. If you intend to cram for homeworks or exams, you will have a grueling (but not impossible) time.\nThe thing to note about Rational Choice and Philosophy of Science is that while they are philosophy courses, learning the material is like learning in a science or math field - the material builds up sequentially, and it takes time to sink in. Don't expect to strap down last-minute with a few essays for the final paper and expect to come up with brilliance.\nGrading: Helzner himself said that an A should be an earned grade, should feel special to a student. He gives very few A's. He says he gives out a lot of B's.\nWorkload:\nPhilosophy of Science: 4 homeworks, one 12pg take-home exam\n"
        },
        {
            "course_name": "Introduction to Symbolic Logic",
            "review_date": "May 03, 2010",
            "review_content": "\nThough Varzi may be the go to Symbolic Logic option, taking this course with Professor Helzner was by no means a let down. He usually attempts to infuse the material with some sort of humor (even it's at the expense of the smelly, obnoxious kid in the front row), and grades very fairly, if not generously, on exams. \nUnlike a lot Columbia professors, Jeff wants his students to do well in the class (adjusts curves, schedules review sessions with the TAs, etc.) and is generally a down to earth guy. His office hours, along with the recitations, are extremely helpful resources for the sometimes confusing material. Before every exam he posts several previous tests that pretty accurately reflect what you'll need to know (i.e. same format and types of questions).\nReally, my only criticism of the class is the occasional disconnect between the topics covered in class and those discussed in the textbook. While it's obvious that the guy really enjoys what he's teaching, he typically supplements the lectures with advanced topics of discussion that tend to leave a portion of the class behind. There were a few lectures that dealt with concepts outside of the material we were expected to know for tests, but the TAs quickly cleared up the confusion at recitations. However, if you're at all interested in the field of logic or mathematics, you'll definitely appreciate what he has to offer beyond the textbook.\nUltimately, if you put any effort into this course you'll be rewarded with a more than fair grade. Helzner is a young, knowledgeable and enthusiastic professor that cares about his students (he learned a good portion of the student's names in his 80+ class) and offers extra background in the fields of logic and mathematical theory - which can be positive or negative depending on your interest and ability. Exams closely mirror practice tests, and progressively increase in difficulty, but are all manageable. \nOverall, an interesting, well organized, and at times, entertaining introduction to symbolic logic.\n\nWorkload:\n- Weekly ungraded (yet helpful) homework assignments, 2 Midterms (30% each) and 1 Final (40%).\n- First midterm is of average difficulty: if you've done the HW and studied, you'll have a good shot at getting an A (class average = around 70?, but curve was generously adjusted).\n- Second midterm is essentially a quiz: if you've been following along in class, it should be a joke (class average = 82).\n- Weekly recitations (not required) are definitely useful in gaining a better understanding of the material, as are Helzner's office hours. However, neither are essential.\n"
        },
        {
            "course_name": "Explanation and Induction",
            "review_date": "April 20, 2010",
            "review_content": "\nThis was one of the best philosophy courses I've had in the department, and I've had a few.  Jeff presented the material in a very clear way, and presented many oportunities to find an interesting topic on which to write a research paper.  With graduate students, he often is very supportive, helpful, and challenging.  I will note that I sat in one of his undergraduate classes a couple semesters ago and found him painfully slow.  I don't know if the undergraduates were equally slow, or if he should have picked up the pace, but I couldn't take the class because I was much too bored.\nWorkload:\nWeekly readings, average length, sometimes above-average reference to advanced statistics.  A final 20-page paper.\n"
        },
        {
            "course_name": "Rational Choice",
            "review_date": "December 30, 2008",
            "review_content": "\nHow to describe Jeff Helzner? He's a really great guy, very laid-back and approachable, and he's smart beyond belief. He genuinely cares about his students -- he wants them to learn, not just do the assignments, and to get excited about ideas. He himself gets pretty excited about the subjects he teaches, and his enthusiasm is contagious. I've taken two classes with him, and I loved both of them. The first day of the first class I took with him scared the sh*t out of me, because he gave only a cursory introduction and then jumped in at a high level. But instead of dropping the class I went to talk with him, and I'm very glad I did, because he was incredibly helpful, friendly, and understanding. He took my difficulties into account but at the same time challenged me repeatedly to think harder and at a higher level than I had been before or, honestly, than until that point I had thought I could. I took another class with him the next semester, and was equally happy there. As other reviewers have said, he's very responsive to student feedback about his lectures, and he's quite accommodating about extensions, etc. Highly recommended.\nWorkload:\nDepends on the class. Usually a few short but dense readings each week, and then a midterm and a final or a presentation and a final. The homework probably won't take as long as many classes, and there's a high \"bang for the buck\" -- they usually are quite relevant to the class discussions, and Helzner is very good at extracting the key ideas and weaving them into his lectures.\n"
        },
        {
            "course_name": "Special Topics in Epistemic Logic",
            "review_date": "May 20, 2008",
            "review_content": "\nAs a special topics course, this was not too organized, but on the other hand there were interesting and enlightening discussions every week. Not a huge participation rate, but a high level of discourse, and a real collegiate environment that wasn't competitive or grades/work focused. Helzner is both very smart and very laid back, and he's a good guy in general. If you're looking for in-depth philosophical/analytical discussion without a huge workload, this is a good class to take. \nWorkload:\nA few (very dense) readings a week. One presentation on a reading to the class, one final paper or set of problems.\n"
        },
        {
            "course_name": "Special Topics in Epistemic Logic",
            "review_date": "May 20, 2008",
            "review_content": "\nAs a special topics course, this was not too organized, but on the other hand there were interesting and enlightening discussions every week. Not a huge participation rate, but a high level of discourse, and a real collegiate environment that wasn't competitive or grades/work focused. Helzner is both very smart and very laid back, and he's a good guy in general. If you're looking for in-depth philosophical/analytical discussion without a huge workload, this is a good class to take. \nWorkload:\nA few (very dense) readings a week. One presentation on a reading to the class, one final paper or set of problems.\n"
        },
        {
            "course_name": "Introduction to Symbolic Logic",
            "review_date": "August 02, 2004",
            "review_content": "\nThis man is the nicest person ever, I want to bake him cookies.  I got a B in his class, but it was my fault.  He gave everyone every opportunity to get an A.  He changed the syllabus grading scale just to make sure everyone got the best grade possible.  The curves were generous.  \nWorkload:\nRecitations optional.  Three tests.  \n"
        },
        {
            "course_name": "Rational Choice",
            "review_date": "June 24, 2004",
            "review_content": "\nHelzner had just graduated from grad school last year when I had him so he was pretty idealistic and naive. He really wanted everyone to participate and get excited about the readings which, unfortunately, wasn't the case in my class. But he's a nice guy, very easy going and friendly. He'll love you if you do the readings and talk a lot in class. And hey, it could be worse. He could be Gaifman.\nWorkload:\nPretty light. A bunch of readings each week which aren't very long but kind of important. He really wants you to read anf participate in class. Two large papers due (one is the take home final). Pretty fair grader.\n"
        },
        {
            "course_name": "Introduction to Symbolic Logic",
            "review_date": "June 23, 2004",
            "review_content": "\nProfessor Helzner managed the not insubstantial feat of competently teaching introductory symbolic logic to a huge class of students at many different levels (of interest, ability, and prior knowledge of the subject).\nI can't say he made it fascinating, but he did at least make it manageable.  He actually slacked off a bit on the homework near the end which was unfortunate in that this is largely a grind class -- you just have to do a certain amount of mechanistic symbolic manipulation to understand the underlying semantics -- but fortunate in that by the end of the semester I was starting to worry that if he gave us another homework assignment like the first few, I could easily end up totally swamped.\nHe did seem to expect, at the beginning of the class, that he could work quickly through important principles (or the \"mini proofs\" which abound in this class) on the blackboard and that students would be able to follow along.  I think I was one of the better students in the class (at least, I got one of the better grades) and often I could just barely keep up; other times I couldn't keep up at all.  This is a common failing of mathematicians, of course: they tend to assume that they're talking to people who can make the same intuitive leaps that they can, but only the most exceptional new students of a subject will in fact be able to do so -- to his credit, Professor Helzner managed to get his pacing a bit more dialed-in by the end of the semester and take more time where the students seemed to need it.\nI was a little disappointed by a late, strange change to the grading policy that recentered grades around and seemed to discard information.  I worked my butt off all semester; I didn't really appreciate the \"kindness\" of giving people a chance to lift their grades into the range I'd _earned_ by studying really hard for the final; oh well, instructor's discretion I suppose.\nWorkload:\nThis course is a lot of work.  I wouldn't expect that to differ from one instructor to another.  The first several weeks are heavy on long, painful exercises in symbolic manipulation (several hours each); after that it's mostly conceptual difficulties.  Two \"midterm\" tests, both quite hard; one final.  You'll work hard to get a B in this course; which makes sense, given that it's 4 points.\n"
        },
        {
            "course_name": "Epistemology",
            "review_date": "April 28, 2004",
            "review_content": "\nHelzner is a very knowledgeable, smart professor.  He enjoys the socratic style of teaching - sitting in a chair posing questions and poking holes in answers.  That's a great technique but he doesn't often go beyond it and present lecture material to supplement the questioning.  That means you won't often have a comprehensive treatment of a concept or material in class, which you may or may not prefer.  \nHe is a brilliant professor who respects answers and students.  His give and take in class is always generous and enjoyable.  His math background makes him vulnerable to describing everything in math terms and symbols.  \nExcellent professor if you like his approach.  Clearly brilliant.\nWorkload:\nRegular readings, midterm and final paper.  Not too heavy but challenging material and enjoyable to think through.\n"
        },
        {
            "course_name": "Rational Choice",
            "review_date": "December 16, 2003",
            "review_content": "\nWhy can't all professors be like Jeff?\nJeff is the exceedingly rare mix of an intelligent academic with a personable individual.  He turned 'Rational Choice', a course made synonymous with pain and suffering by professor Gaifman into something, dare I say, enjoyable.\n1) Jeff knows his stuff and obviously still cares about it, beyond some desperate fulfillment of classroom hours.\n2) He is willing to address the various abilities of his students.  If you are having trouble, just say something.  If you are inspired and want to know more, just talk to him.\n\nWorkload:\n1 take-home midterm.  1 take-home final.\nBoth focused on general concepts - an opportunity to review the major themes.\n"
        },
        {
            "course_name": "Rational Choice",
            "review_date": "December 13, 2003",
            "review_content": "\nJeff is one of the most caring and unpretentious professors I have had here.  He genuinely cares that his students are learning and is not as concerned with grading as with participation and actually getting the students to learn.  The class was pretty hard, and I can't say that I understood everything that was going on, but he definitely tried to adapt to all of the students' abilities and knowledge levels.\nWorkload:\nWeekly readings (usually short, but dense).  Take home midterm and final, both graded fairly.\n"
        },
        {
            "course_name": "Rational Choice",
            "review_date": "November 23, 2003",
            "review_content": "\nIf your looking for a proffesor who cares about both his students and the subject matter he is teaching Jeff, as he likes to be called, is the proffesor for you. He lacks the pretension of most other philosophy proffesors and he is very approachable inside and outside of class. He's the kind of teacher who wants to be your friend and is occasionaly very funny in class, but is still interested in covering the material. Lecture is often a bit slow. Jeff spends time reviewing the readings, which are often very confusing, and is perhaps too receptive to people's questions. He is not satisfied until everyone understands the material, which can sometimes bore those who do understand the material.  Both tests were based mainley on the readings and graded fairly.  \nWorkload:\nHe assigns short but hard readings about once a week. Take home midterm and Final. Class particiapation = 20%.\n"
        }
    ]
}