{
    "prof_info": [
        {
            "prof_name": "Tiffany  Hale",
            "prof_id": 13704,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Native American Religions",
            "review_date": "May 22, 2020",
            "review_content": "\nThis class changed the way I view the definition of \"religion\" in Native American context. Professor Hale is lovely. However, we spent almost more than half of our class-time watching Native American documentary and films. The readings were interesting, and I wished we had more time to unpack these during class discussions. Professor Hale is not a great lecturer, but she isn't terrible: I felt that her lectures could have been more prepared ahead with points she wanted to make, and she should work on her delivery. Professor Hale is just starting out so maybe she'll improve. Overall, if you have space in your schedule, it can be a good elective\nWorkload:\n- Weekly readings (not too bad)\n- Weekly quizzes on readings (easy)\n- 3 short essays spread throughout semester\n-Midterm \n- Final in-class presentation \n"
        },
        {
            "course_name": "Intro to Native American Religious Traditions",
            "review_date": "May 01, 2020",
            "review_content": "\nI feel like I have an obligation to warn people about this class. I came in with so much enthusiasm - the class seemed to be a trailblazing initiative to introduce Native American perspectives into academia. However, Professor Hale, while a wonderful person, is not a very good lecturer. Her lectures are dry and she ad-libs heavily on sparse notes splashed onto boring powerpoints. And the worst part? She’ll offer lectures full of rambling anecdotes and then turn around and quiz you on trivial facts that she barely mentioned. (Example: She was discussing different forms of colonialism one day and mentioned *verbally* in a side note that a Gaugin painting was known for depicting romantic colonialism… that side note ended up as one of the main questions on our midterm!) Moreover, straightforward questions are never given a clear answer, and any attempt at clarifying during office hours are met with coy evasions of your concerns. \nAlso, MOVIES are a big part of this class. That may sound fun and low effort, but similar to the lectures, these documentaries are full of personal stories and are then turned into quizzes on random dates and people. You’ll spend the entire length of the film jotting down any event/date/person that is mentioned, because EVERYTHING is fair game. More importantly, we shouldn’t be paying this astronomical price for tuition just to watch movies every other class.\nAll in all, would not recommend.\nWorkload:\nNot too heavy, but again, poor direction:\n20-40 pages of reading a week but IMPOSSIBLE reading quizzes on trivial facts\nThree 5-6 page essays (but with little/no feedback on topics, arguments, etc.)\nShort midterm and final, but very little information on exactly WHAT is on those exams\n"
        },
        {
            "course_name": "Religion Lab",
            "review_date": "December 12, 2019",
            "review_content": "\nProfessor Hale is great! In this seminar, she always had insightful responses to everything we said. She was flexible when things came up and the syllabus had to be changed a bit. Def recommend taking a class with her.\nThe syllabus for this course is nice in the sense that each assignment prepares you for the next one, as well as the discussion posts we had to prepare once a week.\nHowever, you could tell that professor Hale had not written the syllabus (since the class is a requirement for religion majors I am guessing it was designed by the department or something) she was not always able to answer the questions we asked in a coherent way. I was a bit confused about the topics I could and could not pick at times, and I feel like her answers were really vague.\nWorkload:\nClass meets once a week for a little bit less than an hour.\n10 assignments (from essays, research papers, to annotated bibliography).\n6 discussion posts.\nEach week we either had readings and discussion post (one assigned for class, the other for later in the week), or discussion post and assignment.\nClass participation and attendance was 10%\n"
        },
        {
            "course_name": "Indigenous Religious Histories",
            "review_date": "May 30, 2019",
            "review_content": "\nProfessor HALE IS AMAZING. I highly recommend. She is very knowledgeable and expanded my mind on indigenous religion around the world. It was mind-blowing. \nWorkload:\nLight - 2-3 readings for every class. One class-led discussion. Basically just read and talk in class and you'll receive a good grade. Plus one final 15-20 page paper. \n"
        }
    ]
}