{
    "prof_info": [
        {
            "prof_name": "Paul Scolieri",
            "prof_id": 1679,
            "total_reviews": 18
        }
    ],
    "reviews": [
        {
            "course_name": "World Dance History",
            "review_date": "March 28, 2012",
            "review_content": "\nI have a feeling that the only students who like Paul Scoleri's classes are dance students. Do not take this class if you're a Barnard student looking to fulfill your general education requirements (as I did). He is clearly partial towards students that have a proclivity for the arts. If you don't have a solid background in dance, I would advise against taking it. He claims in the beginning that you don't need any experience in dance, but he clearly cares. He also refuses to give extensions. I've never once asked for an extension in my entire college career, and the one time I really needed one he was useless. And of course, we didn't get the papers back until 4-5 weeks later so it's obviously not because he was in a rush to have them graded. He makes the class more dense than it needs to be. You're not going to remember 95% of the terms (often in different languages) that he throws at you so I don't understand why he burdens students with them. The class wasn't hard because it was academically challenging, because it isn't in the least bit. It's that he gives you so much more information than a student can possibly learn/digest in one semester, unless you're taking a light course load, and expects you to know it all. I love culture studies and was looking forward to this class, but quickly realized it was going to fall short of expectations.\nWorkload:\n8, 250+ word postings over the course of the semester; 2 papers; 1 final; usually a screening and/or reading for every class\n"
        },
        {
            "course_name": "World Dance History",
            "review_date": "September 22, 2011",
            "review_content": "\nPaul Scolieri is the best teacher I've ever had, both at Barnard and at Columbia. He is incredibly well-informed about the dance world, as well as amazingly exuberant. He is approachable and respectful and funny. \nThe class really forces you to be open minded about culture in general. The class employs a wide variety of media--readings, screenings, performances, museums--all of which are enjoyable to do. It might seem a little time-consuming at times but I don't think the course would be as effective otherwise. It's also nowhere near as bad as it could be, workload-wise. \nIt's a great survey course for both those with a background in dance and those without. The one thing is that he doesn't cover ballet in any capacity, but if you want to learn about ballet, there are plenty of other courses for you to take. \nI totally recommend this course to everyone ever. \n\nWorkload:\n2 mandatory performances, a trip to a museum, 2 papers, readings, screenings, and a final which is not bad as long as you've gone to class and done the readings and watched the screenings. However, don't make the mistake of not studying for it like I did. There are a lot of vocabulary words you get introduced to then might forget before the final. \n"
        },
        {
            "course_name": "Movement Analysis",
            "review_date": "January 24, 2008",
            "review_content": "\nI loved this course and I love Paul. (It's the second course I took with him. Dance History was equally great.) This course changed my perception of movement. It was really great to think about movement and not necessarily \"dance.\"Â\u009d I approach choreography and dancing differently as a result. Paul was incredibly generous with his time and energy and as almost all other reviewers say, he has endless enthusiasm. He actually worked individually with us on final projects. I met with him at least four times. Plus, he read several drafts of my final paper, filled them with notes and suggestions. He always had words of encouragement. The Laban material is actually fascinating and complex. I didn't expect it to be as physically demanding as some of the material was.  I would definitely encourage dance majors to take this course. It will change the way you think about moving and about the way you see movement.\nWorkload:\nShort writing projects, group studio work outside of class, a fairly involved final project (but totally worth the work).\n"
        },
        {
            "course_name": "Latin American and Carribean Dance",
            "review_date": "May 16, 2007",
            "review_content": "\nThis class is so poorly organized and taught that it really floors me that he's taught it before.  Scolieri seems like a nice enough person, but he obviously puts no thought into preparing for class.  The first twenty minutes are spent playing around on google earth or youtube-- definitely not something that helped cultivate academic growth.  Once he has time to compose himself he;ll want to keep you ten minutes over which, to me, is incredibly disrespectful of the tight schedules of a lot of students.  He assigned a random selection of readings as well as one book (written by his friend), so there's no real academic leaning to the course.  Going to class will also be a waste of time as he encourages people to tell random stories (about rabbis with puppets, for example).  This helps conceal the fact that he really has nothing to say.  Basically the course will be a complete drag on your life.  You won't go to classes because they're so horrible, but then every month or so you'll have an assignment (paper, midterm, paper, final) that will haunt you.\nWorkload:\nThe workload isn't intense, but his lack of a defined scoring rubric is a killer.  Basically it's geared to benefit his most precious Barnard dance students, so keep that in mind.\n"
        },
        {
            "course_name": "Dance History I",
            "review_date": "December 17, 2006",
            "review_content": "\nProf. Scolieri seems like a nice guy, and I'm sure he is. But this class was a waste of my time. I don't think I learned much I'll be able to use in my other classes. I take good notes and my notes were incoherent, and a lot of what he said in-class felt like he was using us for his free-associations. We screened a lot of movies and there was some reading, but it seemed like the videos and readings were really the basis for what he wanted, and the class didn't add much to that -- class time seemed disorganized and arbitrarily put together. The midterm, which was worth less than 10% of our grade, was very difficult and clashed with Paul's casual in-class lassiez-faire attitude. He wasn't very welcoming during office hours and sometimes the grading on papers seemed arbitrary -- if he doesn't agree, a student could find herself penalized for a different opinion. The material we covered was so broad that I don't think I got a deeper understanding of any of the cultures we studied. \nMaybe he was just having an off semester? \nWorkload:\nTwo 4-5 page papers worth 50% of grade;Midterm worth less than 10% of gradeFinal worth 40% of grade.Weekly video screenings/readings. absolutely manageable, if you can deal with going to class. \n"
        },
        {
            "course_name": "History of Dance",
            "review_date": "December 22, 2004",
            "review_content": "\nPaul is amazing.  I have never met a professor as passionate about their subject than this professor.  He was genuinely able to take any historical event from any time and place and somehow interpret it through dance -- not necessarily always so believable but extremely interesting nonetheless!  He really cares about the subject matter and really genuinely wants everyone to do well and learn the info, which is great.  The class is a lot of work, so don't just take it to fill a requirement -- take it if you really want to learn a LOT about dance throughout the world.  I would definitely take another class with Paul as he was an amazing teacher (he's also just incredibly cute, quirky, and witty in class).  And he's not one of these professors that thinks he is the be-all end-all God of Dance History -- he just puts his ideas out there but is very willing and in fact usually wants to hear students' opinions and interpretations.  But this class IS a lot of work, as I said earlier.  So take it for an amazing experience, but don't expect to be able to get away with slacking off.\n"
        },
        {
            "course_name": "History of Dance I: Multicultural Perspectives",
            "review_date": "September 06, 2004",
            "review_content": "\nThis is an amazing class that is taught by an amazing professor.  Like another reviewer said, Professor Scolieri is incredibly loveable and inspiring.  I took this class on a whim my fall semester of freshman year, and I am so glad that I did.  It opened my eyes to the importance of dance in this world and of dance as history but also as a means of maintaining and shaping history.  I was more intrigued by the second half of the semester, during which we learned about dance forms such as butoh and the hula.  If you thought the hula was just about women dancing around in grass skirts, you are mistaken, just like I was before I learned about it.  It's about so much more; dance as a whole is about so much more than just entertainment.  However, this is not to say that I did not enjoy the first half of the semester.  I looked forward to going to class, and even though there's a lot of information to take in during the lectures, Professor Scolieri is incredibly organized and holds your attention with his enthusiasm, energy, and humor.  There were also a few workshops taught by guests, which were all very enjoyable and allowed you to experience a dance first-hand.\nIn short, I absolutely loved the class and Professor Scolieri.\nWorkload:\nFor each class, expect to screen a video or two (which could be anywhere from 30 minutes to more than an hour or almost two hours) and/or read from the course packets for each class.  However, the readings and video screenings can be pretty interesting.\nThere is one midterm, which is of fair caliber and requires you to identify certain terms, analyze a clip of a dance, and write an essay on one of the major themes of the course.  The final is much the same, although longer, of course.  The tests will probably take you the whole of the time that is allotted, not because they are incredibly difficult but because there will be a lot that you need to write and consider.\nThere are also essays.  You will have a choice of writing either (a) two 5-6 page papers or (Ib) one 5-6 page paper and two 750 word papers on two dance performances that you choose to attend in NYC.  One of the 5-6 page papers requires that you visit the Metropolitan Museum of Art and the other requires that you screen three videos.  Professor Scolieri grades your paper thoroughly and fairly, leaving comments and questions to trigger thought.\nTake this class & hopefully youÂ’ll love it as much as I did.\n"
        },
        {
            "course_name": "Latin American and Carribean Dance",
            "review_date": "August 02, 2004",
            "review_content": "\nI enjoyed his class very much.  He always provided great clips and movies as examples of the topics that he was discussing in class--even on the very first day.   He talks about various dances from the Caribbean, Mexico, Spain, and South America.  Another great thing about his class is that he brings in guest speakers or dancers to teach a lesson for class on some days, which is always so much fun.  He does a good job of keeping students entertained and interested, and is always willing to answer any questions.\nWorkload:\nNot too bad.  There are out-of-class film assignments that you'll have to watch in the Barnard Media Center or rent on your own.  He also has a midterm, a final, and two papers.  Also there's a lot of reading from a course pack that he has you buy, as well as separate books that he'll have you purchase later on in the semester.  But overall, the reading does help contribute to class discussion which is never boring.\n"
        },
        {
            "course_name": "Dance History I",
            "review_date": "May 15, 2004",
            "review_content": "\nScolieri is so knowledgeble and fun. His class just blew my mind. Because of him i decided to minor in dance. He makes you feel so comfortable in his class even if you are a freshman and have absolutely no prior dance experience. The assignments take a lot of time but they're so interesting that you want to see all the films and do the readings. you work hard but it's worth it. Scolieri rocks, definitly take his class. \nWorkload:\nnightly readings, film screenings, performance attendances required. a midterm and final (both doable) and 2 8 page papers that are of your choice. \n"
        },
        {
            "course_name": "Dance in NYC",
            "review_date": "January 18, 2004",
            "review_content": "\nProf Scolieri is a really good professor to listen to.  You watch a lot of dance clips in class and he is a very passionate teacher who really seems to enjoy the subject as well as teaching.  He also asks for a lot of input so you have to talk in class.  And go to a lot of shows - but that be fun -- esp when people ask you, \"have you done things in the city\" - you can now say yes...\nHowever, he is a hard grader.  It is not an easy A.  Not a hard B, but not A.  I recommend going to him to discuss each paper - he can be very helpful during his office hours.\nWorkload:\n4 essays during the semester.  a final essay.  going to many performances that you write about during the semester.  So not a bad workload.  Its probably a good idea to glance through the coursepacket, but not really  necessary if you can talk without reading them.  \n"
        },
        {
            "course_name": "Dance History I",
            "review_date": "December 19, 2003",
            "review_content": "\nIf you're interested in dance history, this class will make your head spin. (I mean that in the nicest way possible!) In just one semester, we covered dance in classical Greece, flamenco, African dance, Haitian dance, capoeira, dance in ancient Egypt, belly dance, classical Indian dance, Balinese and Javanese dance, Peking Opera, kabuki, butoh, hula, Native American dance, tango, and so many more. I occasionally thought my arm was going to shrivel up and fall off from writing so much, but I'm glad we covered as much as we did. I was never bored. \nProfessor Scolieri is young and relatively new to the department (although, as he explained to us, he majored in dance when he was a student at CC in the early '90s, making him \"the first boy to graduate from Barnard\"!) He's very inspired and enthusiastic, and this translates well in the classroom. Classes sometimes run 10 minutes longer because he wants to finish what he has to say and there's no way you can deny him that. He's just too bright and loveable. Even if a particular topic doesn't thrill you, you'll find yourself wanting to learn as much as you can about it just so you can understand where he's coming from. He's a very inspiring and funny lecturer and is always willing to meet with you if you have questions or just want to talk about the material.\nOh, and as other readers have said, the man is unreasonably handsome. :)\nWorkload:\nTONS of reading and video screening. You can probably get away without doing a lot of it, but some of it's good. \nTwo 5-page papers (or one 5-pager and two shorter performance analysis papers). Midterm. Final. Don't think this is an easy A, either, because he's incredibly smart and articulate and expects you to write English-major-caliber papers. The tests are fair in that they allow you to really demonstrate what you've learned, but be prepared to spend the full three hours taking the final exam (writing your arm off).\n"
        },
        {
            "course_name": "Dance in New York City",
            "review_date": "November 11, 2003",
            "review_content": "\nI love professor scolieri's class. I knew nothing about dance going in, but had no trouble with the class at all.  And, if you are a dancer, you'll still learn a lot and not feel held back. He's just a great speaker, and makes the class SO interesting.  He just has a wonderful personality.  When students make comments in class, he listens and responds well.  The class discussions are great. It's a very comfortable setting, where you can participate if you want but don't feel like you HAVE to.  The readings are very light.  Most won't take more than 20 min before class. At the beginning of the semester he gave us a pop quiz on the readings. It was just to scare us, and wasn't graded.  You should do the readings anyway, cause it makes the class more enjoyable. Instead of readings, we also had to watch a few films.  But they're not long, and fun to watch.  One was west side story. If you're worried about the performances taking too much of your time-don't. They're a nice break from your work during the week. If you're looking for a fun and interesting class, with a great professor, take this.  I would definitely recommend him. \nWorkload:\nThere are 4 essay's and 1 final take home paper.  The essay's vary in length from 2-3 to 5-6. His grading is average.  Not an easy A, but not  hard either.  In general, its a very light workload. 3 out of the 4 essay's were due before end of october...so you got them out of the way early. \n"
        },
        {
            "course_name": "intro to modern",
            "review_date": "November 05, 2003",
            "review_content": "\nHe has great energy and enthusiasm.  He definitely does a great job of both going slowly but also getting to the fun stuff. Even as a person with some dance experience, I thought the class was challenging, and gave me a great chance to further develop.\n"
        },
        {
            "course_name": "Dance in NYC",
            "review_date": "November 04, 2003",
            "review_content": "\nHe is an amazing professor. And REALLY cute. He's really nice. He does add some extra work and lectures for his class. (Like a chance dance where you have to dance in front of the class) But he's a great guy, super nice, and makes a potentially very boring class interesting and fun. Plus the performances for the class are interesting.\nWorkload:\nFour Papers, 5-10 pages of reading for each class. A final. 8-10 dance performances. \n"
        },
        {
            "course_name": "Dance as Performance in NY",
            "review_date": "October 26, 2003",
            "review_content": "\nI took this course over the summer, so it may have been a bit easier than over the year, especially considering there were only 5 people in the class.  Prof. Scolieri was a really interesting guy - he has a large background in both dance and anthropology and was always very patient with those of us (like me) who knew little to nothing about dance.  He was very laid back and flexible with both the syllabus and the workload and never let the discussions go too far off the mark with stupid questions.  The class was amazing because of all that we got to see, and the work was a bit of EASY reading and one big paper at the end - no sweat.  He was also an extremely easy grader!\nWorkload:\nLight reading and one large paper.  Maybe one or two very short responses and some cool films of dances to watch\n"
        },
        {
            "course_name": "Latin American and Carribean Dance",
            "review_date": "August 03, 2003",
            "review_content": "\nPaul Scolieri is one of the most amazing professors I've had at Columbia. This class was super interesting and fun! Scolieri always kept it exciting by showing movies and bringing in dance instructers to show us some of the steps we were learning about during the week. We also were encouraged to go see dance performances. He is understanding, humorous, and lovable.\nWorkload:\nLight  reading, a few outside readings, two short papers (one six page one eight page) and an easy final. \n"
        },
        {
            "course_name": "Dance in New York City",
            "review_date": "July 17, 2003",
            "review_content": "\nI went into this class knowing absolutely nothing about dance.  Actually, I was just looking for an easy course so I'd have enough credits to graduate.  Paul is very enthusiastic about the subject matter, has a decent sense of humor, and can tell entertaining stories about his past teaching and dancing experiences (ask him about Macauly Culkin).  He will, however, know if you're completely slacking off.  The class consists of the scheduled lecture hours, plus attendance at a number of dance performances throughout the city, which you must then write about.  The semester I took the class, Barnard was also holding an evening lecture series on dance, and we were \"strongly encouraged\" to attend these as well (translation: you'd better have a damn good excuse if you didn't show up).  Paul also added a handful of videos (to be watched in the library) to the workload as the semester progressed.  Passing this class isn't hard - just make sure you go to all the performances, watch the videos (most are pretty interesting, actually), and glace over the reading before class so you can make one moderately insightful comment if he asks you to.\nWorkload:\nNot hard, but time consuming - in addition to the dance performances you must attend off-campus (I think I had to go to 6 out of 8), there are a number of videos that will get added to the syllabus throughout the semester, and perhaps  some on-campus lectures, too.  Four short (2-3 pages) papers, and a final paper.   Weekly readings from a packet were short and easy to skim.\n"
        },
        {
            "course_name": "Dance in NYC",
            "review_date": "June 23, 2003",
            "review_content": "\nProf. Scolieri is an engaging lecturer who creates a fun environment to learn about dance.  He is very knowledgeable on the subject and has a friendly demeanor and quite attractive I would say (that's my personal opinion though).  Overall, I think he is a good professor that challenges his students and makes learning about performing arts exciting.\nWorkload:\nMust attend about 5 dance performances as well as write a review on them.  One major research paper at the end.  Although this class is known to be an \"easy A\" I think you still have to do a good amount of work to get the grade you want.  Its not easy describing a dance performance and interpreting certain pieces if you've never danced or interpreted dance before.\n"
        }
    ]
}