{
    "prof_info": [
        {
            "prof_name": "Leslie Woodard",
            "prof_id": 447,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Senior Honors Fiction",
            "review_date": "May 13, 2006",
            "review_content": "\nLeslie is nice.  And she cares a lot about us.  However, I really didn't like the format of the class - rather than workshopping regularly, we discussed published short stories for 2 hours every week and only workshopped our pieces in the last 3 meetings.  We were supposed to meet in groups to workshop on our own but I doubt many groups met that often... I mean, we were all 2nd semester seniors.  The final pieces were pretty awesome - they were generally revisions of older pieces made into larger collections around some sort of theme - so our \"reading\" was good.  But I guess I wish it was run like a traditional writing course rather than an English class.\nWorkload:\nsubmit a final \"project\" (some people wrote novels/\nnovellas, others wrote collections of stories/essays, some turned in a project that they were starting to work on)\n"
        },
        {
            "course_name": "Short Prose Forms",
            "review_date": "May 09, 2006",
            "review_content": "\nI enjoyed my time with Leslie tremendously and a lot of the complaints many recent reviewers had, I didnÂ’t find throughout the class this semester.  The class was well organized.  She created a sheet that listed when each student would workshop, so there was no excuse not to know when you were going.  The exercises were mandatory and quite helpful.  I liked her feedback.  She doesnÂ’t rip a piece a part in order to get her point across but she does give criticism in a way thatÂ’s easy to handle.  ThatÂ’s not saying she holds your hand and doesnÂ’t want to damage your ego but lets get real here, more people are inclined to listen to someoneÂ’s feedback if itÂ’s not given in a confrontational manner.  She always gave a lot of insight and for the most part, could always figure out what was making the piece work and what was making the piece suffer.  She didnÂ’t tell the same narrator, character, writer story numerous times.  In fact, I only remember hearing it once.  And if she had to repeat it many times throughout the semester in the past, then clearly people werenÂ’t listening if that same mistake was made over and over again.  I do agree that perhaps more comments could have been made on the drafts we handed in to her but I also found going to her outside of class was extremely helpful and she always made time for students.  I canÂ’t say enough how much I enjoyed my time with her.  I recommend taking any course she teaches. \nWorkload:\nEleven weekly assignments.   Four pieces (3 are read in class; the 4th is just handed in with the portfolio.)  Not bad at all.  \n"
        },
        {
            "course_name": "Short Prose Forms",
            "review_date": "May 22, 2005",
            "review_content": "\nLeslie isn't a goddess, she's just a really bubbly mortal.  And her class wasn't enlightening, it was just light.  After reading all of the previous reviews, I feel like it's blasphemous to even criticize her, but it has to be done.  There is this Leslie Woodard cult phenomenon that seems to be brainwashing everyone in the creative writing department.  She's a very nice person, but there's a difference between a nice person and a good professor.   Her class was fun, but not very challenging and not very constructive.  A previous reviewer said that Leslie can make any piece of shit writing good, but the truth is that she just never gives any criticism, and therefore even the shitty pieces seem like they're great when in reality they just suck.  And while ALL of her in-class comments were sticky sweet and positive, her written comments were extremely spare and not helpful whatsoever.  I personally do not take workshopping classes to have my work praised, but to improve and grow as a writer, and I would have really appreciated it if I had received at least a little constructive criticism from Leslie.  Yes, the class was fun; yes, Leslie was entertaining and animated, but I think that a writing class should be about more than just inflating your ego.  And while her anecdotes were funny, they took up an incredible amount of class time, and we were never able to workshop everyone's pieces by the end of the semester (and she tells the same story about the relationship btw the narrator, the writer and the character over and over and over again).  Maybe I'm losing my mind, but I wouldn't suggest taking this class with Leslie.  There are a lot of other lesser-known professors in the writing dept that TRUELY care about pushing their students to improve their writing, while I think that Leslie is a lot of empty talk. \nWorkload:\n3-4 workshop pieces, shitload of really specific exercises that end up being pretty lame (ie: piece about a \"goofy thing to do\", write a \"letter to the workshop\") - all included in a final portfolio + revisions of the workshop pieces\n"
        },
        {
            "course_name": "Short Prose Forms",
            "review_date": "May 16, 2005",
            "review_content": "\nI'm sort of mixed about Prof. Woodard.  I think she's a great lady, very nice and animated and when people are workshopping she is pretty decent at making sure that everyone gets some criticism to work with (as opposed to just praise).  While the class was definitely fun and there was never really a dull moment, I left the class feeling like she was overrated.  We didn't get to workshop 4 pieces each as planned as we would often go of on tangents or she would tell an off-topic story, such was the whole idea of the narrator, the character and the writer seperation - 6 times!  We kept falling behind schedule, and she'd forget to tell people who was workshopping, etc.  Also, I was dismayed that she didn't give much of her own feedback on the pieces.  Other (less high-profile) professors that I had gave paragraphs worth of feedback whereas she gave sentences here and there.  Also, she was less accessible than most other Writing professors.  This is not to say that she's inaccessible - it's just that some of the other profs in the writing program go leaps and bounds over their job descriptions.  So take the class for the value of having the director of creative writing for a class, but don't expect that it's any better than another writing class.\nWorkload:\n4 workshopped pieces (we only got to 3, so we handed in a first draft of the 4th), 11 exercises (about weekly).  All handed in in a portfolio.  She's a tougher grader than most of the other writing profs... B is good and from what I heard she doesn't give As (but I don't know what the grade distribution is)\n"
        },
        {
            "course_name": "Short Prose Forms",
            "review_date": "April 30, 2005",
            "review_content": "\nYou know that old saying, \"You can't polish a turd\"?  Meaning, if a piece of writing is so horrible that there's nothing you can do with it but flush it?  Well, not that she would, but if she wanted to, this woman probably could polish one until it shined.  Simply amazing editor, professor, and advisor.\n"
        },
        {
            "course_name": "Short Prose Forms",
            "review_date": "September 29, 2004",
            "review_content": "\nGoddess.  Diva.  Inspirational speaker meets world-class editor meets muse.  Bring a huge notebook to class, because you will want to write down everything this woman mutters and hold the statements close to you in bed on nights when the world seems cruel.  She can draw the most interesting of conversations out of the worst of poems, and find room for improvements in pieces that already deserve Pulitzers.  Plus, she dresses like nobody's business.  \n"
        },
        {
            "course_name": "Short Prose Forms",
            "review_date": "April 02, 2004",
            "review_content": "\nLeslie is really great.  When she talks, you really want to listen to what she has to say, which I can't say for some of my previous creative writing professors.  She makes it a point to not forget that writing is supposed to be fun.  Her class is usually pretty amusing and shockingly productive.  She's laid back, drops frequent pearls of wisdom and tosses out phrases like \"we don't want to put fur on the whale\" that are just entertaining.  Her class also fills up the first day of registration, so don't be late.  \n"
        },
        {
            "course_name": "Structure and Style I",
            "review_date": "January 14, 2004",
            "review_content": "\nLeslie is great.  The words that fall from her mouth are like little truisms waiting to be imbed themselves in your brain and vocabulary and give you a new window on life.  She is obviously primarily concerned with finishing her own book, which occasionally makes her a little absent-minded (she told us the same stories sometimes five or six times, but we always liked them and didn't want to hurt her feelings), but she does well at bringing us back the essence of what we're trying to do.  She did kind of slack on giving us assignments - a high school creative writing class would have given you more of a portfolio.  But she is a great writer and a great counselor - expect class to go long quite often, because she doesn't keep track of the time well. \nWorkload:\nWeekly assignments - either a poem, prose poem, short story, or dramatic scene, or a reaction to some of the great stuff she's copied out for you.  Grading is rough - the final portfolio and attendance/participation are the only determinants - i got a B+.\n"
        },
        {
            "course_name": "Short Prose Forms",
            "review_date": "December 22, 2003",
            "review_content": "\nIt was an honor to take this woman's short prose forms course and then review her in the noblest of all such forms, the Culpa review.  You've got a ton of choices in this department coursewise, and this one is delightful if only because writing short prose is quick, potentially a real challenge, and provides some damn fine stuff to workshop of your fellow students.  Leslie is a real swell teacher, a woman young at heart with a penchant for rambling in a lovable way about the nuances of writing and the ins and outs of life.  You get to spend a lot of time on each piece workshopped, meaning often you get through fewer pieces than planned in a given class period.  Leslie is a great editor, capable of bringing out things in your piece you might have missed and helping you shine them to represent your best work.  She's hands down the most approachable professor I have ever had at this school and always available to talk.  A real winner.\nWorkload:\nAssignments given weekly and checked once or twice throughout the semester.  Four major pieces and revisions of them, along with an expectation that you'll carefully read and edit your classmates' work.\n"
        },
        {
            "course_name": "Structure and Style I",
            "review_date": "January 02, 2003",
            "review_content": "\nWhat a goddess.   I don't know where to begin praising Leslie.  She genuinely cares about each and every student and about each and every piece of writing set in front of her.  She has the magical ability to take on a piece with as much interest and devotion as if she were its author, balancing that with the distance of a smart, canny editor, which makes for a fantastically inspiring combination.  In class, she lets her students take workshops as far as they can, nudging them along on their way to becoming better writers by turning them into better editors.  Of course, she always offers her own ideas for revision, always humbly, humorously, and brilliantly: she might tell you to change a single word or restructure the whole thing, but she's always dead-on.  Her office hours are a treat: there, you get her full attention for as long as it takes to make you feel comfortable and capable.  She's warm, kind, generous, both playful and sensible, and a damned good editor.  How can you not love a woman who says things like, \"I don't want to put fur on your whale\"?  What a lovely experience.\nWorkload:\nSix major assignments: two poems, one prose poem, a monologue, a scene, and a short story.  Occasional smaller assignments.  Each student's work is workshopped three or four times: you get to pick what you want looked at and when.  Short weekly responses to one of the thousands of poems, scenes, stories, etc. that she diligently photocopies and passes around largely for your own enjoyment and enrichment.  Portfolio due at the end of the semester with revisions of all your major pieces.  Contribution during workshops not wrenched out of the shy or taciturn, but it's much more fun and more productive when everyone gets into it.  Go to office hours.\n"
        },
        {
            "course_name": "Structure and Style I",
            "review_date": "December 31, 1999",
            "review_content": "\n16-20 students participate in a round-table discussion and workshop of each others work. You will be asked to turn in a variety of assignments (poems, free verse, short stories, and a one-act drama) that are designed to challenge you. These workshops are moderated by the professor but the bulk of the comments are by other students. But this is standard Structure & Style stuff. What makes Woodard worth choosing is her attitude towards the whole thing. \"If you write it, I read it\" is her motto. Frequently, I find that the workshops become love-fests and criticism is lacking; in that respect a hyper-critical person might bring the class back to criticizing, not flattery. But Woodard is not hyper-critical. The grading is easy and the work load is not difficult, although not exactly light. If you are interested in writing, take the class; you'll probably enjoy it. If you are looking for an \"all poetry\" or \"all drama\" class, this is definitely not your thing.\nWorkload:\nWeekly writing assignments which vary: 2 poems, 1 prose poem, 1 one-act play, 1 short story, along with various \"helping\" assignments (write a character sketch, describe a feeling, etc.). \n"
        }
    ]
}