{
    "prof_info": [
        {
            "prof_name": "Anna Popovitch",
            "prof_id": 3062,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 10, 2010",
            "review_content": "\nI'm not entirely sure what the previous reviewer was thinking. I admit, the first few days I thought Anna was a little strange, but that opinion changed itself almost instantly. In reality, Anna is both extremely engaging and very funny. I've never had a discussion class in which so many people actively participated. Anna did an excellent job keeping the discussions on track and relevant, while still letting the conversations diverge into whatever the students happened to want to talk about. Perhaps the previous reviewer was intimidated by the fact that she often challenges students' arguments, asking them to back them up or perhaps giving counterexamples or rebuttals. But that was one of my favorite parts; in a lot of my others discussion classes professors just accept or move on from student opinions, which often causes the rest of the class to lose out on understanding the point.\nIn sum, Anna kept a perfect balance between getting us understand the material and letting us enjoy the process. Truly excellent teacher.\nWorkload:\nReasonable and fair. Yes, the reading can be long, but we're used to that. Discussion posts twice a week, but she gives questions we can answer or lets us talk about whatever we want. Two essays (5-7 pages), graded extremely fairly. Midterm was very reasonable; I expect the final to be as well.\n"
        },
        {
            "course_name": "Latin American Humanities I",
            "review_date": "December 13, 2006",
            "review_content": "\nThis class was easy, but it was an absolute pain to sit through.  Anna does not have a very strong classroom presence and has a annoying  monotone voice, two facts that make it extremely difficulut to remain attentive.  Additionally, she will often disaggree with and ridicule student comments.  This might have provided her with mental superiority, but it quickly caused another reaction: after the first three weeks of class, most of the students quit talking.  The latter half of the year mainly consisted of Anna asking questions, the students remaining silent for 20-40 seconds of painful silence, and then Anna answering her own question.  The class clearly failed to provide the seminar atmosphere that I was hoping for.\nNonetheless, the class was easy.  I did all the reading, which I found really interesting (the fall of Tenochititlan, told from multiple perspectives, is riveting).  But if someone wanted to skate by and skip a lot of the reading, they could do so and still come out of this class with an \"A.\"  \nWorkload:\n30-60 pages of reading per class, except for the three classes in which we watched movies.  Two 6-7 page papers.  Easy midterm and final, composed of the following format: defining terms (selected from a list she emailed out to the class), 5 passage IDs (out of 7 choices), and one longer essay (two for the final).  \n"
        }
    ]
}