{
    "prof_info": [
        {
            "prof_name": "Michael Ting",
            "prof_id": 1961,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "American Politics Seminar: Bureaucratic Politics",
            "review_date": "December 19, 2007",
            "review_content": "\nThe review below is way too negative. Sure Professor Ting doesn't blow you away with some fanciful knowledge, but this class contains a lot more interesting stuff which its title belies. We studied stuff like merit pay for teachers in the US, rulemaking in the agencies, the influence of the judicial branch upon the bureaucracy and the presence of interest groups in the US etc.. The course title just puts people off, and the first 2 weeks of theoretical reading is a little dry. But once the class moved past those 2 weeks, things get really interesting, and we touch on stuff which you would never come across in you life (if you've never taken this class).\nProfessor Ting is also very approachable during his office hours. Also, it helped that the class size was incredibly small (like 6??) so we had a really intimate discussion and got to discuss lots of current topics like CIA intelligence about Iran and Iraq. \nI'd recommend this class to anyone who's thinking of going into public policy or government, since it goes into the nuts-and-bolts of government.\nWorkload:\nmanageable. typical seminar workload. but you get to pick and choose what you want to read. \n1 final paper (15 page). 2 short 5 page assignments. \n"
        },
        {
            "course_name": "Game Theory and Political Theory",
            "review_date": "April 27, 2004",
            "review_content": "\nThis is an excellent class that covers a lot of material: you will start with toy models for a fifth-grader and end up reading original research papers in the field with full understanding.  However, the class requires either a mathematical backgroud that goes well beyong the official prerequisite, or a substantial amount of hard work. Many people in the class had neither of the two. \nThus, when one is reading people's assessments of the course one should keep in mind that not all students in the class were really in a position to adequately assess prof. Ting's competency. I was one of the students who found problem sets relatively easy (I worked alone on all of them) and for all I can tell, prof. Ting is at the top of his game. Not once did he put me in position to reflect on his mastery of the course material and I normally don't need much to start suspecting that one is not fully competent.\nIn addition, he is a just an excellent instructor, again, if you you are sufficiently prepared for the class. If you know little math and hardly ever open the textbook he may be hard to comprehend. On the other hand, I personally had only one math class before (and I have taken quite a few math classes over the years) in which the lectures were at the same time so informative, so engaging and so easy to follow. Even the hardest of proofs were given with great clarity and precision.\nThe materail covered in class is very interesting and a must-know for every serious social scientist. Prof. Ting does a great job of integrating across various models and tying it up with actual research questions in political science.\nWorkload:\ndepends on the background. 6 problem sets (40%), mostly based on relatively easy examples in the textbook; an average problem set took me about 6-7 hours. a midterm (20%) and a final (40%). in addition, i spent about 20-30 hours reading the two textbook and practicing problems unrelated to the problem sets.\n"
        },
        {
            "course_name": "Game Theory and Political Theory",
            "review_date": "April 20, 2004",
            "review_content": "\nI was really looking forward to this class. When I came to class the first day, there were about 45-50 people there. Within 2 lectures, the class size was cut in half. Why? I'm not sure. Maybe they noticed something I didn't notice until later on. Game theory is extremely interesting, and if taught by the right teacher, it will be even more interesting. However, Prof. Ting is not that teacher. His grasp of Game Theory seems mediocre at best. If you are willing to spend a good amount of time on your own just reading the textbook, then you might still enjoy it. But if you think you are going to come to lecture, take notes, and do well on the problem sets, think again.\nWorkload:\n6 problem sets, bi-weekly, insanely hard; you can work in groups of up to 4 people, but it seemed like most people worked on their own; midterm average was 14.4/30, and it was well difficult. Haven't take final exam yet, but don't expect it to be any easier than the rest of the coursework. Curve is very generous (centered at B+/A-).\n"
        },
        {
            "course_name": "American Politics Seminar: Bureaucratic Politics",
            "review_date": "January 19, 2004",
            "review_content": "\nThis class was awful. In Ting's defense, the material was not too interesting, but Ting is clueless as an instructor. It is almost insulting to students that the political science department continues to dish out these professors with obviously no ability to teach. Ting is no exception. Class discussion was completely absent. Ting employed the \"fill in the blanks\" method of teaching, where he asked really easy questions. hoping that someone would peep up their voice to finish his sentence. In reality, he had no clue how to generate discussion, and the material was presented in an abhorrent way. Michael Ting is a good guy, and a good person. He is not a teacher. \nWorkload:\nOne 25 page paper at the end of the semester, twice serving as a \"discussion leader\" where you need to write an outline of the reading for the class, and a moderate amount of very dull reading. \n"
        }
    ]
}