{
    "prof_info": [
        {
            "prof_name": "Nam  Le",
            "prof_id": 3593,
            "total_reviews": 20
        }
    ],
    "reviews": [
        {
            "course_name": "Calculus III",
            "review_date": "September 10, 2013",
            "review_content": "\nYou will learn a lot in this course, and Nam is an great lecturer on par with most humanities departments. He likes to use colorful metaphors and write out everything in the form of a question and answer, so the pacing is better than most calc classes. There are review sessions in class before each of the midterms, and if you're good with the textbook, these are really the only classes you need to attend.\nThe exams are too long for someone who's never taken multivariable calc to reasonably complete in time, even if you show up early, so there is a curve. Unfortunately, because of these aforementioned people, the curve is very harsh, and I got a B even being half to one standard deviation above the mean. He gives a distribution of grades after every midterm, and there were a ton toward the top scoring 95-100. The few people at the bottom leave after the first midterm.\nThe review where someone said this was a good class for econ majors is true to some extent - it's not overly abstract, and there are plenty of computations. The explanations are also very clear and come up in later classes. However, the exams have relatively difficult proofs which are pretty useless for microecon and beyond, but I'd imagine they're useful training for higher math. I would recommend Hom or Anand if you're GPA-hunting, but Nam is better for learning and truly understanding the concepts.\nOverall, a solid choice for Calc III if you need it for the requirement. If you're an engineer, you will likely excel.\nWorkload:\n12 problem sets, 2 dropped. Graded relatively lightly. Everyone I knew used Slader.\nTwo midterms, first graded more lightly than the second. Lots of proofs.\nFinal. Very low median.\nBeware the curve.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "May 24, 2013",
            "review_content": "\nPretty fair course overall.\nHe taught pretty clearly in terms of concepts. He included some cute tidbits related to the topic of the day into the lecture. A lot of people had trouble with his accent. I rather had some trouble hearing him because his voice just doesn't project too well so I recommend sitting in the front and I didn't really have a problem with his accent. Take good notes of the examples in class because the proofs on the tests can be pretty tricky and I realize a quite a few were from class. Speaking of proofs, there are simple ways to do it but that was really the part where I had a lot of trouble. \nHomework: Problems were medium to difficult but nothing you can't do with the help of a friend or two. He also sent reminder emails which was helpful when you get thrown off schedule with breaks and such. \nExams: He actually has review sessions before each test and gives you an outline of the things to be tested and review problems that you should most definitely do before the test. big plus in my book. In terms of the actual exams I thought they were medium to difficult, the final being the hardest of them all. A bit more proof heavy than I'm used to so it's best to really review the practice test he puts up. \nOver all really fair course of Calc III that I can't complain about. \nWorkload:\n12 Problem Sets, 2 dropped. Worth 15%\n2 Midterms, first one worth 20%, second worth 25%\n1 Final worth 40%\nin general pretty do-able. \n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "May 17, 2013",
            "review_content": "\nprof Nam Le is being very clear the whole time (his favorite question is \"is it clear about this?\"). and straight-forward about what to expect on exams. Many exam questions are related to the examples he went over in class or homework. He writes comprehensive and clear notes on the board (but sometimes might be difficult to see from the back, so if you don't have good eyesight, sit in the front)\nIn terms of difficulty, I don't know how to describe it since I have no idea of the student body. But my impression is there is a pretty even spread of the grades (prof Le posted all possible grades for every exam). E.g. The average of our final is 55. There seems to be about equal number of people in all ranges, except at the two ends (90s or 20s/10s). \nHe doesn't require using webassign, which is a money saver for me. \nIn terms of theory/calculation balance, as he said, if you only want theory/proofs, you should go to an honor class. This class is more calculation based, but with a good balance of theory and calculation, in my view.\nAbout his accent: here are the two rules 1) he tends to under-pronounce s and/or the ending consonant. e.g he will say \"use\" like  \"u\" , or \"describe\" like \"decribe\". 2) sometimes he mixes f with p, which is common among many other foreign speakers. Once you get the two rules, you should be able to understand him pretty easily, since there are not many vocabs in maths anyway. \nOverall, there is no surprise with this class You will most likely be fine. \nWorkload:\naverage\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "May 16, 2013",
            "review_content": "\nThis class was very enjoyable overall. His lectures become dry after a while but he goes over important stuff not covered in the textbook. To do very well on his exams you need to go to his class or get very good notes because he tells you which problem is final or midterm material when he goes over them in class. Only tricky thing though is that he doesn't do difficult proofs in class but they do show up in the midterms and finals. His exams are also very long and will probability take up the full time. \nOverall, very funny and knowledgeable guy. 10/10 would take a course taught by him again!\nWorkload:\nWeekly Problem Sets - maybe only 2 of them were hard\n2 Midterms worth 15% and 25%\n1 Final\n\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "May 19, 2011",
            "review_content": "\nNam Le was a good calc teacher. He's not as amazing as some of the reviews say, but he certainly is good. I feel like I learned calc in his class, but I also feel like it's the kind of class that you could do on your own. His tests are fair - pretty much re-writes of the review problems. The proofs can be a bit tricky, but only the ones on the final were hard. The final was harder than the midterms, which were really fair. It was still doable, though. He has a great curve; I think he curves to a B+. You can't go wrong taking this class, but you also won't be inspired (then again, it is Calc III). \nWorkload:\n12 problem sets - 2 dropped. 2 midterms. Final. \n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "May 13, 2011",
            "review_content": "\nNam's a very smart, entertaining and eccentric guy. He's highly competent and super knowledgeable about the material that we're learning. As previous reviewers have indicated, yes, he peppers his lectures with corny jokes, analogies, and many, many anecdotes (that are relevant to calculus 50% of the time). I didn't find myself bored at any of his lectures. The minute you start to feel drowsy, odds are you'll hear Nam say something either very funny or totally wacky and the whole class starts laughing. He's also a very friendly and approachable (albeit, he's sort of \"out there\") guy who's usually willing to help his students. Do keep in mind that he frequently responds to questions by making up elaborate analogies on the spot, which, like his anecdotes, don't always make complete sense to others. But he's helpful...most of the time.\nI found Nam's Calculus III section to be a \"math for non-math majors\" type of class. He takes complicated and abstract concepts and presents them to the class in a extremely simple and straight-forward way. He's very clear about what's on his tests, which are usually fairly straight-forward and don't involve too much tedious computation. \nWhile Nam's section is probably the most straight-forward of the Calc III sections offered at Columbia, that's not to say that there aren't some very difficult problems (usually proofs) on his exams that may require you to see a \"trick.\" Here's the good news regarding the more challenging questions on Nam's exams: 1) A good number of the trickier problems and proofs on Nam's exams have been covered in class before (I would HIGHLY recommend you go to his lectures since Nam doesn't really follow the Stewart text very much and tends to put lecture material not covered in Stewart on his texts), 2) Nam allows cheat sheets on his tests, 3) The midterms and finals usually have a 15 point bonus at the end. The bonuses are sometimes surprisingly easy (extra 10-15 points at your disposal?)\nIf you're a possible math major who's interested in the theoretical aspects of multivariate calculus, this may not be the class for you. If you're fulfilling a science major / econ / pre med Calculus III requirement and want the most straight-forward Calc III section (and an entertainingly wacky math professor), THIS IS THE SECTION TO GET INTO.\nDid I find this class to be mathematically enlightening? No.\nAs a science major, did I find this class to be a fairly straight-forward way to ace a math requirement? Yes. \n\nWorkload:\n1st midterm average 75-80 range; 2nd midterm average 75-80 range; Final exam average 65-70 range. \n\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "May 13, 2011",
            "review_content": "\nNam Le's a great professor!\nYes, his accent is a bit difficult to understand at first, but you get used to it.\nHis class notes are really good, and a lot of the stuff that appears on the midterms and final is similar to the examples he does in class. That said, you don't really need to go to class, and you'll be okay, as long as you do the homework.\nAlso, he is one of the few Calc III professors that allows you to bring cheat sheets for the midterm and final.\nThe curve is generous too, with about half the class getting A- and above.\nWorkload:\nWeekly Problems Set (about 10-12 problems each week) - Lowest dropped (15% of grade)\n2 Midterms (20 and 25% respectively)\nFinal (approx 40%)\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "May 01, 2011",
            "review_content": "\nExcellent.  Absolutely excellent.  Prof Le is occasionally difficult to understand, but once you get used to his accent, he is truly a wonderful professor.  His examples on Black-Shoals were great.  Class size was pretty big, which was unfortunate.  It was definitely helpful to sit toward the front of the room for chalkboard clarity and auditory clarity.  He also manages to present the material with virtually zero unnecessary complexity, which is very rare for a math teacher.  His jokes also show that he has both a left and a right brain, which is refreshing!  He's a funny and caring guy, and he's brilliant at teach Calc III.  What more could you want of a professor?  (His office is a mess, though, so try to pick up your exam/homework in class, even if you have to wait!)\nSometimes his extra questions are hard to do if you weren't in class or didn't understand one of the topics not covered in the text.  Not a big deal though...some Googling is all it takes to put you on the right path to solving the problem...or digging a little deeper in your class notes!\nAs in many math classes there seems to be a gap between what is on the exams and what is in the textbook, though not as much as in other math classes.  Professors should coach their students on how to bridge this gap.\nProfessor Le is excellent.  In almost every way possible.  Occasionally his handwriting is hard to read, but he writes every step out no matter how simple, so I can't blame him for this.  Also, he never erases a panel until the whole board is full, which is excellent.\nWorkload:\nAverage.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "January 12, 2011",
            "review_content": "\nI was in the same class as the person who wrote the last review and I have to say, wow, I don't think we were in the same class.  Mr. Le's class was not an \"easy A\" in was in fact rather hard.  I might even go so far as to say it was among the most difficult classes I have ever had at columbia.\nAll that being said.  Mr. Le is a fantastic professor and he is quite approachable and kind.  He does have an accent but it isn't difficult to understand him and he does his best to explain the material in a way that is easy to understand.  \nBut here is what I believe is the rub: the exams aren't so much impossibly difficult as they are very difficult to complete in the time allotted.  I most surely would have done better on both midterms had I had another 45 minutes or so to complete them.  This might not have been the experience of all the students in the class but it sure was for many of us...most people were still working on their midterms when Mr. Le told us to stop.  \nMy warning to a prospective student is this:  yes, he allows cheat sheets to the exam but having a cheat sheet isn't enough, he tests only the most difficult material and you need to not just know how to do it, you need to know how to do it QUICKLY. \nStill, Mr. Le is a wonderful man and a terrific professor, but don't believe anyone who tells you his class isn't difficult, because unless you're already familiar with Calc III you'll be swimming.  \nWorkload:\nRather heavy.  The problem sets are typically long and tend to be the more difficult questions in each section.  6-10 hours a week doing hw.\n\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "December 21, 2010",
            "review_content": "\nEasiest class to take as a freshmen, especially if you took some sort of Algebra before in high school. He expects nothing from you, and teaches as if it were a humanities class. Its okay that you don't know how to do any calculations, if you somewhat know the concepts.\nThe majority of the class was the same material as my high school Precalculus class, but dumbed down. The fact that he lets you take in sheets of note for the exams makes it ridiculously easy, since you can copy down graphs, forms, etc.\nI personally only went to class five times-- the first day, the day before midterm#1, midterm#1, day before midterm#2, and midterm#2. Walked away with an easy A+\nThis is definitely the Calculus III class to take, Every other Calc III class looks so much more difficult. (I have looked at the exam questions for the other professors... devastating)\nWorkload:\nProblem sets, which are fairly long. But it doesn't matter if you don't take them that seriously, since the extra credit on exams will make up for it...\nTwo midterms, very easy, you can take in 2 sheets of notes with you\nFinal Exam, slightly more challenging than midterms, but you can take in 4 sheets of notes. (You will actually have trouble filling up 4 sheets of notes, since Calc 3 is only covering 2 chapters in Stewart)\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "December 21, 2010",
            "review_content": "\nNam Le is an amazing instructor and managed to make a 9am calculus class one of my most enjoyable moments at Columbia. He covered basically all the material with depth and was extremely clear in his presentations. He does have an accent, but you get used to it, and he is very approachable if you have questions after class. Sometimes, he goes a bit too far and makes strange statements about life as a grad student, or how he loves Paris, but it was usually entertaining. Whether you love calculus and are looking for a good professor, or actually hate it and are looking for the least horrible option, you should definitely go for Nam Le.\nWorkload:\nAverage for calculus classes: weekly problem sets, two midterms and final. Grading was fair, and exams were very straightforward.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "November 09, 2010",
            "review_content": "\nNam Le is the most amazing professor I've had so far. In one of his lectures he stopped and told us that Calc III is like Paris, and that you can tour Paris using a guidebook, our textbook, but that the lectures are like a A Movable Feast (an autobiographical Hemingway novel that discusses his life in Paris). He was right in saying so and I've somehow never missed any of his 9 am lectures just for that reason.\nWorkload:\nOne problem set a week. Two mid terms that he gives you your raw score on but claims he has the right to \"tweak\" in the grade book.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "June 09, 2010",
            "review_content": "\nI have to disagree with most reviews here.... \neveryone is always like \"omg my teacher is foreign he cant speak english omg omg\" but i usually end up understanding most of the teachers, no matter what. This is the very first time in ever that I actually couldn't understand a teacher. i feel he cant speak english too well. there were a ton of ppl who were constantly absent, and i found all his lectures very boring, to the poijnt i just stopped going to lectures. EVERYONE, and i repeate, EVERYONE used cramster for the hws. i feel he wasnt a good teacher at all, but in fact a very bad one. hes just a bad lecturer, seriously, you get too bored, cant follow... its so much easier to go back to your room and look on how to do examples. i was surprised about this class. In both mid terms i did about 20 points above the average, and was sure i was gonna get an A. in fact, i had a talk with le, and he told me i could get an A+. i was really pissed when i took the final, and ended up getting a 70, which according to him, was curved. this made me get a B+ in the class. everyone goes \"omg omg 50 % of the ppl get a grade in the A range,\" well, i guess people here are much smarter than i thought, cause i now feel retarded. the final was pretty tough, and i felt very prepared. fuck, i actually didnt go to sleep, i stayed up all night studying (and no, i feel it didnt affect me that i wasnt rested). but w.e., i just wanna say i felt his lectures weere terrible and i wish i had taken one of the other teachers.\noh yeah, btw, a ton of people who failed both mid terms or did bad or w.e. dropped very soon.\nWorkload:\n~ 10 hws, at a point he ll start assigning 2 hws per week, which is a bitch. but seriously, cramster. i was very very very dumb for attempting to not use it, next time i seriously will just copy everytihng straight from that website just like everyone else.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "April 14, 2010",
            "review_content": "\nNam Le is a boss.\nHis curve is fairly generous; 50% get As (including A+'s and A-'s). His tests are straightforward (on the first test he even told us all answers would be from the set: {-10,-9,-8,-7,-6,-5,-4,-3,-2,-1,0,1,2,3,4,5,6,7,8,9,10,pi/6,pi/4,pi/3,pi/2,pi}).\nDo the homework well; it's the best way to prepare for the tests. If your foundation in math, and calculus in particular, is shaky, then show up to class and read the textbook. He allows you to use a cheatsheet for each test. I never found a cheatsheet useful for any of his tests, but I can see how many who did not have such a strong calculus background could find it useful.\nI might be biased since I took multivariable calculus in high school and didn't really need to show up to any of his lectures. I got a 98 in his class...an A+. But even my friends who didn't have such strong backgrounds in calculus found his lectures valuable and his tests fair. \nTAKE HIS CLASS! He's easily the best Calc III professor\nWorkload:\nAbout 10-15 straightforward problems from the textbook per week. The TAs grade them thoroughly. He drops the lowest two problem sets.\n2 midterms and a final. 5 problems per midterm plus a bonus question. It is very much possible to get above 100 on his midterms. The problems on the midterms are roughly the same type of questions you see in the problem sets.\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "February 25, 2010",
            "review_content": "\nNam Le is absolutely excellent - no matter who you are, if you are taking Calculus III, take it with Nam Le. \nHis lectures are straightforward, useful, and (relative to most math classes) not very boring. He has a unique sense of humor and numerous adorable mannerisms that keep the class somewhat entertaining. \nHe doesn't expect anything unreasonable out of students - his tests are all composed of exactly the type of problems that were done in class, he allows you to bring 4 pages of notes per test (6 for final), and all of the answers are always integers from -10 to 10. \nHe also didn't make us learn delta-epsilon theory for the tests, which you will be grateful for.\nI really don't have anything bad to say about Nam Le. He will make your Calculus III experience substantially less painful.\n\nWorkload:\nVery reasonable - weekly problem sets (a little long, but totally doable), two midterms and a final that were all easy if you go to lectures. All tests also offer extra credit!\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "January 23, 2010",
            "review_content": "\nNam Le is a great professor.  He explains the material very clearly and in an interesting way.  He teaches the concepts that are in the book, but often will infuse his own ideas of how some of the material should be looked at, which was really appreciated.  He also told some stories about students he has had in the past or other random bits of information which were funny and made the class worth going to in addition to his great teaching.  The only negative is that he does have an accent that took a little time to adjust to, but once you do, you will be fine for the rest of the semester.\nWorkload:\nReasonable, problem sets each week, but 2 are dropped.  They did become longer as the semester progressed.  2 Midterms and a final, most material on the midterms was easier than homework problems, but he will ask you to apply concepts in ways the homework did not ask you to.  The final was harder than the midterms, but mostly the same material as the midterms.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "May 05, 2009",
            "review_content": "\nNam Le is funny, sensitive, and really cares about what his students are getting out of the class. He moves quickly, but he makes sure that the class always understands concepts before moving on. Open to questions, extremely available and friendly at office hours, and good at explaining concepts, he is worth choosing as a Calc. professor. Also, he starts almost every class with a math joke or funny story.\nWorkload:\nFairly light: weekly problem sets (lowest score drops) webwork every few weeks, 2 midterms, 1 final.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "April 03, 2009",
            "review_content": "\nProfessor Le is one of the sweetest prof i know at Columbia. He really tries his hardest to make his students get everything, and in the exam he doesn't waste time and energy by making us do impossible calculations. He tests the main idea and concepts with relatively easy functions to solve. His class is funny because he tries to keep it lively by cracking jokes. Although he has a strong accent, you can understand everything easily. Plus he writes what he teaches on the board systematically so note taking gets easier. I would highly recommend him for Calc 1. He is a really nice man, and because he is so prepared for what he wants to cover in each lecture, on most days he leaves us about 5 minutes early. He gladly answers questions and doubts in class. He also gives u sample midterms to practice before the actual midterm, and his midterms are based on the samples.\nWorkload:\neasy and manageable. 2 midterms and 1 final (4sides of notes allowed in the exam), weekly hw assignments of roughly 20 problems each week (3hrs), weekly webworks of 8 problems roughly (2 hours). attending his lectures is recommended. nice grader.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "February 05, 2009",
            "review_content": "\nProfessor Le is a wonderful professor. His exams are fair and reasonable. In the first exam, I was a bit thrown off by the last two proof and abstract questions. He usually gives 5,6 questions with 2-4 sub-questions with one difficult bonus problem that counts about 20% extra. Second exam was a lot harder with with another pair of proof /applied abstract questions that were unfamiliar to us (only few students got them right). As long as you do the homework and read notes, it shouldn't be too hard to get an A even though you miss the last two hard questions. He let us bring 4pgs of notes during the test that allowed me to study the materials while I was drafting notes although I never got to use it. \nExams are more straight forward and less complicated (except proofs) compared to other professors'.  \nProfessor Le is very accommodating and friendly. I highly recommend his class.    \nWorkload:\nweekly Webwork(1-2hrs/wk), weekly written homework(2-3hrs/wk), two midterms and one final.  \n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "December 23, 2008",
            "review_content": "\nA really nice guy.  Very understanding and knows what his class needs.  He is a good teacher, bit of a tough accent, and tries really hard to be funny, which is funny in itself.  I enjoyed the class.\nWorkload:\nEasy.  Problem set every week.  Two midterms and a final\n"
        }
    ]
}