{
    "prof_info": [
        {
            "prof_name": "Ouijdane Absi",
            "prof_id": 3585,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Third Year Arabic ",
            "review_date": "November 27, 2016",
            "review_content": "\nOuijdane is terribly unorganized !! This class was unfortunately one of the painful classes I took at Columbia. We usually have a HW that would take 3 hours to finish in the middle of the week and sometimes no HW over the weekend, which can absolutely screw the students who have work for other classes. SHE IS A TERRIBLE PROFESSOR , DO NOT TAKE HER SECTION. \nWorkload:\n4 Hard Exams and a Presentation \n"
        },
        {
            "course_name": "Third Year Arabic ",
            "review_date": "May 04, 2016",
            "review_content": "\nThe first issue is that the assignemnts are not given back on time. The professor takes weeks, and even months, to correct written assignments, preventing effective feedback. She is also not available when students ask to review their assignments and tests with her. \nSecond, the Professor mostly caries out her class in English, rather than in Arabic -even when she is not speaking about grammar, which could be explainable for that case only. This is a major issue, as the course, which fosses on Litteral Arabic, is already not focusing on speaking. \nThird, the Professor skipper 6 classes this semester, for which she did not organize any make up class, and did not give more than a one hour notice when she was absent. \nWorkload:\nArabic takes over your life. The language is worth it. Not the class. Its frustrating to see that you get fluent, but not through the class but rather through your own work aside of class. That should not be happening in a Columbia class shouldnt it?\n"
        },
        {
            "course_name": "Elementary Arabic II",
            "review_date": "May 30, 2011",
            "review_content": "\nOuijdane absolutely deserves the gold nugget. Arabic is a difficult language but she took the time to make sure we really understood what was going on, and because of that my class succeeded in grasping difficult grammatical concepts.  She is friendly, approachable, and down to earth, and I would highly highly recommend everyone who is thinking about Arabic to take her class. It won't be easy, but with Ouijdane you will look forward to coming into class every day.\nWorkload:\nHeavy - Arabic definitely takes over your life. Nightly homework, bi-weekly quizzes, final that is fine if you study. But it's so worth it for such a beautiful language.\n"
        },
        {
            "course_name": "Intermediate Arabic I",
            "review_date": "October 30, 2010",
            "review_content": "\n(Arabic II) I have taken many Arabic courses in my time and have found it hard to get a teacher with enough knowledge of both Arabic and English to help with learning the grammatical rules of this language (an important factor since second year Arabic requires the teacher to be able to explain nuanced points--most likely over and over). Ouijdane (Wijdan) was absolutely perfect for this as she was able to explain these finer points with relative ease and she was even able to provide simple ways to help remember such rules. Always willing to help after class and go over points even after you have forgotten them. \nShe is, however, impatient with unresponsive students in class--so raise your hand and answer questions. Other than that I found her to be pleasant (some found her tough, but usually directly associated with them not participating in class). \nWorkload:\nWork everyday, and since it's Arabic it takes time to absorb. \n"
        },
        {
            "course_name": "Intermediate Arabic I",
            "review_date": "December 26, 2008",
            "review_content": "\nOuijdane Absi is the best thing that can happen to your homework ridden Arabic career.  Her philosophy is that the most important thing is that you improve, and she really means it.  No matter how bad you mess up a test or a homework assignment or even a sentence, Professor Absi never EVER makes you feel stupid.  She just gently corrects you and encourages you to turn in extra credit [which she gives, awesomely].\nOne thing that she does require, however, is that you participate.  So if you tend to be quiet in class, perhaps this is not the one for you.  If you do participate, however, Ouijdane is an incredibly chill and fun professor whose lessons are as clear as her accent [i.e. very].  \nWorkload:\nThis is a five point class.  Don't pretend like you don't know you're in for a heavy workload.  Homework every night - occasionally not before Thursday's section with the T.A.  Four tests, no midterm, final.  Four presentations, four writing assignments, and about two large reading assignments per chapter [Al-Kitaab].  It sounds like a lot because it is, but Ouijdane will help you with any of the exercises and gives thorough feedback on all writing assignments.  \n"
        },
        {
            "course_name": "Intermediate Arabic I",
            "review_date": "December 22, 2008",
            "review_content": "\nOuijdane is one of the nicest people I have ever met. She is not pushover nice -- she's a fair grader verging on tough -- but her sweetness just makes the class that much more fun and makes people want to learn even more. She is always accessible by email and in person, and is literally always willing to meet with students. Some teachers will just meet during office hours or by appointment, but with Ouijdane sometimes the 'appointments' can be just 5 minutes prior and she's still willing to go over things with you. She has a background in linguistics and so knows how to explain things so that they make sense, and she also supplements al-Kitaab with some printouts and things that make much more sense and help us to practice certain grammatical points more. She is just so much fun and she really makes Arabic fun too, which is nice because second year can be kind of tedious and tiresome, but with Ouijdane it's always exciting! I am very excited to take her again next semester, and I would highly recommend her to anyone at Columbia.\nWorkload:\nDepartmental syllabus, standardized bi-weekly tests, some extra assignments that aren't graded and are just for our benefit, and she breaks up the long presentation into four shorter ones. Standard Arabic homework craziness each night, but because it's the second year it's more manageable.\n"
        }
    ]
}