{
    "prof_info": [
        {
            "prof_name": "Tyler McCormick",
            "prof_id": 6367,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Statistics (A)",
            "review_date": "August 14, 2009",
            "review_content": "\nGreat class, nice guy, lots of work but fair.  I thought I would hate having a quiz every week but they're really straightforward if you've read the book and done the homework, plus they're open notes.  The project is a really cool addition to the course and Tyler does a great job helping you and gets really excited if you go talk to him about it in his office.\nClasses also are also a mix of lectures and working problems in small groups or doing other activities.  The lecture portion is really clear, but Tyler's style is pretty relaxed so you can ask questions.  Several times he posted links to things in the news or studies that were related to what we were talking about, which makes the material seem more relevant.  Working problems in groups in class is different, but works for a class like this where solving problems is so important for the material.\nOverall, if you need to take statistics, I would definitely recommend waiting until Tyler is teaching.  I went in thinking the class would be boring, but now I think statistics is actually kinda cool.\nWorkload:\na couple of exams, quizzes once a week, project\n"
        },
        {
            "course_name": "Introduction to Statistics (A)",
            "review_date": "August 02, 2009",
            "review_content": "\nThis guy is a grad student, which usually raises warning flags for me...especially in math/science related classes.  Honestly, though, Tyler is one of the best teachers I've had at Columbia.  It is obvious from the first day that he has things organized and that he's put alot of thought into how to make the class relevant to as many people as possible.  His lectures are clear and he tries to be funny (sometimes successfully).\nHe had to leave for a couple of weeks near the end of the semester for some kind of family emergency.  It disrupted the flow of the class, but I think he did the best he could given the circumstances and he had lots of extra office hours when he got back to try to catch up, which was nice.  \nWorkload:\nIf you're good with math, then it won't be too intimidating and many of the assignments are actually kind of interesting.  If you're not used to solving HW problems pretty regularly, though, it might be a little tough.  \n"
        },
        {
            "course_name": "Introduction to Statistics (A)",
            "review_date": "July 31, 2009",
            "review_content": "\nGreat class.  Tough but worth it.  Take this guy for statistics if you possibly can.  Much better than just an average intro class.\nWorkload:\nA little more than average but all outlined on the syllabus at the very beginning so you know what to expect.\n"
        },
        {
            "course_name": "Introduction to Statistics (A)",
            "review_date": "July 31, 2009",
            "review_content": "\nTyler is awesome.  I really wasn't looking forward to taking statistics but after taking Tyler's class I can actually see why he gets so excited about it.  He did a great job making the material relevant and trying to keep people motivated.\nHe's also very clear and patient with non-math people, like me.\nWorkload:\nThe class is a fair amount of work.  Quiz every week, project, mid-term, final.  Quizzes every week force you to keep up so studying for midterm/final is less of a big deal.\n"
        },
        {
            "course_name": "Introduction to Statistics (A)",
            "review_date": "July 23, 2009",
            "review_content": "\nThe course syllabus and the grading curve that Tyler uses is, in my opinion, a little misleading . You need to develop two study styles to get through this class with a good grade, one for the homework/quizzes and one that allows you to manipulate the material with ease.\nThe are many components to this class, this is the misleading part because the level of understanding you need is completely different for the quizzes compared to the midterm and final. I was surprised at the level of difficulty of the midterm after feeling that they understood the material based on his quizzes. This course is basically curved on the two exams. After people realize that the quizzes are mostly homework questions and you can bring your notes/homework, the standard grade on them is 10/10 - this grade, the lab grade, and the project grade (which we put SOO much time into), is (based on the curve) cancelled out from your final grade because everyone does well on them. The quiz grades and the project grade won't help even out your grade, but you must do well/perfect on them.  Make sure you know the material inside and out for the midterm and final, the questions are more theoretical and require more than knowing the mechanics of a problem.\n Suggestion to Tyler: level the playing field with quizzes on par to the level of difficulty to the exams.Tyler is really nice and willing to help. I just wish we were more prepared for his exams. We were not given problems that were of the same style in our preparation for the exams. \nOne last comment, I had a hard time grasping the overall concept of the class until the last couple of weeks, I think it's the way the course/book/statistics is laid out. Tyler did give us a diagram that explained the overall picture during the first class, but for someone who never took a stats class before it took a while for it to sink in.\nWorkload:\nAll of the components of the class keep you on your toes. I did the most work in this class than any of my other three classes. About two chapters a week, weekly homework and quizzes, four computer labs, a midterm, a final project, and a final.  \n"
        }
    ]
}