{
    "prof_info": [
        {
            "prof_name": "Vesna Bogojevic",
            "prof_id": 9578,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Literature Humanities",
            "review_date": "December 10, 2013",
            "review_content": "\nI loved taking LitHum with Vesna. I found her to be very warm and welcoming. She runs a relaxed class and has a sense of humor, which was very refreshing at the end of a long day, let me tell you. The class discussions were mostly freeform, but she usually made sure to get through a series of key points for the text as well. I thought she struck the perfect balance between letting the students talk and taking time to comment on the discussion and offer her own thoughts. \nOthers in the class felt she was a tough grader, and that may well be true, but I did well in her class. If you come to class prepared, stay alert throughout the session, and meet with her outside class if you want to discuss your written work, you ought to be fine.  If you attempt to skate by, you'll probably run into trouble. \nIf you have Vesna for LitHum you are in good hands.\nWorkload:\nPretty standard. A couple papers (though only one in the second semester, with class presentations added in place of the other paper) and three discussion question assignments throughout the semester. A perfectly reasonable midterm. And the final, of course. \n"
        },
        {
            "course_name": "Literature Humanities",
            "review_date": "December 28, 2012",
            "review_content": "\nAlthough she may seem strict at first, Vesna is actually an incredibly easygoing teacher. At the beginning of the year, each member of the class had to schedule an appointment to meet with her and discuss our expectations for the class. I forgot to show up twice and both times she rescheduled with no complaints. She's very amiable and has a good sense of humor, even when students challenge her authority.\nWhen it comes to essays, she doesn't give out many As. I'd recommend meeting with her during office hours to discuss your idea for the paper, as you may lose quite a few points if she thinks your thesis is too obvious.\nThe midterm is fairly easy. If you've done the reading, you won't need to budget much time for studying. If you haven't done any of the reading, you will have a miserable week before the midterm and another miserable one before finals.\n\nWorkload:\nNo weekly assignments besides the reading. Two major essays, a midterm, and a final. Participation is part of your final grade so make sure to get those points.\n\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 15, 2011",
            "review_content": "\nExtremely difficult. Rude and passive-agressive. Seems annoyed to be in the class and appears to be someone who teaches simply to satisfy some degree. She just has a cold personality to her reminiscent of a hybrid of The Grinch Who Stole Christmas and Famke Janssen in Goldeneye that will often leave you afraid to approach her, email her, or participate. \nA harsh grader, riddling your drafts with unnecessary comments. She often will find a dozen different ways to criticize the content of your drafts (i.e. vague, truism, makes no sense, not really, consult Hacker),saying that your points are illogical and too much of a stretch for the sources you choose as evidence. But with this being a class where your often extrapolate and make inferences about authors of the works she gives you, you will often be left frustrated and in a lack of accord with her comments, which seem totally (again) unnecessary and stupid. However, her assignments are pretty clear and if you meld your papers and act like you actually agreed with her criticisms and made an effort to correct them, you can do fairly well in the class.  \nWorkload:\nAn annoying plethora of assignments and readings, where you will be left with most of your quota consumed in printing her readings. Drafts, and essays ranging from 5 to 10 pages. A sense of emptiness and depression is typical.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 24, 2010",
            "review_content": "\nPassive-aggressive. Difficult. Not a great communicator.\nOn the bright side however, her assignments are EXTREMELY straightforward. Her essay topics are not difficult. But her grading is harsh (EX. Overall, good job, B-) and her comments seem to be superfluous (ex. Don't forget, the period goes at the end of the sentence)\nShe is not easy to deal with unfortunately, but I'm not a great writer and I ended up with a decent grade. Then again, I worked really hard.\nA draft will be due on Thursday, the comments will come back on Saturday, and a final paper will be due on Tuesday.\nWorkload:\nA paper every 2 weeks ish?\n"
        }
    ]
}