{
    "prof_info": [
        {
            "prof_name": "Robert Shapiro",
            "prof_id": 2579,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Analysis of Political Data",
            "review_date": "May 03, 2012",
            "review_content": "\nI am a political science major who decided to take 3704 and 4911 because I was frustrated at being unable to understand SO many political science articles I read in my other courses. I asked one TA, what were these stupid charts and why was I supposed to believe what they were saying? He encouraged me to take one of these course and I haven't regretted it since. \nIf you are interested in learning this voodoo magic--which is really linear regression or as economists call it econometrics--read this review. I have taken three of these courses and am writing this detailed review because I would have benefitted from something like it a year and a half ago when this adventure started. I've taken POLS W3704y Data Analysis & Statistics for Political Science Research with Professor Shapiro, POLS W4911y Analysis of Political Data also with Shapiro, and POLS W4912x Multivariate Political Analysis with Shigeo Hirano. All of these are applied econometrics courses in the Political Science department and it can be tough to tell them apart and decide which to take. \nREVIEW OF PROFESSOR SHAPIRO\nProfessor Shapiro is a fantastic teacher. Applied econometric analysis of political and economic data isn't really something that is easy to get excited about, but by God if anyone can get students excited about the subject, it is Robert Shapiro. The quintessential problem most teachers of math/statistics have is that they simply cannot reach across the intellectual aisle to those who would rather write a composition than do a problem set. Professor Shapiro shows an uncanny ability to communicate this material to students and to get them excited by the incredible intellectual fire power that linear regression can give. \nShapiro strikes the perfect balance between teaching the concepts behind the assignments and providing students with the tools to do the work in Stata. All the while he is funny and gladly engages with students. You can tell he gets real joy from teaching, which is a pleasure to see. \nREVIEW OF 3704/4910\nFirst, I want to point out that 3704 Data Analysis & Statistics for Political Science Research and 4910 Principles of Quantitative Political Research cover the EXACT same material. The only difference is that 3704 is offered in the Spring and only open to undergrads and that 4910 is offered in the fall and open to undergrad and grads (mostly SIPA students, but also poli sci master's and PhD students). So take whichever fits your schedule. \n3704/4910 is an introduction to empirical research in the social sciences, basic statistics, ordinary least squares, and how the heck to use Stata. It definitely isn't an exciting course and if you aren't interested in learning the material you will probably get bored. But, if you want to learn how to empirically study politics, economics, and social phenomena through data, this course is THE BEST introduction possible. Pay attention and you will reap the benefits. If you have this desire and get into the material, you will come to see why the professor is so excited about it. \nREVIEW OF 4911\nThis is where you get down and dirty and learn applied econometrics. You will leave this course with a mastery of Ordinary Least Squares regression and a solid understanding of Logit/Probit, Instrumental Variables, Two-Stage Least Squares, time series analysis, heteroskadicity, and serial correlation. Those are the main tools in economics and quantitative political science (barring game theory and a few other tricks) and you will be able to read articles that use them and use these tools in your thesis (if you want to do one taking this course is a really, really good idea). \nADVICE ON HOW TO DO WELL IN THESE COURSES\nNow, if you don't actually care about learning the material (maybe your an econ-poli sci major and you are taking this because it is easier than intro econometrics in the Economics Department) you can easily just mindlessly plug in the Stata instructions for the reports. You'll probably get a B or B+ but you won't learn a damn thing. If that is your goal, then you can accomplish it here. \nHowever, that really isn't and shouldn't be the point. You will find these classes miserable if that is your MO. \nIf you want to learn the material and get and an A or A- (and be able to use and understand econometrics better than your friends in Econ) then here is my advice: (a) go to every lecture and take good notes because Shapiro gives you the answers in plain English during class to the questions you will invariably have when writing the report and (b) START THE REPORTS EARLY and do the reading while you do the report. By this I mean, as soon as you get the report assignment, read it over and then read the relevant section in the textbook so you understand what's going on. As you work through the paper, consult the text book. (Essentially, don't try and read the book and then do the report...) \nThe reports take WAY longer than you think and there are a total of 5. Nothing that is really rocket science, but they are tough cookies. I didn't take my advice a lot of the time and wound up working exclusively on them for 24-30 hours before each was due. Doing that blew and I didn't learn as much as I could have. So start early. \nA NOTE ON THE TEACHING ASSISTANTS\nAlso, definitely feel free to ask the TAs for help -- I've taken two courses with Professor Shapiro and they are always awesome. My theory is that the TAs are awesome because Professor Shapiro makes it so. My hunch is that because Shapiro grades all the reports himself and that the deal is that the TAs have to help students a lot -- over email, in office hours, etc. This is amazing. Stata is a messy beast that can make you want to bash your head in, so being able to email the TAs and essentially ask \"huh?! What do I do??\" is really helpful. \nA NOTE ON THE TEXTBOOK\nThere are oodles of econometrics textbooks. I've used Wooldridge, Greene, Studenmund, and a load of random website, pamphlets, PDFs. Skip all the pain and just buy a used copy of Studenmund's \"Using Econometrics.\" I bought an old edition for $10 and it only didn't include one non-essential chapter that Shapiro assigned. Most importantly though, you can actually understand Studenmund without being a math person, which is simply not the case with Wooldridge and Greene. Studenmund gives you a good handle of what the heck is going on and will allow you to make sense of what you are actually doing in Stata and how to interpret that in your report. \nBEWARE OF 4912\nIf you haven't taken and done well in Calculas I and taken Linear Algebra, simply do not take 4912 with Hirano. It it uses two text books: you cover ALL the material from the undergraduate probability course in the statistics department and use the textbook that the economics PhD students use in their three econometrics courses (Greene). So essentially two hardcore quantitative courses in one. It is simply too much material for one semester and it is taught by a real \"math\" guy: Hirano has real difficulty teaching this material in a way that most students easily get and he spends most of his time frantically scribbling equations at light-speed that very few of the students understand. Unless you have a very good foundation calculas, statistics, and linear algebra, don't take 4912.  \nCONCLUSION\nHonestly, 4910 and 4911 are some of the BEST courses I've taken as an undergrad: they are taught by a teacher (instead of lectured by a researcher), I learned a real practical skill, I learned what empirical social research really means, and sort of fell in love with the idea (if not the slogging practice of) applied econometrics. Honestly, if you are debating between the intro econometrics course in the Economics Department and these, I would really recommend 3704/4910 and 4911. \n\nWorkload:\nAssigned readings that you don't have to do but would benefit from doing. 5 pretty grueling reports where you report your statistical tests and then analyze them. They each take a good bit of work and time, so get a start on them early! \n"
        },
        {
            "course_name": "Analysis of Political Data",
            "review_date": "April 30, 2012",
            "review_content": "\nA phenomenal class, as I knew it would be.  Professor Shapiro's teaching style is ultra-accessible.  He comes off as comfortable with the material and, crucially, projects that feeling onto the students (whereas some professors speak very informally about quantitative subjects but all it does is wall them off from students who struggle to grasp the quantitative intuition).  It's tough to explain, but I just genuinely enjoy being in the room when he's teaching.  Favorite class ever (and I'm not otherwise quantitatively inclined).\nThe real strength of this course is in its structure.  The material is tested with five 5-page papers.  There's no midterm or final or obnoxious busywork problem sets.  \nFor the people who are terrified of papers: Relax. It's not open-ended.  He gives a handout that walks you through the STATA procedures for each of the techniques required for the paper.  You get to come up with your own theory of interest, find the variables, he basically tells you how to crunch the data, and then you interpret it.  \nFor the people who will then say that one doesn't learn anything when one is told how to do it: You are wrong.  I will bet you eighteen trillion dollars that I:\n1. Have a better mastery of statistics from Quantitative Political Research and Analysis of Political Data than you do from studying for your final exam.  \n2. Can better translate that mastery into the corresponding STATA commands so as to use statistics in the real world.\nWorkload:\nFive 5-page papers.  A healthy reading list that you can safely ignore for the papers as long as you find yourself understanding everything that's covered in lecture. \n"
        },
        {
            "course_name": "Quantitative Political Research",
            "review_date": "January 03, 2009",
            "review_content": "\nI'm a Polisci-Econ major and I had the choice of either taking POLS 4910 or the STAT class. TAKE THIS ONE! I've heard many horror stories about the stat class (to be fair, horror stories often accompany math classes.) This class was GREAT! It's not all that interesting - but if you're a polisci-econ major, it's VERY useful. You learn how to apply statistics to political science - you learn how to use STATA which is a great program for those who want to quickly find out if particular political hypotheses can be supported empirically. Professor Shapiro is a really nice guy, he lectures well. \nWorkload:\nNot bad at all. No reading. SERIOUSLY. But make sure you keep up with the paper assignments (there are five) and he says you can hand them all in at the end of the semester. They take a lot of time - they're not hard, just time consuming. So don't be stupid and procrastinate until you're writing all five the night before. It's not fun, trust me.\n"
        },
        {
            "course_name": "Quantitative Political Research",
            "review_date": "January 03, 2009",
            "review_content": "\nI'm a Polisci-Econ major and I had the choice of either taking POLS 4910 or the STAT class. TAKE THIS ONE! I've heard many horror stories about the stat class (to be fair, horror stories often accompany math classes.) This class was GREAT! It's not all that interesting - but if you're a polisci-econ major, it's VERY useful. You learn how to apply statistics to political science - you learn how to use STATA which is a great program for those who want to quickly find out if particular political hypotheses can be supported empirically. Professor Shapiro is a really nice guy, he lectures well. \nWorkload:\nNot bad at all. No reading. SERIOUSLY. But make sure you keep up with the paper assignments (there are five) and he says you can hand them all in at the end of the semester. They take a lot of time - they're not hard, just time consuming. So don't be stupid and procrastinate until you're writing all five the night before. It's not fun, trust me.\n"
        }
    ]
}