{
    "prof_info": [
        {
            "prof_name": "Milena Jelinek",
            "prof_id": 374,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Script Analysis",
            "review_date": "January 09, 2007",
            "review_content": "\nThis is the worst class I have had to take as a film major and it is required.  I learned nothing I couldn't teach myself from skimming McKee's Story.  And it made me hate cinema.  Sorry.\nWorkload:\nMidterm paper and final paper, virtually no reading.\n"
        },
        {
            "course_name": "Script Analysis",
            "review_date": "February 08, 2005",
            "review_content": "\nI regret not having written a review earlier, since I would like to help keep as many people as possible from taking this class.\nFortunately some of my peers have done an excellent job in reviewing what surely is the worst class in the film department and possibly in the entire undergrad directory.\nThe irony: this highly unstructured class is supposedly about story structure.\nKeep away from this course at all cost.\nSadly for film majors, this is required and you cannot escape Jelinek's arrogant and empty lectures. Hang in there, and do not expect to learn the basics of screenwriting here. \n\nWorkload:\nDo not let the 2 paper workload fool you: it will take a lot of work for you to figure out what is expected from you, and when you do you will get a B - if you're lucky \n"
        },
        {
            "course_name": "Script Analysis",
            "review_date": "November 04, 2004",
            "review_content": "\nFOR THE LOVE OF GOD,  DO NOT TAKE THIS CLASS. It is quite possibly the worst class offered at Columbia. \nWorkload:\nTake-home midterm for undergrads. Take home final for all.\n"
        },
        {
            "course_name": "Script Analysis",
            "review_date": "December 10, 2002",
            "review_content": "\nThere really aren't enough bad things you can say about this class--it is easily the worst class in the film dept. and an embarassment to Columbia in general. You will learn absolutely nothing about writing scripts that you couldn't have learned from any cheesy \"how to write a film in x days\" book. It's made all the more disappointing by the fact that Jelinek is supposedly an actual screenwriter. However, she touches on nothing practical--the physical format of a script, directing your own script, how to know what ideas to pursue, how to sell a script, how to make a script marketable, etc. Instead, she rehashes three-act structure (again and again and again), and ends each film by asking who the protagonist and antagonist are. Even more unfortunately, the class takes roll, and the idiot film dept. TA's grade the papers.\nWorkload:\n2 papers. Readings assigned weekly, but they are completely unnecessary. Don't even buy the books.\n"
        },
        {
            "course_name": "Script Analysis",
            "review_date": "December 31, 1999",
            "review_content": "\nEveryone wants to write a successful screenplay, right? Well, don't be looking to Jelinek for any real insight. She basically outlines the same structural guidelines repeated and modified in all the classic books. If you want to experiment with the standard spiel, look into taking a grad class on screenwriting. If you're a major, you have to take this anyway, so sit back and enjoy her lovely accent and eclectic screening choices. All others, just buy a Syd Field book or something. Hell, buy the syllabus and take something else.\nWorkload:\nSupposed readings, but unnecessary. Midterm paper and final paper.\n"
        },
        {
            "course_name": "Script Analysis",
            "review_date": "December 31, 1999",
            "review_content": "\nJelinek has perfected boredom. Her delivery is rote. One is better off reading the required texts. It is imcomprehensible that our parents pay so much money for an Ivy League education, and instead get an Ivy League bill and a boring intsructor. One can find more interesting teachers in the local learning annex. It is absolutely mind boggling to have to sit in front of someone who merely repeats the bold lines of the text that is issued. One is better off paying the twenty bucks for the text and not taking the course.\nWorkload:\nCourse load is not high, but like in all film classes the students are graded by grad students who for the most part have taken less film courses than you have! In fact, I had one grad student who was in the same introductory course that I was in, and this individual, with limited knowledge was grading our papers... Unreal!\n"
        }
    ]
}