{
    "prof_info": [
        {
            "prof_name": "Aili Flint",
            "prof_id": 453,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "The Kalevala, Kanteletar and Finnish Poetry",
            "review_date": "September 06, 2007",
            "review_content": "\nI loved this class and this professor. Aili (as you will come to call her) is easy going, interesting, witty, and slightly nuts. She is able to relate the Kalevala (and if you don't know what it is, that's okay; she will have you raving about it within a month) to all things Finland, yet she is able to make the Kalevala interesting for the Kalevala's sake alone. She is keenly interested in the background and experiences of her students, and tries to draw on these as much as possible during the course of classroom discussion. The class tends to small, intimate and fun.\nWorkload:\nTwo papers, one of which will be very long (though she is never specific on pages) at the end of the semester, plus mandatory participation in the Kalevala Marathon (reading a poem in a language of your choice, English included). Class participation is mandatory.\n"
        },
        {
            "course_name": "Elementary Finnish 1",
            "review_date": "July 09, 2006",
            "review_content": "\nAili is very nice and cheerful. The class is very comfortable and relaxed, and because itÂ’s small (we had 6 people first semester and 4 second) Aili will tailor how fast you move and what you cover to fit your needs and interests. You also talk a lot, but thereÂ’s no pressure as in other language classes because you do it so often and the class itself is so low-key. (No silly skits either!)\nAili is very good at explaining grammar (theyÂ’re a lot of rules, but theyÂ’re straightforward and are very few exceptions). My one complaint is that because Aili is so relaxed, you really have to work on your own to memorize vocabulary (we never had a single vocab test all year). \nOverall, a great class and highly recommended!\n\nWorkload:\nGrammar excercises, a couple of recitations of poems, one test, midterm, exam. She's very flexible about deadlines and you can basically do the excercises at your own pace. She also consults you about what should be on the tests.\n"
        },
        {
            "course_name": "Elementary Finnish 1",
            "review_date": "December 27, 2004",
            "review_content": "\nFirst of all, Prof. Flint is just about the nicest, most cheerful people you'll ever encounter at Columbia. Class with her is often such silly fun, you'll be amazed by how much you're actually learning. She's a fabulous teacher who clearly loves what she does, and the class is like a cozy little family by the end of the semester.\nSpeaking of which, this is another great reason to study Finnish: because it's so obscure, the class is always small and everyone there is genuinely interested in learning the language. If you're sick of zombielike freshmen in your full-to-capacity Spanish class, then Finnish might be the place for you.\nNow, Finnish is supposedly insanely difficult, but seriously, it's not that bad. Grammatically, it's very complex and  unlike anything you're likely to be familiar with, but trust me, with Prof. Flint explaining everything, it will all make sense. And anyway, you get the vaguely exotic, or at least very nerdy, cachet of studying an obscure (and, I might add, cool-sounding) language that was one of Tolkien's inspirations for his Elvish languages. Even the simplest phrases are bound to impress your friends far more than some French or Japanese or Latin ever would.\nThis class is doubly fabulous if you are a linguistics nerd like me; the structure of Finnish is totally fascinating AND Prof. Flint will gladly chat with you about linguistics or etymology or grammar anytime. \nWorkload:\nA decent amount of work, but it's not hard. And she'll never give you a death stare for turning work in late.\n"
        },
        {
            "course_name": "The Kalevala, Kanteletar and Finnish Poetry",
            "review_date": "September 18, 2004",
            "review_content": "\nMs. Flint's class meets in a small room engorged on all sides with books on anything Finnish. She greets you will a smile, parts with you with a smile and keeps the entire length of class as interesting as any class I've ever had thanks to her bubbly personality. I knew nothing about Finland beyond that it was one of those countries up north before. I'm no expert now, mind you, but I know the national epic, the Kalevala, through and through and am looking forward towards a trip to Finland when my finances will allow it. There is no single class I would recommend more highly, nor any teacher I have ever enjoyed and learned from quite as much than this Kalevala class, taught by Prof. Flint. It was the best thing that has ever happened to me at Columbia. (Except that one time at the West End, but that's another story...)\nWorkload:\nDon't be completely fooled... you will be doing a bit of reading for this class. But NONE of it will be forced upon you because it will be extremely interesting and you will read the material at every spare moment you get. Besides that, there's about three or four small one-page reviews of concerts and films you will have to submit and a final paper, which can be about ANYTHING Finnish whatsoever that inspires you. Pretty doable, people. And can I emphasize, again, enjoyable?\n"
        },
        {
            "course_name": "intro to finnish culture",
            "review_date": "February 03, 2003",
            "review_content": "\nvery flexible class, no prior background needed, interesting. aili flint has energy and enthusiasm. not a hard grader.\nWorkload:\nfair to moderate. \n"
        },
        {
            "course_name": "Finnish",
            "review_date": "September 03, 2002",
            "review_content": "\nListen to me: I know it sounds useless, I know it sounds random, but Finnish is the best thing that will ever happen to you. You will get an A (4 points of it!!), your workload will be nearly optional (although its fun stuff and you'll learn a lot from very little of it) and you will have the time of your life. Prof Flint runs class like an 18th century intellectual salon meets pee-wees playhouse: intimate, friendly, engaging, but also silly and fun. Also by \"class\" I mean you and like two other people, since its always small. Talk about personal attention. Time spent with Prof Flint is always a pleasure-- the woman has charisma like you have no idea-- and you'll learn as much about linguistics and culture as you will learn of the language itself. This isn't your average dumb language class of rote memorization and acting out idiot skits based on text book suggestions for an angry grad student. It's literally Columbia's biggest and best kept secret.\nWorkload:\nSimple, easy, useful stuff. You could hit this ball out of the park with a piece of kindling. \n"
        },
        {
            "course_name": "The Kalevala",
            "review_date": "December 31, 1999",
            "review_content": "\nAili Flint is, essentially, Columbia University's Department of Finnish. Though her classes are technically grouped into the German Department, Finnish isn't even in the same language family as German. Aili teaches Finnish at Columbia, as well as a class on the Kalevala and Kanteletar, which are two fundamental works of Finnish folk mythology. Sound random and strange? It is. It's also one of the most thoroughly enjoyable and engaging classes I've ever taken. The reading material is fascinating, and you also get a fair serving of Finnish cultural and political history, which is presented with a great deal of verve and enthusiasm by Aili Flint, who is both personable and demanding in the classroom. If you're looking for an entertaining class to fill out your senior schedule, and have any interest in mythology, folk-tales, or Scandinavia, this is the class for you.\nWorkload:\nIn the Kalevala class you read one English translation of the Kalevala, which is an epic poem the length of a short novel, and also read translations of the Kanteletar, which is a collection of finnish lyric folk poetry. One paper or final project at the end of the class, which doesn't have to be a paper, since Prof. Flint is very flexible. Light weekly reading assignments and a couple class presentations on a related topic of your choice. Not alot of work, and what there is is always engaging.\n"
        }
    ]
}