{
    "prof_info": [
        {
            "prof_name": "Lorenzo Buonanno",
            "prof_id": 9447,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 01, 2015",
            "review_content": "\nIf you’re looking at this review, it’s probably because you were placed into Professor Buonanno’s section. Lucky for you, Lorenzo is one of the best professors the core has to offer. He emphasizes visual analysis over rote memorization. Although participation is factored into your grade, he never forces students to speak and instead prefers natural discussion. He will entertain any question and will never mock a student’s interpretation of a work (no matter how ridiculous). Perhaps his best trait is his ability to keep the course material relevant--he incorporates pop culture references and contemporary issues into the discussion using his quirky sense of humor. Overall, I found his ArtHum section to be both informative and enjoyable. I never missed a class (even when I had mono).\nWorkload:\nYour grade is broken down as follows:\nClass participation\t\t15%\nComparison Essay (4-5 pages)\t15%\nMidterm Exam\t\t\t20%\nFinal Essay (7-8 pages)\t\t25%\nFinal Exam \t\t\t25%\n\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 21, 2010",
            "review_content": "\nLorenzo was a really good instructor. Instead of making you memorize every single name of paintings and other works seen in the course, he focused on skills which are actually useful in real life, such as visual analysis and identification of features. He was very open to participation - though sometimes the consequence was that students made unrelated comments - and provided very detailed feedback. Globally, it is was an enjoyable experience and I definitely learned a lot. Although I was already interested in art - which wasn't the case of all students - now I can understand them within a certain framework, so I'm glad the next time I go to a cocktail party I will look smarter.\nWorkload:\nAverage: one essay about visual analysis and comparison (unmarked), one about architecture, one about comparing two painting styles, and one final paper on basically any theme, all between 4 and 5 pages. A midterm and a final composed mainly of analysis and comparison.  \n"
        }
    ]
}