{
    "prof_info": [
        {
            "prof_name": "Kara Pham",
            "prof_id": 5970,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Hormones and Behavior",
            "review_date": "May 11, 2012",
            "review_content": "\nThe hormones class provided  a good overview - Shit is ALL memorization - There are no hard concepts, it is literally memorizing every single thing that comes out of her mouth (Don't even buy the book, you don't even need to look at it, although she will tell you that tests cover the book also - They absolutely do not) - You're up against Barnard girls who memorize shit for a living, and there's barely a curve, so average ends up being around a B - Take it P/F if you're interested in learning about the endocrine system, and if your not, don't bother taking the class because while it is easy material, it is tough to do really well in the class without putting in a good 7-10 hours before a test to memorize all the shit she has ever said.\nThat being said, she does present the material in a format that is quite conducive to consumption, so I'll give her that - She just tests on minor little facts that you either have memorized or haven't\nWorkload:\n2 midterms and a final - They are all non-cumulative (for the most part) - Just on class material, NOT THE BOOK (Don't listen to her)\n"
        },
        {
            "course_name": "Hormones and Behavior",
            "review_date": "September 11, 2009",
            "review_content": "\nI really loved this class. This class was my first psych class beyond intro and Professor Pham made it so easy to understand. She is great at breaking down complicated processes and topics and really makes sure everyone gets it. She is also very nice and approachable. I didn't really like the book, which was much more technical than the lectures. Also, the tests directly reflected lectures rather than the textbook. She also sends the grade distribution for each test to everyone in the class. I would definitely recommend taking a class with Professor Pham, especially if you are nervous about more bio-related psych classes.\nWorkload:\n3 tests. all really easy if you attended lecture. \n"
        },
        {
            "course_name": "Hormones and Behavior",
            "review_date": "May 13, 2009",
            "review_content": "\nProf Pham is a good lecturer. She has powerpoints that she uploads on a regular basis, test review sheets and her tests can be challenging but she never aims to trick me. Pham does a good job not overcomplicating endocrinology and presents these things in a pretty straightforward manner- she's always available outside of class, email,etc, and on another note, she's pretty adorable. She'll talk about her sister and her kids a lot and it's definitely a refreshing class to take in the morning. The one complaint i have about her is that she answers too many questions during class. Bad thing? Yes, as half of these questions were just straight up stupid \"Q: Can 14 year olds get pregnant? her answer: Yes Q: But....why??\". There are also people who stand up, put their bare feet on their desks, sprawl on the floor, readjust the sports tape on their legs loudly god knows what. Although i'm sure the class was just filled with a bunch of interesting characters this semester...and I had the unfortunate chance of taking it with them...i wished Prof Pham said once in a while 'Ask me after class' or 'Put some shoes on'\nWorkload:\nThe textbook is a pretty easy read. Pham tells you specifically what pages she will not test you on, which is always nice.\n"
        }
    ]
}