{
    "prof_info": [
        {
            "prof_name": "Colette LeRoux",
            "prof_id": 11228,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "May 17, 2014",
            "review_content": "\nColette is an extremely sweet, easy-going professor who makes ArtHum actually enjoyable. From the start of our class, she made it clear to us that she views ArtHum as a language course. In other words, she wants us to develop a vocabulary in art and be able to discuss art. For this reason, as previous reviewers have mentioned, there is no memorization required (although she will ask you to identify certain pieces on the midterm, I got a few wrong and was only penalized by a single point in each case). Class participation is probably the most important part of your grade, and what you will be focusing on doing for most of the semester. She barely assigned reading (maybe three articles that I can remember), only had us do one paper early in the semester, and gave us an oral final only because she was required to give a final exam. There was barely any work for this class yet I definitely learned something despite having a background in art history (took AP Art History in high school, considering majoring in it). She makes the classroom environment one where you want to participate and brings in some art and perspectives that aren't on the syllabus to make things a bit more interesting. She's great at contextualizing paintings and bringing in a variety of analyses of them. Colette knows her stuff well and is also a great teacher - I highly recommend her to those who have not yet taken the course.\nWorkload:\nAttendance and participation are mandatory (25% of the grade). On the syllabus, she had written that we would be writing two short (1-2) page papers but she only ended up assigning one of them (20%). We also had a written midterm which was graded fairly leniently (20%). Two museum visits with the class during the nicer weather at the end of the semester and one individual museum visit with a 500-word post online about how the curation of an object impacts how we see it (10%). Final group project at the end of the semester where you create a museum space around a theme and bring in 10 objects. You have to give a presentation on it in class and write a bit, but nothing too excessive and she gives you a lot of time to work on it. Then, during finals week, she had us come in and do an oral final where she more or less asked us to talk a bit more about how and why we chose certain pieces for our project and then asked us what we did and didn't like about the course (project and oral final are together 25%). Overall, light workload for ArtHum - a class with light workload to begin with. Very manageable and enjoyable.\n"
        },
        {
            "course_name": "Masterpieces of Western Art",
            "review_date": "January 21, 2014",
            "review_content": "\nI dont understand why Professor LeRoux does not have any more reviews than this, she is amazing! She does not require you to memorize any dates, paintings etc. As she views memorization as useless. She is very approachable, has an interesting teaching style and does not assign too much work. As long as you put a little effort into this class and participate in the class discussions(very important), this should be an easy A. I dont normally like art classes, but I loved this one because of LeRoux!\nWorkload:\nExtremely fair. She assigns a couple of short readings for each class, one museum visit, one cathedral visit, two short papers, one midterm, one final. As long as you went to class and looked over the readings you should be fine.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 05, 2011",
            "review_content": "\nColette was awesome.  She has a great lecture style, good comments, and very relaxed.  I learned a lot about her course and the best part about it was that she de-emphasized memorizing useless facts like specific dates.  She cares more that you understand the time period that the artwork is in, which to me is much more important when it comes to comprehending and interpreting a work of art.  She was a fair grader.  I guess I wouldn't call her an easy grader but as long as you know how to write an organized paper, she's completely reasonable.  I really enjoyed this course.\nWorkload:\nA few tiny tiny assignments, 3 art critique papers and 1 museum visit paper, group class-led discussion, midterm, final project and oral exam based on the project.  I didn't have to spend too much of my week on this course.  It was very leisurely.\n"
        }
    ]
}