{
    "prof_info": [
        {
            "prof_name": "Clement Hongler",
            "prof_id": 10930,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Analysis and Optimization",
            "review_date": "May 16, 2014",
            "review_content": "\nPros: I actually ended up enjoying this class.  You learn some neat theorems and basic analysis for optimization problems, and by the end I felt very knowledgeable on the topic.  After all of the math and stats professors that I've had at Columbia, Hongler has definitely been the best - both personality/approachability wise, and teaching wise.  I always sat in the front row so I could laugh at his jokes and ask questions when I was lost (which was rare, because he explained things well, drew graphs, used examples).  \nCons: The main con was the homeworks.  They tended to be long with several proofs.  He also sometimes introduces some new theories and techniques in them which he expects you to know for the exams.  I just went every Friday to the TA's office hours (*they have the homework solutions*) and tried to work out the problems as a group.  I definitely felt more comfortable with the material after doing them.  Also, there are a lot of theorems, but they all kind of make sense / extension of derivative/tangent line stuff we did in calc.  \nAlso don't even bother using the online textbook he links to - its honestly useless.  I never looked at it.\nWorkload:\nP-set every week totaling to 10.  quiz, midterm, final.  similar to the practice exams he posts online.\n"
        },
        {
            "course_name": "Analysis and Optimization",
            "review_date": "May 14, 2013",
            "review_content": "\nMake no mistake, Hongler takes no distinguishable joy in teaching and puts in very little effort. However, he is an above average teacher (deserving of his silver nugget IMO) and his classes are never entirely boring. Even if you half pay attention, you will learn in his class. Some lectures he comes across as extremely lucid and other classes you are left wondering how all the methods he taught fit the puzzle. He is nice, amiable, and willing to explain. Just don't expect him to go the extra mile.\nHe covers difficult topics fairly quickly, and he uses homework as a teaching tool rather than a reinforcing mechanism. Naturally, problem sets spanned the gamut from very difficult to mind numbingly easy. He does teach everything that shows up on the exams, whether through the HW or through lecture. You'll need to think outside the box on the harder questions though, and bring together various theorems. The material is not difficult (nor is it a breeze), but if you're new to the subject it can seem overwhelming.\nWould I take him again? Personally, I would.\nIs he a good teacher? Not particularly excellent, but not at all bad. You could do a lot worse. He gave us the famous \"the limit does not exist!\" Mean Girls problem on one of the questions.\nIs he a lenient grader? Yes, he tends to give as much credit as he can on the exams, as long as you write something relevant.\nDoes he curve well? Word on the street is that he curves generously.\nWorkload:\n12 Problem Sets, 1 quiz, 1 midterm, 1 final. Problem sets are not always straightforward.\n"
        },
        {
            "course_name": "Intro to Modern Analysis II",
            "review_date": "January 09, 2012",
            "review_content": "\nI had a terrific time in Prof. Hongler's Analysis II class.  He is very genial and approachable, and he tries to make sure that the students understand what is going on, even if that means spending some extra time reviewing material from previous lectures.\nIn terms of logistics, this class is run in a pretty standard way following Rudin's book.  That is, there are weekly homeworks (consisting of about 3-4 problems each, from the book), 2 midterms, and a final exam.\nFor the exams, he had more questions than there were available points, so you could choose which ones to answer.  That being said, he did not make all the \"extra\" questions impossible, as some professors are wont to do.\nWorkload:\nWeekly homework (11 total), 2 midterms, Final\n"
        },
        {
            "course_name": "Intro to Modern Analysis II",
            "review_date": "December 19, 2011",
            "review_content": "\nProf. Hongler is great. He presents material clearly, usually follows the book and makes notes when he departs from it. This helps keeping the material organized. He's occasionally humorous, making jokes about his study in undergrad, and in earlier study. Lectures were a joy to attend, even though they were at 9AM. To do it again, I would have reviewed more consistently, so I could better keep up with what was going on. Indeed, Analysis II is challenging and is a lot of work, but it's straightforward if you're diligent. \nProf. Hongler seemed to care about student performance, and always made himself available for answering questions. Great professor; great class.\nWorkload:\nIndeed, this class seems to be much more work than the average Columbia college course, perhaps only exceeded by stuff in engineering. Weekly problem sets; each took about 10-15 hours to complete; if including learning the stuff on which the set is assigned, even more time. Challenging course load, but no problem was obnoxious and without purpose.\n"
        },
        {
            "course_name": "Analysis and Optimization",
            "review_date": "May 23, 2011",
            "review_content": "\nThis class was like a trip to the dentist - you hate going to it more than anything else, but you still have to go through it because you signed up for it.\nThe problem with the subject matter is that there truly isn't enough emphasis on optimization. It's simply a diluted version of Modern Analysis 1, with lagrange multipliers and linear programming. That's it.\nNow, for CLEMENT: My chief complaint of Clement is his lack of commitment to teaching. In short, he is more focused on his research than to teaching the class. It's obvious he doesn't enjoy teaching the subject, and he's often very rude and condescending. He knew 5 kids' names, and if you try to schedule office hours with him he will simply tell you \"it's impossible since I must do my research.\" He makes mistakes on the board all the time, mumbles, etc. All in all, just not a good professor.\nIn Clement's defense, the TA's sucked too. Of the 12 HW sets we did,  maybe 7 were actually handed back.  5 were graded in the last week of the semester, so we couldn't use our graded HW to prepare for the exam.\nPlenty of people dropped out after the first midterm. And, well, I don't blame them. The first midterm was REALLY tough - highest grade an 88, lowest grade I think was around a 10. \nAt least there was a generous curve... 6% in the class got you a D-. I ended up with an A-, and should've had a C. \nWorkload:\n12 Tough HW (25%)\n1 Tricky Quiz, but not too bad at all really (5%)\n1 Impossible midterm (too many questions to do in one hour) (25%)\n1 Killer (not as tough as midterm) Final (45%)\n"
        },
        {
            "course_name": "Analysis and Optimization",
            "review_date": "May 17, 2011",
            "review_content": "\nThe material:\nThe first half of the class focused on analysis. We started with set theory, went through sequence and series, and moved to linear algebra and finally convexities. The second half of the class focused on optimization and covered linear optimization, primal/dual, simplex, lagrange multiplier, and KKT conditions.\nDon't let the 2000-level number fool you. This class is HARD. Half of the reason is because the prerequisites do not adequately prepare you for the level of sophistication the materials requires. Everything is broken down to theorems and proofs. If you have a weak background in proof-based math(like me), you will be so lost as to what you are doing in class. The other half of the issue is with the textbook. The classes was based on Pinkham's textbook, which is probably one of the worst textbooks I have ever seen. The book follows a pattern of theorem->proof->theorem with an occasional example thrown in once in a while to make it look like the theorems are actually useful for something. If you already understand the materials, then the book is great. It rigorously defines everything you ever known and prove why they work. But if you don't already know the materials (which is pretty much everyone in the class), you will be banging your head on the wall trying to understand what one theorem is saying in order to understand the next theorem and so on. If you get stuck on one theorem, you'll have trouble understanding the rest of the materials. But even if you do understand what the theorems are saying, you would still have no idea how to answer the questions because they requires numerical calculations and the book gives no example on how to do them whatsoever. The textbook also lacks pictures and graphs, which is vital to a class like this. 80% of the materials can be be clarified with some simple pictures, which the book desperately lacks. A simple picture would better help explain what a affine plane or what a polyhedra is than 2 pages of symbols and texts. The internet is your best friend here. \nHongler:\nHongler is a really nice guy. Hongler stated at the beginning that the class is difficult and doesn't expect you to understand all of the materials and only hope you have learned something useful in the class. He actually means it. As long as you understand the basic idea of what you are trying to do, he'll give you points for those on the quiz and on the midterm. Unfortunately his lectures comes mostly from the textbook, which is why its rather dull and confusing at times. He does work hard to try and explain it, but it doesn't help much. Most people resorted to teaching themselves instead. The lecture attendance dropped to 30% or so by the end of the semester. The homeworks are deceptively hard, usually taking 3 to 5 hours if you are lucky, and longer if you don't know what's going on. Go to his office hours if you want to be able to do them within a reasonable amount of time AND get full scores on them. He gives partial credits and lot of extra credit opportunities on the hw and the tests.\nIn summary: The class is hell. Avoid taking it unless you have to (Econ-Math majors)... If you have to take it, take it with Hongler, you will have a much easier time, but still expect to learn a lot of the materials on your own though. Also, he gave a REALLY generous curve for the final grade, which helps a lot.\nWorkload:\nWeekly assignments that are worth 25%, 1 difficult quiz that's worth 5%, midterm and final which are 25% and 45% respectively. The final will almost be identical to the midterm, which is very similar to the quiz, and includes materials covered in the second half of the semester.\n"
        }
    ]
}