{
    "prof_info": [
        {
            "prof_name": "Katharine Keenan",
            "prof_id": 11586,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 22, 2014",
            "review_content": "\nKatie Keenan was a really excellent choice for CC and there isn't much bad that I could say about this class. She should have a silver nugget here, if not gold. The workload might be a bit heavier than a typical CC class, but I think it was well worth it. Katie is knowledgeable and friendly, and she shows her enthusiasm in teaching. She also has a pretty cool sense of fashion, though that's unrelated. She's very willing to talk to you and answer your questions whether after class, in email, or in office hours. In fact, I'd absolutely recommend going to her office hours-- I think I was the only student to do so (and if she's reading this, she'll probably know who I am. hi.) but I think that those 1-on-1 conversations were what really made this class so great for me. I was able to learn a lot about myself and the way I live life (and about how other people do, and how society comes to be), throughout the semester.\nThe previous reviews are fairly accurate. Her syllabus includes a few more readings than those of other classes, which can feel a bit overwhelming at times since any CC class already has a lot of reading, but I really liked her choices (Orwell, Camus, De Beauvoir), and in fact, they were probably some of my favourites.\nI'm actually not sure if she'll still be teaching here next year, but if she is, then I would absolutely recommend her. I switched into her class halfway through the year due to a conflict in my schedule, and I think that the 2pg reflections that we have to write make people more likely to take the time to do the reading and really think about what they've read, leading to interesting discussions in class. My previous class didn't have these, and the discussions weren't nearly as interesting there. I think the only reason not to take this class would be if you're taking 7 classes and you don't have time to write a couple pages every now and then. However, first, I'd maybe recommend dropping a class or two, because, wow that's ridiculous (just kidding, you're amazing if you can handle that; just do your thing).\nWorkload:\n2 page reflections due every other week. \nReading takes a maybe 3-5 hours a week.\n1 midterm (take-home)-- relates the readings to situations in the contemporary world.\n1 final paper (5-8 pages I think) -- topic can basically be anything but she helps with some guiding questions.\n1 final exam (in class) -- 1) Key Terms IDs. (These are put on the board at the beginning of every class so pay attention to them.) 2) Quote analysis. 3) Essay.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 07, 2014",
            "review_content": "\nThe review below was pretty accurate, but I'd like to add that she's gotten slightly tougher in terms of grading - you can't just BS your way to an A- anymore, and the reflection papers actually factor into your grade. Also, you can't just hand them all in on the last day. Extra credit exists, but it has very little effect.\nShe's a really sweet, really great professor. Listens to every viewpoint, even when students want to redirect the discussion to how Marx was a much better philosopher than (Plato, Augustine, Hobbes). Very anthropological flavor to the class, which I appreciated. The short lectures at the start of each class help guide the discussion, and the key terms from the reading that show up on the final are identified early in each class, so you know what to study.\nOverall, a solid choice.\nWorkload:\n6 2-3 page reflection papers, graded check/check plus/check minus. 6 page take home midterm, 8 page term paper, final.\nSlightly higher in the spring.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 08, 2013",
            "review_content": "\nProfessor Keenan (or \"Katie\" as she asks to be called) is a solid choice for a CC section if you want a relaxed CC experience. She is very flexible and tries to make the class as streamlined as possible for her students (she gave us a one week extension for our big paper). \nClass usually starts with a small introduction that she makes, which essentially consists of her reading about the context and background of the day's text provided by the Core Admins. After this, one of the students in the class makes a short presentation about the reading which is supposed to help guide and deepen discussion. This probably only succeeds half the time, but discussion proceeds nonetheless. Following the introductions, there is usually a mostly free-flow discussion that loosely follows an outline that Katie writes at the beginning. On the whole, the depth and rigor of the discussion depends on your classmates and how well everyone prepared for the reading. Not surprisingly, there were some days where there was a fair amount of awkward silence. Katie usually takes on fairly standard Core views on the texts, though sometimes with more of an anthropological spin, so how much you like her perspective generally depends on how much you agree with the overall Core.\nWorkload and grading is much lighter than other CC courses. No regular postings/writings and no way to check if you read the material or not (other than discussion). There are two 1-page response papers and one 7-10 page paper. These papers are due anytime before the last class, which means most people do them the day before the last class. The midterm is take home (one 1-page response, one 3-5 page response). The final is a pretty standard CC final (5 term definitions, 3 quote expositions, 1 essay). You can get an A/A- with average to below-average effort put in.\nWorkload:\n30% One 5-Minute Presentation + Class Participation\n20% Two 1-Page Response Papers\n20% One 7-10 Page Paper\n15% Take-Home Midterm\n15% Final\n"
        }
    ]
}