{
    "prof_info": [
        {
            "prof_name": "Sabrina Pillars",
            "prof_id": 521,
            "total_reviews": 24
        }
    ],
    "reviews": [
        {
            "course_name": "Ballet IV",
            "review_date": "January 23, 2014",
            "review_content": "\nSabrina is one of the best teachers I've ever had. Not just in dance, but in approaching problems in life. Many of these reviewers are upset because Sabrina gives people harsh reality checks, which is not what people are used to hearing, or do not want to hear. Put your ego away and bow down. If you let her, she will give you more attention than any dance teacher ever has. She is an expert at figuring out people's bodies, and she'll tell you exactly what your personal issues are and how to fix them. If you're lazy, don't want to face your own problems, or don't have time for this, stay out. But if you are looking for real personal growth and you follow her instructions and actually try to understand what she's saying, you'll find that your whole body will feel different in a matter of weeks. She will only start paying attention to you once she sees that you're listening and willing to trust her methods. Otherwise, she thinks you're a waste of her time, which is true anyway-- why would you take the class if you're not going to even try to learn? This is not the place to fulfill a PE requirement. Her classes have been getting smaller, presumably because of horror stories such as those below. Don't believe them and shy away-- give her a chance and judge for yourself. \nWorkload:\nAttend classes, do what you're told, and maybe even do a few of her exercises on your own time.... you'll be golden.\n"
        },
        {
            "course_name": "Ballet IV",
            "review_date": "August 26, 2012",
            "review_content": "\nShe is absolutely insane. Very intelligent and knowledgeable, but clearly mentally unstable. She is very invasive and inappropriate in class, often shouting curse words and making comments about the personal lives of her students. She means well but I was not a fan of her teaching methods. To her credit, she pays attention to dancers who would be overlooked by a teacher like Robert Lafosse or Allegra Kent. While it is clear that her actions are fueled by the deep care and compassion that she has for her students, I found it too close for comfort. \nWorkload:\nGo to class and sweat. Conform to her method even though it makes you look like a shitty dancer. Just do it and you will get an A.\n"
        },
        {
            "course_name": "Ballet IV",
            "review_date": "December 03, 2010",
            "review_content": "\nSabrina is one of the best dance teachers I've ever had (and I've been taking dance my whole life). I have had a chronic ankle injury for a few years now, and her Pilates class has helped me enormously. She has fantastic corrections, and she can see a problem immediately. My sports medicine doctor is the doctor for the Boston Ballet, and Sabrina has helped me far more than he has (!!). Yes, she does give corrections bluntly and in a matter-of-fact sort of way, but quite frankly, she's usually right. She is also very precise about what she wants, but trust me, it will improve your technique/alignment tremendously. She is passionate about dancing correctly (i.e., so you don't injure yourself).\nIf my injury permitted me to do ballet, I would still be in her class. She teaches a fast-paced, technically challenging class. Personally, it's the kind of class I love most, but it's not what everyone likes. She does not use your typical ballet music either; in my class, she was mostly using Modest Mouse's \"The Moon and Antarctica\" album, which provided some great atypical rhythms.\nLike a previous reviewer has said, if you are easily offended, Sabrina may not be the professor for you. For the record, I have never seen her raise her voice or get angry in the two semesters I've had her. If you're willing to put in the effort that Sabrina demands from her students, however, you will get an abundance back from her. She is actually quite a lovely and interesting person from my discussions with her. Don't be discouraged!\n\nWorkload:\nAttend class, nothing more, nothing less. \n"
        },
        {
            "course_name": "Pilates for Dancers",
            "review_date": "November 16, 2010",
            "review_content": "\nThis is the worst class I have ever taken in my entire life. At first I was excited to go do pilates but then I realized that all you do is stupid breathing exercises that put you in a coma. I wanted an actual work out but the loud and retarded music that she plays over powers her voice so you just lay there and don't hear a single thing she says and wonder if you are doing the exercise right. She would repeatedly single out people for not doing it right and make you feel inept, well i'm sorry i really don't give a shit where the solar plexus is and how i'm supposed to use my tail bone the right way. Don't ever take this to fulfill any requirement or in general.\nWorkload:\nnone, I wouldn't do it any way if there was some\n"
        },
        {
            "course_name": "Pilates for Dancers",
            "review_date": "March 29, 2010",
            "review_content": "\nI have taken pretty much every dance class Barnard offers, and classes at outside studios; this is the least nurturing class I have ever undergone.  Sabrina is an incredibly knowledgeable instructor, and within three weeks of starting her class, I could feel the difference in the muscles of my back.  That said, I am not going back; I have an anxiety disorder, and far from being a source of endorphins, I would often leave class with a panic attack beginning.  The music she uses is jarring, drowns out her voice so you're often guessing about wtf you're supposed to be doing, she's absolutely crap at learning names so you can't tell if she's scolding you or the student next to you, she pays next to no attention to people trying to get her to answer a question, she's often five or ten minutes late, and all in all, despite the undeniable physical benefit from this class, I really wish I hadn't taken it.\nWorkload:\nAttendance taking is spotty, no readings or outside performances to attend.\n"
        },
        {
            "course_name": "Ballet IV",
            "review_date": "April 29, 2009",
            "review_content": "\nMost ballet teachers end their classes with reverence. Sabrina ends hers with temper tantrums instead (during which she makes her students cry and humiliates them in front of the entire class). She seems to have a major ego problem, and I feel awful for the girls she screams at (yeah, she actually SCREAMS. An anomaly out of all the dance teachers I've ever had). \nShe also teaches (\"teaches\"?) with her eyes closed, and literally seems to be teaching class for her own benefit, not the students'. Run away, and run away fast. I desperately wished I had never registered for her class (and she gave me an A). \nWorkload:\nthe standard for dance classes-- show up every time and on time. Nothing new. \n\n"
        },
        {
            "course_name": "Pilates for Dancers",
            "review_date": "January 19, 2009",
            "review_content": "\nSabrina is an amazing and remarkable teacher. her knowledge of the human body is unparalleled as far as ive seen, and if you listen to her she can make you stronger, more flexible, and have better posture. she does have a slightly blunt way of talking that may not mesh with all personality types, which may explain the negative reviews. But honestly, she has so much to offer and she really can transform your body. \nThe pilates we did was a modified version suited for sculpting the body to be fit for dancing, so that means a lot of core work and stretching, range of motion, etc. It starts out slow, but each exercise has a number of different difficulty levels to ensure everyone feels the burn. HIGHLY recommended.\nadded plus: if nothing else, this class can make you look really really good. \nWorkload:\nnone- unless you want to do extra stretching etc. outside of class for your own benefit\n"
        },
        {
            "course_name": "Pilates for Dancers",
            "review_date": "December 23, 2007",
            "review_content": "\nNEVER take this class. She is extremely harsh and short tempered and just generally a very bad teachers. She makes corrections in a snippy and condescending manner. Also--will NOT help your GPA.\n"
        },
        {
            "course_name": "Ballet IV",
            "review_date": "December 12, 2007",
            "review_content": "\nSabrina is one of the most helpful ballet teachers I have ever had. Yes, she can be condescending in her teaching style, but she cares deeply about seeing her students improve. She has a wealth of knowledge about how to train a ballerina's body and how to treat injuries, and she is very generous with her time outside class to help individuals fix their technical problems. She is very willing to help those who seek it. \nAnd her bark is far worse than her bite. Sabrina offers encouragement and praise in addition to her tough corrections. Let's face it: the performing arts world is not usually the most nurturing of environments. We're spoiled here at Barnard by the deep investment our instructors make in us. For an intro-level course, Sabrina would be quite intimidating. However, she teaches Ballet IV, and by the time a student has reached a high intermediate level, she should be able to handle instructors like Sabrina.\nMy advise to anyone who takes Sabrina's class is this: humbly submit to her idiosyncrasies, let the things that bother you roll off your shoulders (I think she can tell when someone sits and stews, and she won't take that!), and seek her help outside class. You will gain invaluable knowledge about how to use your body and avoid injuries, and I think you'll find that you'll love her for herself, too! \nThe long and short of it is: I have not taken any classes with her before now (my senior year), and I find myself wishing I had placed myself in her hands LONG before now!\nWorkload:\nJust attend class and follow the department policy for make-ups. \n"
        },
        {
            "course_name": "Ballet IV",
            "review_date": "December 07, 2007",
            "review_content": "\nSabrina would ridicule students in front of the whole class, pointing out how a student is doing a moevement in a wrong or ugly way, with no apparent benefit to the class. it truly felt to me liekshe wouldrather make fun of students than correct them effectively. She has more fun seeing you do somethign wrong than teaching you how todo it correctly. Sabrina didn't really seem to like to TEACH, only criticize. And believe me, I love it when dance teachers are tough on me-- they ought to be really tough on you; it's their job to teach you to dance, not to make you feel good. But Sabrina truly did not teach or like to make helpful or effective corrections. She didn't want you either to become a better dancer, or to enjoy dancing. Her class doesn't allow you to do either, it just makes you wonder why you ever thought it was worth it to dance in the first place. She makes you hate yourself as well as her-- and not in a productive way, in a shitty way.\n"
        },
        {
            "course_name": "Biomechanics For the Dancer",
            "review_date": "November 01, 2007",
            "review_content": "\nAfter reading the other reviews of Sabrina, I wanted to clarify a few things.  She's extremely direct, which if you have a tendency towards hypersensitivity, can seem mean.  I actually found her comments about my body extremely helpful.  She has a lot of working experience and she can see where your body is imbalanced, weak or tight, and when she points these things out it is for your benefit not because she derives pleasure out of it or because she is mean-spirited.  (As a sidenote, I sincerely doubt she's ever called anyone fat.  I assume this is a result of sensitivity and misunderstanding on the part of the student.)  In terms of the coursework, I was not so impressed.  Her course pack is disorganized and it's nearly impossible to find anything.  As for her teaching abilities, I can't say much.  She gives you a book with the information, but she doesn't really know how to teach it besides reading the text and using her mug/pen/any random accessory to (poorly) illustrate the movements.  That said, the exercises were helpful, though she often forgot to explain or even mention why we were doing them. Probably not worth it to take the class (you might as well just buy Anatomy of Human Movement and go take some Feldenkreis or floor barre classes).\nWorkload:\nLight.  The hardest part is figuring out what you're supposed to read and where to find it. Short Midterm, moderate final.  She expects you to do the exercises outside class but if you work in class and ask questions, you'll be fine\n"
        },
        {
            "course_name": "Pilates for Dancers",
            "review_date": "June 11, 2006",
            "review_content": "\nAmazing class! Sabrilla is a tough cookie but you will learn, hurt, sweat here and there and feel a difference by the end of the semester. I am taking her class again! \nJust know that you need to come prepared to put in 100% effort in every class and learn from the corrections she gives you,...otherwise be prepared to be singled out and ridiculed a bit in front of everyone. She can be mean and intimidating sometimes (most times)\nWorkload:\nJust come prepared physically and mentally to class\n"
        },
        {
            "course_name": "Pilates for Dancers",
            "review_date": "February 13, 2006",
            "review_content": "\nI would disagree with most of the reviewers here, because Sabrina was a great teacher! She did a lot of certified Pilates mat work and worked every part of our bodies...I left the class feeling much stronger and gaining more abs. \nI would definitely recommned this class, it's not only stretches, and the stretches are great especially those for the upper back that is rarely done. Sabrina is really smart and uses a lot of vocabulary from her biomechanics class, which are really helpful if you want to learn what you are doing to your body. She may be strict, but she is not mean. She has a point to what she says and does and is a really nice person. Not every teacher is going to butter you up and make you feel good all the time. With that said, I felt like I learned a lot from her class, and it helped with ballet technique as well (which is what she is aiming for).\nWorkload:\ngo to class, she grades fairly.\n"
        },
        {
            "course_name": "Biomechanics For the Dancer",
            "review_date": "December 15, 2005",
            "review_content": "\nThis class could have been really amazing...except that Sabrina ruined it. This woman was so cruel to me..I can't even contain myself. I wasn't a ballarina so she seemed to refuse to take me seriously, accusing me of not paying attention in class and never wanting to help me outside of class. \nFuthermore, in my opinion she publically humiliates girls in class, pointing out whats wrong with them, making fun of them. \nShe seems to think her method of teching ballet is the ONLY method and makes fun of girls in the class for having learned other ways. Her teaching is vague and wishy-\nwashy, yet her exams are hard and she barely prepares you for them. She made me cry the two times I came for extra help outside of class...telling me I was out of shape, chubby, and asked me why I didn't understand any of the material. I did the readings and all the exercises, never missed class yet somehow...she was absolutely awful.\nWorkload:\nmidterm, final project (hell), final exam\n"
        },
        {
            "course_name": "Pilates for Dancers",
            "review_date": "May 14, 2005",
            "review_content": "\nWell, the woman said she could be a bitch at the beginning of the semester and it turns out she meant it!!! Sabrina isn't simply strict- she can truly be rude and condescending. She often gives corrections in a sarcastic tone of voice which can be humiliating and frustrating. \nAlso, don't expect a typical Pilates mat class from Sabrina. She combines gyrokinesis, yoga, and various stretches including work on the styroform roller but she does very little certified Pilates work.\nI personally would not reccommend this class: Sabrina is not pleasant to work with and although some of the stretches were useful, it was not worth the abuse and frustration!\nWorkload:\nNone but be warned: the course is not P/F! She gives letter grades and she is not kind with them!!\n"
        },
        {
            "course_name": "Biomechanics For the Dancer",
            "review_date": "December 28, 2004",
            "review_content": "\nBe prepared to deal with Sabrina at her best/worst if you want to survive this class.  Biomechanics is physically gruelling, and although everyone taking the class is a dancer, Sabrina's acceptance of individual needs is limited.  Be prepared to attend class on Fridays because she is often sick or unable to make it to class during the regularly scheduled hours.  The material in the text book is fascinating and has helped me a great deal, but Sabrina's own informational packet often contains spelling errors, contradictory information, and basically lacks a clear structure.  I've gotten more inshape with this class than with any gym, and I've been sore in places I didn't know existed.  Bottom line is that if you're a Sabrina fan you will eat this class up, but if you have that oh-so-common love/hate or hate/hate relationship with her then brace yourself  because it's gonna be a bumpy ride!\nWorkload:\nAttendance is necessary to learn exercises; midterm with 8 essay questions (grueling, with apparently no objective grading) a final exam (11 essays, again, what is her basis for judgement?) and a final project where you must assess your problems and try to heal yourself - I turned in so many drafts only to find that she hadn't looked at it once and gave me corrections that had been fixable for 2 weeks!\n"
        },
        {
            "course_name": "Ballet I",
            "review_date": "September 23, 2003",
            "review_content": "\nI had Sabrina several years ago, and as the most memorable teachers tend to stand out, Sabrina stands out strongly. Certainly not in a good way, however.  I had had some ballet experience, but it had been a while since I had taken it. So I was looking forward to a challenging yet not overly demanding class as a nice change from my academic classes. I can easily say that Sabrina's Ballet I was the most stressful class I had that semester.  She routinely made you feel horrible and singled you out in front of the whole class if you weren't doing the exercises perfectly.  I agree-\n-if we wanted to do pilates for a lengthy amount of time, we would have taken her pilates class.  I found that she picked on people a lot.  And the other reviewer is totally right--we were always kept 10 minutes over, and she had no regard for the fact that most of us had classes we had to get to.  And she'd get mad if we said we needed to leave in order to be on time to our next class.  In spite of everything though, I did become more flexible. But that's about the only thing I gained from taking her class.  \n"
        },
        {
            "course_name": "Ballet II",
            "review_date": "September 20, 2003",
            "review_content": "\nsabrina is a ballet nazi.  while she knows her stuff, and will probably improve your technique, she can be mean and unforgiving to anyone who hasn't taken ballet for their whole life.  i took this class expecting a ballet level II, and instead was surprised to find that the vast majority of the people in the class were advanced and were just part of the sabrina fan club. she picks favorites and it makes me carsick watching her prized students kiss her bony ass. she wastes time by spending a good ten to fifteen minutes doing pilates warm-ups  (which is valuable, but seems to be like something students should do outside of class, or in sabrina's pilates class, which she yells at people to come to everyday, after she has told them that they are weak, fat, and/or ab-less), and spends almost most of the class at the barre working on technique, with only five to ten mintues in the center.  her class also usually runs ten mintues late, and she expects you to stay.  i used to love ballet, and i can  safely say that sabrina made me hate it.  what a beeyatch.  avoid her like the plague.\n"
        },
        {
            "course_name": "Biomechanics For the Dancer",
            "review_date": "May 19, 2003",
            "review_content": "\nIf you are a dedicated dancer (or any athlete for that matter), regardless of skill level, you must take this class.  You will learn how to use your body, how to speak about your body (anatomically), and how to make your body last.  Sabrina teaches, baby step by baby step, how to overcome everything from a \"bad standing leg\" to an ankle sprain to flat feet to a dislocated shoulder.  Be ready to work hard in class, and she will be warm and generous.  She will adjust her lectures to focus on the students' concerns and even stay after class to work on your uneven hips.  Sabrina doesn't seem to be a tough grader, but she doesn't really need to use grades to get you to work hard.  You will do well and feel that you earned it.  This is one of the best classes in the department.\nWorkload:\nMost of the work is done in class, which runs an hour late each Friday, but you can think of it as homework time since there is very little reading.  Midterm, Final, Final Project \n"
        },
        {
            "course_name": "Biomechanics For the Dancer",
            "review_date": "May 14, 2003",
            "review_content": "\nIf you're interested in learning a lot of good stuff about body, take this class-- as long as you are prepared to deal with Sabrina.  She's really nice, despite what other reviewers say, and she really cares about her students, but her manner is unorthodox and unorganized.  Also, even if the schedule lists the class as being only two hours, be prepared to stay for almost three hours, and don't worry if you feel like you're getting sucked in to a Sabrina cult-- you are.  But she really will help you figure out your own body and you'll leave the class feeling like you've learned something, even if it's only how to pronounce \"Feldenkreis.\"\nWorkload:\nNot that difficult, a midterm, a project, and a final.  But be prepared to physically work your butt off in class\n"
        },
        {
            "course_name": "Ballet II",
            "review_date": "May 09, 2003",
            "review_content": "\nSabrina is the most dedicated teacher I have ever had.  She TEACHES technique, giving innumerable exercises and explanations for how to use your muscles to achieve positions, rather than just telling you to get your butt under and your knees out.  She will spend time with you outside of class adressing your structural limitations and how to overcome them.  If you are injured, she will fix you and amaze you.  If you really want to learn about your body and you want to learn what it means to do ballet, you must take her class.  \nWorkload:\nheavy for a ballet class...you will get exercises to work on at home\n"
        },
        {
            "course_name": "Ballet IV",
            "review_date": "September 07, 2002",
            "review_content": "\nWhile she can be a nice, approachable person at the end of class, be afraid...be VERY afraid. This woman made me never want to look at another teacher in the eyes again. Her class consist of pilates warm-up, which was good for the abs but not after a heavy lunch, thousands of tendu exercises that didn't bring one sweat drop to my brow, and random passe'/coupe' turns in the center. Be prepared to have her stop the class in the middle of an exercise, stare at you straight in the face and censure you 'till you want to cry. She must have grabbed my arm from the barre numerous times for not having my thumb on top of the barre!! wow. talk about anal. If you're looking to get a good workout and lose some of your freshmen 15 from last year, do not take her class! It's all Balanchine based, annoying lunge pirouette positions, tendus tendus tendus, short adagios, and NO grande allegro. Also, her musical ear is far from on key. can this woman count to 8?? Note: if no piano player shows, there's always weird citar/hippie music to dance to! yay...not.\nWorkload:\nnone. \n"
        },
        {
            "course_name": "Ballet I",
            "review_date": "June 09, 2002",
            "review_content": "\nI hope you like ab work! Sabrina is a wonderful instructor, but she can be VERY intimidating. You will work technique in this class until your mind is completely numb and your body is entirely sore, but it is ultimately worth it. There is no one else in the dance department quite like her. While I could not call the classes fun, you will certainly be challenged and learn a lot perfecting your technique. Any of Sabrina's classes are for the truly dedicated dancer or the really ambitious beginner.\nWorkload:\nA lot of ab work (pilates) and technique, technique, technique!\n"
        },
        {
            "course_name": "Ballet IV",
            "review_date": "December 31, 1999",
            "review_content": "\nExpect to work on your technique until you're ready to cry. pilates at the beginning of every class (each day she'll come in and reprimand you for not having gotten started yet) plus a sizeable amount of her own strange physiological philosophy. Sabrina was in NYCB and i'm sure she's a beautiful dancer herself, but her classes are so slow that you'll go through the semester without a single grande allegro. Her class is only for those truly dedicated to improving their technique.\n"
        }
    ]
}