{
    "prof_info": [
        {
            "prof_name": "Quan Yi",
            "prof_id": 1871,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Acting Chinese Opera",
            "review_date": "March 17, 2004",
            "review_content": "\nThis class was a great opportunity to learn basic Chinese Opera movement from a professional Chinese Opera performer, Qian Yi.  This is a wholly practical class that teaches graceful stylized movement that is, generally speaking, at the same time similar to both ballet and kung fu.  Elements of yoga and tai chi are also incorporated into the training and warm up.\nIn addition to the class' interesting cultural value, the movement training is very useful for performers in general.  It gives a sense of awareness of the body, expands your vocabulary of movement, and helps train physical discipline.  Plus there was work with \"weapons,\" which included short and long sticks.  Training here included learning to work the sticks in circular spinning patterns. \nI took this class in fall 2003.  There was no work with singing or other vocalizations at that time.  It was only movement based, which is fine considering there was a whole lot to learn in such a short time.\nThe teacher, Qian Yi, is friendly and exceptionally patient.  I applaud her for her willingness to share this Chinese Opera training with our class and for her patience with us as we worked to learn the new & unfamiliar Eastern-style movements.\nWorkload:\nClass met once a week, 3 hours on Monday.  Midterm and final performances.  Needed to keep a journal, but no other written work.  Recommended reading from Chinese literature.  Save for the journaling, class almost entirely practical.\n"
        },
        {
            "course_name": "Acting Chinese Opera",
            "review_date": "December 30, 2003",
            "review_content": "\nDont take if you expect an easy A. And dont take if your not a dance expert.  Though the staff may pretend the grading is about how hard you work.  Its bullshit.  If you suck at dancing, no matter how much you work your ass off, you aint gettin an A.  But if you are okay at dancing and can bullshit it to make it look like you are good, then you got an easy A.  Keep in mind, this may all change as the course is new.  But until the instructor (very nice by the way) realizes she isnt in a opera boot camp for Maoist dancers, then its gonna be a bumpy ride.\nWorkload:\nmidterm preformance, and final preformance are the whole grade.  reading is optional\n"
        }
    ]
}