{
    "prof_info": [
        {
            "prof_name": "Harrison White",
            "prof_id": 1003,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "February 11, 2008",
            "review_content": "\nProf. White has a pretty different approach to CC than you'd expect from other professors.  First of all, there wasn't really a syllabus.. just a few pages on general thoughts/themes found throughout the reading.  And he makes it pretty clear that you're supposed to get as much as you want out of it.\nYou basically just read what you want and as much as you want.  I read maybe 50 pages of text throughout the whole semester.  Most of the time he'll lecture on about stuff you won't really understand with the occasional comment from a student, but for the most part there isn't much discussion going on.  His class was perfect for me, I'm not much for philosophy so I read the occasional passage and didn't look too much into it.  But if you really want/need structure or looking for a deep/thorough discussion of the texts.. this isn't the class for you.\nWorkload:\nYou put in as much as you want.  Pretty lenient grader.  1 midterm paper, a semester long project (which can be on basically anything that interests you), and a final paper.  And a couple of interim reports for the semester long project.  Overall, very light workload (unless you decide you really want to read a lot)\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 27, 2007",
            "review_content": "\nvery nice guy, you get as much (or as little) as you want from the class. He knows everything about everything (really: Wikipedia him) and often lectures about the works for the majority of class time. Some people in the class hated this, but I didn't mind; he knows more than you do anyway, and its nice to actually learn something from discussion than listening to your classmates ramble about how the work makes them feel.\nWorkload:\nwhatever you want. The class generally agrees on the order of works- there isn't a rigid syllabus. He says we are adults and can read however much we want- you could ostensibly read nothing, but you should read; the texts are kind of a big deal. The class writes the midterm, no final- you write a paper instead. Final project/presentation- basically whatever you want. Very lenient grader.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 24, 2006",
            "review_content": "\nYes, Harrison likes to lecture.  Yes, he will not clarify his assignment/ course objectives (we were able to choose how much or how little of which books we read).  Yes, often the class goes completely off topic. In fairness, he compensates for these vague objectives with very,very,very kind grading.  In essence, a big part of this course is figuring out why you are taking it in the first place, then the second part of the course is figuring how much or how little you want to get from it. \nWorkload:\nVery light, as much or as little reading as you want from whichever books you want! a paper on a topic of your choice and a final project.  Very,very,very reasonable grader.\n"
        },
        {
            "course_name": "Sociology of the Arts",
            "review_date": "May 29, 2004",
            "review_content": "\nHarrison White opened up class by declaring that his mission was for his students to see the social/cultural world in non-deterministic and multi-faceted ways. He described the social sciences as a type of \"walnut\", where we must learn to \"lick\" the \"correct delineated wrinkles\" (These are ACTUAL notes). So upon even first impressions, we knew that, in fact, this guy's a *nut*.\nThe nature of the class was entirely seminar-based. The syllabus was never followed. And we only had to read his extremely cryptic book called \"Creation and Careers in Art Worlds.\" Basically, if one has to put it lightly, the class was based on rationalizing his whacky theories.  The nature of our discussions ranged from Mickey Mouse, Gay Sex Clubs, Gallery Worlds, Indie Music, etc. etc., but all discussed in a *roundabout* way, which ultimately pointed to the nature of his own written works. \nStill, while we had this in mind, none of us really knew what the class was about. It  was COMPLETE CHAOS. But also really fun.\nWorkload:\nVERY EASY. He tells us that our papers must be \"a maximum of 89 pages.\" He's joking of course... he just doesn't want our ambition to get in our way. In fact, you could write two paragraphs, hand it in, and get away with at least a B.\n"
        },
        {
            "course_name": "Sociology of the Arts",
            "review_date": "May 11, 2004",
            "review_content": "\nOne of ColumbiaÂ’s great aging intellectual powerhouses, Professor White has the singular ability to go from the sublime to the ridiculous without skipping a beat. As has been said before, this course is chaos. Its fundamental premises could be summed up in the total of two class periods, leaving one to wonder what we were doing with the rest of the time. There were a number of interesting conversations, and I donÂ’t regret taking the class; however, I am really none the wiser about the sociology of the arts, sociological method, or the workings of the Artworld. I think this class would have been awesome if it had some direction and substance. But as it was, it was simply bi-weekly confusion.\nWorkload:\npaper, midterm, project presentation, project paper, final. It is an interesting question whether anyone in the class did all these assignments. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 26, 2002",
            "review_content": "\nOh man. Who is this guy? The class was unbelievable. There is a part of me that wants strongly to believe that Professor White is a good person, and I think he really is a good human being even if he can't learn students' names in a class of 20 in 15 weeks or so. But a teacher? No. Here's the deal. You'll come to class, and Professor White will greet you 5 minutes later when he shows up. He will then proceed to lecture for quite some time (if not the entire time), presenting \"interpretations\" that are either far, far above your comprehension or superficial and meaningless. Example: \"See, for me, Locke was the first author we've read to really deal with TIME in an important way.\" Huh? Locke? Time? I'm sorry? Class discussion can be lacking entirely, and he isn't quite competent at sparking or facilitating it. He seems to be quite unaware of the current CC syllabus and suggest and discusses other readings that are rather unecessary for examinations. I would say the few pluses to the class are that your attendance is quite unrequired and that he's a kind grader, but there are certainly more enlightening sections to be found.\nWorkload:\nTwo 6-8 page papers, the second of which is a follow-on to a small group project presented to the class. Papers, project, midterm, and final are all graded kindly, as mentioned. Regurgitation, if you can make sense of what he says to repeat it in a coherent way, is effective.\n"
        },
        {
            "course_name": "careers and creativity: sociology of the arts",
            "review_date": "March 26, 2002",
            "review_content": "\nMost of the class agrees, this is a disappointing course. The only structured element is weekly reading in Professor White's poorly written book. We have a presentation, paper, and exam all coming up soon and none of us can figure out how or what the hell to prepare...the TAs are of little help. This is potentially an important class to anyone interested in the arts, and Professor White may even be a good professor, but the syllabus needs some serious revising (oh wait, the syllabus was only for the first 2 weeks).\n"
        }
    ]
}