{
    "prof_info": [
        {
            "prof_name": "Joshua Cody",
            "prof_id": 1371,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": null,
            "review_date": null,
            "review_content": null
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 03, 2005",
            "review_content": "\nWith core classes, you win some and you lose some. With Josh Cody, you get some of each.\nOn the winning side, he doesn't expect students in a music hum class to perform like graduate musicologists. The concert reports were graded generously to say the least (although he expected longer reports than many other music hum teachers), and his exams were extremely easy. He really just wants to see that every student learns something from the class and gets exposed to the music. If you show up, pay attention 50% of the time, and say something in class every now and then, you'll do fine.\nThe downside is that he's really not so into the class. He's the artistic director of an ensemble group, and that's always a higher priority than the class. It took him 3 weeks to return the first concert report, and 2 weeks to return the midterm. He managed to show up late for class every single day, then claimed at the end of the semester that he'd inadvertantly copied the wrong time onto the syllabus and had been going by that all semester. (The problem is that the syllabus he handed out at the beginning of the semester had the correct time.)\nThe coup de grace was when he simply didn't show up for the final exam after e-\nmailing the class repeatedly to remind us about it. Afterwards he sent an e-mail that was written as though he had somehow bothered to notify us, and gave a takehome exam he expected turned in at the end of exams. By this point, no one had time to do a takehome exam, and his decision to go this route reflected a complete and total disregard for the students in the class.\nWorkload:\n2 concert reports of 6-8 pages, 2 page midterm. final exam became takehome at the last minute.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 29, 2004",
            "review_content": "\nWhat can I say about this guy other than that hes great.  Not only did I get an A in the class without doing any work but I also learned a lot about music in general.  The first few classes we looked at rock as a precurser to classical in order to get us in tuned with listening to music.  He is never on time, and never gets through all the material.  Very approachable if you have any questions or comments.  Overall great guy.  He does kind of get side tracked and/or forgets about stuff.  If your looking for a great class filledd with fun times and laughter i suuggest you take joshua's class, nevermind the great wardrobe he has.\nWorkload:\nStandard midterm and final along with 2 concert reports.  Easy grader\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "June 06, 2004",
            "review_content": "\nIncredibly kind professor with contagious excitement about music history and theory.  Don't be afraid to take Cody's class, even if you don't know a sharp from a flat.   He's attentive to students of all levels.  Good-natured and cheerful all the time.  It's almost sickening!\nWorkload:\nconcert reports, etc.  He gives high-density lectures, so you should take notes.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "May 09, 2004",
            "review_content": "\nJoshua, a music composer, is a very intelligent person, but it quickly becomes evident that he has no idea how to teach a class.  He strays from one topic to the next, and nearly every class lacked a clear objective and conclusion.  Nevertheless, his exams are mostly fair, and his grading is very generous. \nWorkload:\n2 concert reports, 5-7 pgs in length, a midterm and a final\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 10, 2004",
            "review_content": "\nThe other 2 reviews about Prof. Cody are pretty accurate. He is not a terrible professor, and for the most part he knows his stuff, however he is completely uninterested in teaching the course (and he doesn't hesitate to express these feelings to the class). This lack of interest is often manifested in his weak preparation. He is very hard to follow when he gives notes, because he is very \"jumpy\"--always going from one topic to another. He is an interesting lecturer, though. He does sometimes just take his notes from an online music encyclopedia, but he expands on those notes to tell interesting stories. I didn't feel like I learned much music theory, because Prof. Cody often taught above my knowledge...he never really went over the basics. Luckily, though, he didn't require that we all understand the music theory.\nLike the other reviewers said, he is a pretty easy grader, and he is a nice guy (although he never took the time to learn the names of the students in the class). I'm sure you could find a better (and more dedicated) music hum teacher, but I'm sure you could find worse ones.\nWorkload:\nPretty standard for music hum....regular assigned readings in the book (you could get away without doing them...you could do almost no work and get by ok, but it is probably helpful to read)....2 concert reports (5-7 pages each), midterm and final (not too difficult...mostly vocab tests with music identification). \n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "April 06, 2003",
            "review_content": "\nJosh is an extremely articulate and engaging guy; his only problem is that he assumes his students already have a working knowledge of music theory.  Half of my class had studied music before, and he mainly taught to them; the rest of us just tried to keep up.  Compelling talker, though.\nWorkload:\ntwo concert reports; moderate to difficult midterm and final.  make sure you know exactly what the exam format will be.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "December 20, 2002",
            "review_content": "\neccentric and hip, if a bit aloof to the idea of teaching. He has a great command of the material, but he also directs films and conducts, so you get the feeling that Columbia acts as a bit of a sideshow to his \"real life\" (quotes mine). easy grader and a down to earth, hysterical guy. you have to want to learn to learn in his class. he is very approachable and wants everyone to get it, but his enthusiasm is sporadic...you can sleep in his class if you are a worthless piece of shit and want to do that sort of thing...either way, you're doing well.\nWorkload:\n2 concert reports, midterm, final\n"
        }
    ]
}