{
    "prof_info": [
        {
            "prof_name": "Olivia Harrison",
            "prof_id": 2797,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Third-Year Grammar and Composition I",
            "review_date": "January 03, 2009",
            "review_content": "\nDO NOT TAKE THIS CLASS UNLESS YOU: 1) Are completly 100% confident in your advanced French grammar. Olivia expects you to need little to no explanation. She will give you a handout and a very complicated book explaning small nuances between tenses and prepositions because she expects you to have every single concept already down. This is a mistake because this is the first college french course for a good amount of her students. She will only attempt to explain something if she realizes that nobody knows what is going on after you have tried to work your way through a 5 page long worksheet. There is so much confusion and class participation sucks because you will say something and there is a chance she will completly shut you down. You hardly ever recieve any encouragment, so you feel like crap about your French. \n2) have TONS of time to spare. She gives a ridiculous amount of homework. So ridiculous in fact that she does not waste time in class giving it and instead sends you an email with 10 different things for you to do for the next class. \nIf you go against this advice and take this class anyway, you will end up learning and improving in your writing. However this is not justified by the amount of misery associated with this class. \nEven though I finally managed to get a B+, I would not take this class again. The class goes by really slowly and the workload is awful. I have a friend that took this class with Koffi-Tessio, and she actually enjoyed it. \n\nWorkload:\nInsane amount of work. \nOn an average day I would have:\n2-3 worksheets to do\n40 pages to read out of Balzac or Moliere\na 4-5 page composition to write\na paragraph of discussion to do on Courseworks\n"
        },
        {
            "course_name": "Intermediate French I",
            "review_date": "January 16, 2006",
            "review_content": "\nAwesome teacher.  So nice and engaging.  Her class is the best.\nWorkload:\nNot bad\n"
        }
    ]
}