{
    "prof_info": [
        {
            "prof_name": "Kristina Milnor",
            "prof_id": 433,
            "total_reviews": 16
        }
    ],
    "reviews": [
        {
            "course_name": "Intensive Intermediate Latin",
            "review_date": "December 18, 2016",
            "review_content": "\nShe can teach you 2 years worth of Latin in 12 weeks if you're willing to put in the effort. Very, very, very good at what she does. She genuinely cares and goes through every single line and will answer every question with more patience than is humanly possible. \nWorkload:\nQuizzes every week. About 80 lines a day. \n"
        },
        {
            "course_name": "Intensive Intermediate Latin",
            "review_date": "September 06, 2016",
            "review_content": "\nAs the name implies, it is very intense. Starting out we had 30 lines the first day and by the end of the first week, we were doing between 50 and 60 a day. At the end of the six weeks, we were up to about 70 line per day. She is an amazing teacher who honestly cares and will take the time if you ask her. Honestly, this is the best way to complete your language requirement for Columbia. It is six weeks, you don't read it as much as you would in the full year-long course, and it's pretty fun. However, if you are a classics student or a classical studies student, I would not recommend this. For me, you were going so fast and translating so much that you didn't have time to make your translations all they could be to further your understanding of the Latin language. It was hard to gain vocabulary because you rushed through everything and didn't have time to build up your vocabulary for the 3000 level follow-on courses you need to take after. In short: Great teacher, very intense, everybody got A's, great way to fulfill your language requirement, but not if you're a classics student.\nWorkload:\nSee above.\n"
        },
        {
            "course_name": "Reacting to the Past - First Year Seminar",
            "review_date": "April 10, 2015",
            "review_content": "\nI absolutely loved this class, and Milnor definitely contributed to that. The nature of this class is that the professor doesn't participate in class very much, but she did a great job of introducing the set up of the game and giving us help with our characters and papers. \nHonestly, this class turned a little cultish and we loved it. We had such a good time that we scheduled a class dinner at Symposium and Milnor came and somehow used a budget to get it all paid for, which was awesome. We got to talk to Milnor and it was so fun. She told us that our class was the best she ever had, sooo that's pretty cool. We all had such a fantastic and ridiculous time arguing and having crazy things happen. I would absolutely recommend this class to students who love participating and debating, like history, and are willing to take some risks. If you are scared or bad at public speaking or dislike being involved, this class will definitely not be as fun for you. Some kids just never participated and they missed out. \nWorkload:\nAbout two 4-6 page papers per game (3 games) depending on your character. Seems way worse than it is because the papers are mostly opinion and what you've been arguing in class. One girl wrote a play. Milnor is super helpful with this too. You want to be prepared for class (do the reading) otherwise it will be hard to keep up. \n"
        },
        {
            "course_name": "Reacting to the Past - First Year Seminar",
            "review_date": "November 17, 2014",
            "review_content": "\nDefinitely a class I would recommend to anyone.\nProfessor Milnor knows what she is doing and engages everyone into the games. If you're struggling or needing help with anything, she is very, very good with office hours. I would suggest going over each paper with her and running your ideas through her then. She is overly generous with the critiques and is very willing to help.\nThis class was definitely the highlight of my first semester.\nWorkload:\nEach game has two papers (2/3 of game grade) and one participation grade (1/3 of game grade, based on speaking ability and participation). Altogether, 6 papers and 3 participation grades. It wasn't too much work for me.\n"
        },
        {
            "course_name": "First-Year Seminar / Reacting to the Past",
            "review_date": "May 21, 2014",
            "review_content": "\nProfessor Milnor is the total package: she knows her stuff, she's an excellent educator, and she's probably the most understanding professor I've had all semester.\nI'd like to compare her to Gulatti almost. Her classes are hard, but she makes you want to put in the work and the classes are extremely interesting.\nAbout a review below saying Milnor has favorites, I'd have to disagree. She appreciates everyone's strengths, as some people were better writers and others were amazing speakers.\nI think Milnor needs her gold nugget back. The amount of time she dedicates to her students is unheard of. She meets with students on different days than her office hours. \nNow for grading: I got a C- on my very first paper and went to her two times on my next one and got a C+. However, I eventually figured out how she wanted the papers to be written (it's a learned process) and have gotten A-/A's on all the rest of them. I couldn't have done this without her help. I recommend sending her a rough draft (because its not required) before the paper is due. Her feedback is extremely helpful for not only the grade but for the writing aspect. I mean hello, she knows Latin, she has amazing grammar.\nI am the most proud of taking this class as a first year at Barnard. I recommend taking it with Milnor for the complete holistic Reacting to The Past experience.\nWorkload:\n3 Participation Grades (30%) 6 papers (70%)\n"
        },
        {
            "course_name": "Women in Antiquity",
            "review_date": "January 29, 2014",
            "review_content": "\nProf. Milnor really knows her stuff. Not only is she a great professor, she is also a very \"real\" teacher who understands her students' needs not only as students but also as human beings. This class was pretty hard, but it was also interesting...mostly because of her lectures. The reading is not always necessary (note: you do not need to read what is on courseworks...she actually tells us this in passing...just the \"primary texts\" and you will be just fine). I definitely recommend this class and honestly, any class with Professor Milnor. Really, she has a \"gold nugget\" for a reason. \nWorkload:\nreading every night (not all is necessary), one midterm, 2 essays, and one final exam. not too terrible, as reading is very interesting most of the time...very manageable and she will work with you if you fall behind.\n"
        },
        {
            "course_name": "First-Year Seminar / Reacting to the Past",
            "review_date": "July 06, 2009",
            "review_content": "\nMilnor is obviously an educated woman with a great background. Yes, she is nice, but I took part in Milnor's class and found her to have \"favorites\", i.e. those who suck up to her in class and talk a mouthful. If you don't suck up to her, expect a B. She once told us that we could write our papers in a creative writing form if we'd like and so I did, and she admitted she really enjoyed and \"would have been an A+ if this was a creative writing class\"...and so she ended up giving me a C instead. I confronted her about what she said and she responded \"Oh, did I? Well...I don';t recall that I said it and you were the only one who wrote this paper in creative writing form, so...sorry.\"\nWorkload:\nLots of sucking up.\n"
        },
        {
            "course_name": "Classics and Film",
            "review_date": "September 14, 2006",
            "review_content": "\nI want Kristina Milnor to be my best friend.  Failing that, I want to speak Latin so I can take more of her classes!\nSeriously, Milnor is a friendly, enthusiastic, and knowledgeable lecturer; she has a way of skewering a movie/writer/director that's at once funny and insightful.  There wasn't a whole lot of discussion in this 60-student class, but there was some, and you could always corner her afterwards if you had a burning question or comment.  She made an effort to get to know everyone at least a little, and she was definitely the thing that made the 4-hour class bearable.\nWorkload:\n2 papers (5-7 pages each), midterm and final.  the reading was either a whole lot or very little, but if you're sharp in class you can pick up enough to get by on if you don't really want to read, say, Tacitus\n"
        },
        {
            "course_name": "Classics and Film",
            "review_date": "May 17, 2005",
            "review_content": "\nProfessor Milnor is kind, good humored, knowledgeable, and passionate about her field of study. She is very interested in interdisciplinary approaches to certain subjects, which can be very tricky. Adding different disciplines can easily confuse and confound the subject. However, Professor MilnorÂ’s clear mindedness and astute interpretations of the texts and films made class thoroughly enjoyable. Her lectures are succinct, informative, and easy to follow. Professor Milnor never lost sight of the texts in context to their times. She is not one to champion modern, psycho-analytical readings of antiquity, and this makes concepts in the text so much clearer. For an English major looking to fulfill a film requirement, I guarantee that this class will not only inform you on a fascinating genre but make you understand the influence of antiquity in the modern world. I also highly recommend this class to film majors since it teaches you so much about translating literature onto a filmic medium. In short, Professor Milnor is absolutely fantastic.\nWorkload:\nThe workload was divided into 4 things, each worth 25% of your grade: 2 papers, a midterm, and a final. Professor Milnor does not believe in grade inflation and will give you the grade you deserve. So if you are looking for a mindless course, this is not the class to take. But even if she forces you to work hard, it's not that difficult to do well in the class because the tests are easy enough to balance out the tough grading on the papers. \n"
        },
        {
            "course_name": "Classics and Film",
            "review_date": "May 10, 2005",
            "review_content": "\nThis was actually a great class. Professor Milnor knew the material well and was very enthusiastic about the class in general. She brought both a professional and personal touch to class and the topic. She has the fairest grading mentality I have seen, grouping the class into their respective years so that a frosh straight out of high school and a classics major in her senior year are not graded the same.\nWorkload:\n2 short (5 - 7 pages) medium amount of reading.\n"
        },
        {
            "course_name": "Intermediate Latin I",
            "review_date": "May 07, 2005",
            "review_content": "\nAMAZING.\nseriously, take any class with her. she's amazingly smart and somehow makes latin hilariously funny. and easy to understand. she must be, like, a witch doctor or something. \n"
        },
        {
            "course_name": "Reacting to the Past",
            "review_date": "January 08, 2005",
            "review_content": "\nReacting to the Past is in general an interesting course.  It's kind of fun, especially if you like public speaking.  Prefessor Milnor was very enthusiastic, and she really seemed to enjoy the class.  Her grading was very generous.  By my calculations, making about three well-informed or provocative statements per class gets you an A in participation.  The papers were all essentially creative writing exercises; you just write a speech from the point of view of your character.  If you include a decent amount of quotes, you will get A's.  I've heard Carnes, the other Reacting prof, is much harder.  So, basically, reacting with Milnor was fun, and it was a really easy A.\nWorkload:\n6 3-5 page papers that are easy to write and that have very flexible deadlines, some reading, class participation is a third of your grade\n"
        },
        {
            "course_name": "Latin Literature: Prose",
            "review_date": "April 21, 2003",
            "review_content": "\nThis is what Latin is all about: enthusiasm, humor, and knowledge.  And it's all embodied in Professor Milnor: she is hilarious, interesting, enthusiastic, completely friendly to students, accessible outside of class, and friendly when your translation needs some help.  She doesn't yell \"wrong!\" when you're off the mark with translation or analysis, but says \"ooooookay\" and helps you out.  I would chose Professor Milnor for all my latin classes if I could.  \nWorkload:\nI'm sure it's different for every course, but our was 4-6 pages of translation per night - which was do-able because she provided some vocabulary.  At one point, when the translation got too heavy, someone commented and she reduced it.  Midterm (translation of passages and essay), Final,  Paper (5-7 pages).  Totally fine.\n"
        },
        {
            "course_name": "Latin Lit: Prose",
            "review_date": "January 19, 2003",
            "review_content": "\nMilnor is an awesome professor. She loves Classics and it shows (if you dont trust me just wait and see her tatoo!). She is enthusiastic, intelligent, has a great sense of humor, and really wants her students to learn. I highly recommend her as a professor, and cant wait to take more classes taught by her\nWorkload:\nDaily translations, weekly quizzes, easy midterm and final. Pay attention in class and you will get an A.\n"
        },
        {
            "course_name": "Ancient City",
            "review_date": "March 31, 2001",
            "review_content": "\nProfessor Milnor (who designed the class herself) is the thing that makes classics worthwile. She's completely down to earth and very accesible, and is an awesome lecturer. I, a person who has absolutely no interest in classics, highly recommend the class, but only if Milnor is teaching it.\nWorkload:\nThere is a lot of reading, but it is well spaced out and quite understandable. Midterm and Final (Milnor says she doesnt believe in exams and hands out great study sheets which tell you what exacly will be on the test) There is also an oral presentation (not graded) and a paper on the same topic (no need to do crazy extra research). Workload was extremely managable, even for someone like me with no background in classics whatsoever.\n"
        },
        {
            "course_name": "Elementary Latin I",
            "review_date": "December 31, 1999",
            "review_content": "\nProf. Milnor is one of the best teachers in the department. She is very accessible. She truly wants you to learn the material and will help any way she can. As an elementary language class, the grammar can get pretty boring at times, but she works hard to keep the subject interesting. I would recommend any class that she teaches!!!\nWorkload:\nHomework every night (Short translations); two midterms and a relatively short final exam. \n"
        }
    ]
}