{
    "prof_info": [
        {
            "prof_name": "Yochanan Kushnir",
            "prof_id": 2015,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "The Earth System: Climate",
            "review_date": "April 11, 2004",
            "review_content": "\nAs the previous reviewer mentioned, you will fall asleep.  guarenteed. However, on the same note, even if i was awake for an entire lecture, it didn't make much of a difference because he does a poor job of articulating and clearly explaining the complex concepts and processes of the atmospheric system.  This is not easy material that you can simply learn on your own...well you can, and i had to- but it's incredibly time consuming.\nThe Labs will make you want to poke your eyes out.  The writeups are even worse.  \nI hear that other sections of this class have been better...i would try to avoid this guy if possible.  If you have no other choice- sit up in the front so you can hear him (he talks very softly)\nGood luck!\n"
        },
        {
            "course_name": "The Earth System: Climate",
            "review_date": "March 24, 2004",
            "review_content": "\nKushnir is the first of three profs for this class.  He covers the atmospheric section of the syllibus.  He is a little man with a little voice and has an accent.  All told, it's kinda adorable.  BUT - he WILL put you to sleep.  How many times can a man say \"adiabatic lapse rate\" in a sentance and expect his students not to be snoring?  Sometimes he confuses himself, and therefore the class, but manages to make most of it make sense as long as your brain is awake.  All of his presentations are available online and I recommend reading the notes posted online before the power points many times over.  That's the only way I made sense of it.  The labs are painful - literally - after two and a half hours of staring at colored charts on the computer your eyes will be burning.  The lad write ups are even more painful, sometimes taking more than 10 hours to complete.  It's hard and intimidating but the midterm is suprizingly simple.  So, disregard your D's and C's on lab write ups and stick it out.  Most people get B+ or A - (like every other class on campus).\nWorkload:\nWeekly three hour lab, write ups (25%? or your grade) vary but can take a hell of a long time, occasional \"homeworks\" of two or three \"problems\" which can take time to think out but don't really count for points (if you are totally wrong they'll ask you to redo it), not too much textbook reading, midterm (25%) and final (50%?).\n"
        }
    ]
}