{
    "prof_info": [
        {
            "prof_name": "Rosalind Krauss",
            "prof_id": 1054,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "W3650 20th Century Art",
            "review_date": "June 01, 2016",
            "review_content": "\nAh, what to say about sauer-Krauss. \nI think that first and foremost taking the 20th century course is necessary and extremely helpful if you're an art history major.  Although Prof. Krauss is typically scattered, technologically challenged, and intimidating, I learned so much about modern and contemporary art because Krauss introduces numerous of theories and essays by art critics, historians, artists (whom you will later find out are basically her colleagues).  Everything she talks about is highly important, and the readings, sooner or later, are necessary and important pieces of literature.  I don't agree with others that you can just get away with browsing/shopping on the internet during class or just not showing up at all, because most of the summaries you read online are subjective and usually omit important points about a piece of artwork.  The textbook is reasonably priced, especially for an art book, and it is an enjoyable read (also makes for a nice decoration on the coffee table!) The workload is more than reasonable (weekly readings, 1 paper, 1 midterm, and 1 final). I love Krauss.  She made me crack up in every class. \n**Speak from your diaphragm! \nWorkload:\nweekly readings, 1 paper, 1 midterm, and 1 final\n"
        },
        {
            "course_name": "20th Century Art",
            "review_date": "May 15, 2016",
            "review_content": "\nTaking Prof. Rosalind Krauss' class was a privilege, and in its best moments, a joy. If you like 20th century art—especially Cubism, de Stijl, and Russian Constructivism, all of which receive their due time—then you will love this class. Krauss draws on literature, history, linguistics, and semiotics to present arguments about the course of twentieth century art.\nIt should be noted that the real span of the course is the 1900s to late 1960s, with brief mentions of the Pictures generation and some later Minimalism and Concept art. The textbook, of course, extends well into those decades. (Even if you don't take this course, I would recommend the textbook, which has gorgeous illustrations and engaging prose. Krauss is one of the four authors.) Additionally, in terms of content, there is no real coverage of post-Impressionism, but Cézanne, Gauguin, van Gogh, and Seurat are all mentioned, so you would be wise to read up on them a little before taking this class. Otherwise, a simple willingness to learn—and at times to grapple with Derrida and Foucault—is more than enough.\nKrauss' lectures, while engaging and illustrative, were often short—sometimes even just 30 minutes long. I never found them hard to follow, as other reviewers did, but it is frustrating to hear a teacher talk about cutting content because the semester is too short and then end class halfway through each day.\nAs for my TA, I have only the highest praise. Nick came prepared every day with a PowerPoint and a clear lesson plan. He was easily available outside of class and via email, and he led discussions in a way that was both open and productive, guiding us just the right amount.\nWorkload:\nOne-hour midterm, in section (slide IDs, comparison essay). Two-hour final (10 slide IDs, three comparison essays, one long essay). One 500-word review of an exhibition at MoMA. Weekly readings (completely manageable, always enjoyable, sometimes dense).\n"
        },
        {
            "course_name": "20th Century Art",
            "review_date": "April 20, 2016",
            "review_content": "\nKrauss is one of the most reputable art historians of our time. I am so glad that I got the opportunity to take her class. Sometimes her lectures are difficult to understand, and there may be some blatant topic that was not fleshed out enough and everyone wants to ask a really blatant question about it, but at times no one does because it can be intimidating. Yet when she is on point, she is one of the (if not the) best lecture teachers I have ever seen. She points out numerous theories on artworks that you may have previously thought could never connect. Such an amazing class, I would highly recommend it.\nThe TAs usually control your grades, so it all depends on whether or not you get a good TA. Luckily, my TA was completely understanding and AMAZING.\nSometimes the discussion sections can get boring because no one reads, but if you read they should be almost as exciting as the lectures.\nIt is manageable to get an A- on the exams by just studying the powerpoint and terms list (they provide a powerpoint of all of the artworks you could possibly need to know).\nThe textbook for this class is by far my favorite I have ever read. Period. \nIt's written by Krauss and some other art historians, and if I discovered it earlier I would have read it on my leisure time. I usually don't like reading extensively, so this gives you an idea.\nWorkload:\nAround 1-2 hours of reading a week. Two lectures that they do not take attendance at, and one mandatory discussion section per week. 1 midterm, 1 one page paper, and 1 final.\n"
        },
        {
            "course_name": "W3650 20th Century Art",
            "review_date": "April 14, 2016",
            "review_content": "\nher lectures are pretty scattered and short.  its hard to follow what she's trying to say as she breaks of sentences in the middle and rarely finishes the point she's trying to make.  she shows a ton of slides each lecture but rarely says anything meaningful about them, so you have almost no idea what will be relevant for the midterm/final.  you learn most in the discussion sections/through the reading.  if you're looking for a class where you can shop online/not show up to lecture and only learn through googling, the readings, and discussion section then this is a great class for you! only one short paper and a midterm/final, so relatively easy in terms of course load.  i love art history but this was probably my least favorite class in terms of i didn't learn much at all and was completely uninspired by the lecture material \nWorkload:\n1 1-2 page paper\n1 midterm\n1 final\n\n"
        },
        {
            "course_name": "20th Century Art",
            "review_date": "December 16, 2005",
            "review_content": "\nRosalind Krauss' lecture was the most worthwhile class I took at Columbia. Yes, sometimes she isn't quite \"there\" and her lectures can be scattered and short. But on days when she is with it she is incredible. And the readings for the class (almost all written by Krauss and her \"October\" friends) are some of the most exciting, provocative things you will ever read in scholarship. She will shoot you down if you ask stupid questions in class (but only if the questions were really, really stupid), but she is far from being the monster many claim her to be.\nAlso, specifically for Art History majors, her class provides the rigour some of the more \"wishy washy\" courses profoundly lack. She is both a brilliant formalist and uses lots of \"infamous\" french theorists but in a manner that is convincing, necessary and intelligent. \nFor non Art History majors, her approach is anti art-hum drivel and can even appear to be daunting. However, armed with the most basic dictionary of literary theory terms and a good TA, you should find the course fine, and extremely worth it. \n \nWorkload:\nPlenty of essays. Some can be quite dense, but you will want to do them. \n"
        },
        {
            "course_name": "20th Century Art",
            "review_date": "November 09, 2004",
            "review_content": "\ntook the class with her three years ago.  I am writing this so that all of you who don't realize how lucky you will be to sit through her so-called 'hodegpodge' will do so.  Take her course come spring; she's amazing and hilarious.\nWorkload:\nsome crazy theory, midterm, final, paper.  \n"
        },
        {
            "course_name": "20th Century Art",
            "review_date": "August 30, 2003",
            "review_content": "\nYeah she's a bitch, but unless you are a grad student she won't even have time to put you down. Otherwise she's writes brilliantly, teaches a little less brilliantly and is deadpan funny on occasion. I fell asleep in some of her classes but I'd take her class again given all that I know now about her.  \nWorkload:\nAverage reading load, 1 paper, 2 exams.\n"
        },
        {
            "course_name": "20th Century Art",
            "review_date": "December 29, 2002",
            "review_content": "\nGive me a break.  Rosalind Krauss' 20th century survey course is a joke.  Her lectures consist of a hodgepodge of extremely confusing and arcane arguments taken from essays she wrote 20 years ago.  Even the TAs can't  make sense of what she's saying...\"yeah, I can't really explain why she would say that\" was an often heard refrain in our section (sections are mandatory).  She's also an unbearable snob, communicating every syllable in a very superior tone of voice, and name drops like it's her job.  Scornful of any ideas that conflict with her own, either those proposed by other academics or by students, she is hostile to student questions or disagreements.  She doesn't show up to many of the lecture and, when she does, she often lectures for 45 or 50 minutes and then calls it a day.  Or fields questions from the audience and subsequently engages in hand-to-hand combat with dissenters.  Many hardcore 20th century art students swear she is god...for those of us who aren't already pretentious 20th century art fans, however, the class is unbearable.\nWorkload:\nMidterm, paper, final.  In our class the syllabus originally stated that there would be two midterms, two papers and a final but the requirements (and the readings) were changed over the course of the semester.\n"
        },
        {
            "course_name": "20th Century Art",
            "review_date": "April 30, 2002",
            "review_content": "\nProfessor Krauss is incredible. Each of her lectures brings me to an intellectual orgasm. Her knowledge of twentieth century art is unfathomable, and she presents it in a captivating manner. This is by far the best course I have taken at Columbia. \nWorkload:\nThe workload is not bad. Be sure to attend every lecture; they are the most important part of the course.\n"
        }
    ]
}