{
    "prof_info": [
        {
            "prof_name": "Ruth Rosenberg",
            "prof_id": 3122,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "January 08, 2007",
            "review_content": "\nShe is a pretty solid teacher.  Knows a lot about music, but teaches at the perfect level, as she knows the class is a requirement and than a lot of us don't know much (or anything) about music. \nAssigned reading/listening for each class, but I never did them (aside from skimming sections on major periods the night before the exam).  The stuff covered for exams was always discussed in class.\nFor exams, you're expected to know major points and defining features of musical movements, Names (including movement) of pieces as well as the composers, and vocabulary covered in class.  The first midterm is pretty indicative of the next midterm as well as the final... to study, make a playlist and put it on random & repeat until you can identify names & composers.  Also, review notes, and make a list about each composer, each musical period (Romanticism, Classical, etc.), and vocab words discussed in class. \nNot a difficult class, and you come out learning a reasonable amount.  I never did the reading assignments, and studied for exams the night before (or morning of) and did very well.\nJust make sure you write a draft of the final paper ahead of time so you can meet with her.  She'll tell you things to change about your paper that you may never even have questioned, which are good to know since she's the one grading it.\n(She also gave us extra credit opportunity.  10 points on a midterm grade if we wrote a 2-3 page review of a music event on campus.  We were allowed to do 2, earning up to 20 points)\nWorkload:\nreading/listening for each class (not really necessary), final concert review, 2 short midterms (35% total), final exam\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 06, 2007",
            "review_content": "\nOverall, Prof Rosenberg was a nice, fair, engaging teacher. I did not enter music hum with very high expectations, but Prof Rosenberg definitely did an excellent job at keeping the class interesting and catering to the many different knowledge levels in the class. her grading was fair as well. there were a few minor hiccups, like she assigned a lot of extra reading that we never talked about in class and that im pretty sure very few people did...but all of that im sure will be worked out as she adjusts to how long it takes to teach a bunch of non music majors about music. i wouldnt call her an AMAZING professor but she was very good. i'd recommend her.\n"
        }
    ]
}