{
    "prof_info": [
        {
            "prof_name": "Anupama Rao",
            "prof_id": 928,
            "total_reviews": 25
        }
    ],
    "reviews": [
        {
            "course_name": "South East Asia II: Empire and its aftermath",
            "review_date": "October 10, 2016",
            "review_content": "\nProfessor Rao definitely seems to like what she teaches and that is extremely important if you're taking a history class; you don't want a professor who is a complete bore! This is a class in which you have to read a lot. There are a lot of texts that are quite dense to read and hard to get through but others that are simply fascinating. Sometimes you will be disgusted or indignant about something you just read. This is a class that makes you think and discuss. Although it might seem like a class designed for history students, it is accessible to all (if you put in the work!). Professor Rao truly seems to want all of her students to develop critical thinking skills and sets you on the right path to do so!\nWorkload:\nHeavy readings, two response papers, midterm and final.\n"
        },
        {
            "course_name": "Bombay",
            "review_date": "April 17, 2013",
            "review_content": "\nProfessor Rao is easily the best, smartest professor I've had between Columbia and Barnard.  She seems to know absolutely everything, down to the most obscure details and complex theories.  She always encourages each person in the class to participate in the conversation, and she seems so genuinely interested in what you say.  At times, she'll put you on the spot if she feels that something you said needs further explaining or if you haven't said anything at all.  Very rarely will she disagree or say you're wrong, but if she does, you know you must really be off base.  She's incredibly kind and encouraging, has a great sense of humor and just the right amount of snark.  Yes, the class is a lot of work, but she really wants you to do well and not only to understand the information, but to enjoy it as much as she does.  I think it would be hard not to be interested in what she's teaching in this class partially because of the subject but mostly because of the way that she teaches it.  She has a really unique style of speaking and an even more unique way of approaching information.  \nThe spatial map project was very cool--she was very vague in giving directions, which she generally is not, but was also pretty lax when a bunch of us showed up with I-don't-know-what.  She also does a thing when it's time for a graded assignment where each person in the class talks about his/her topic and then gets criticisms from the rest of the class.  She likes to call it \"tough love.\"  It was pretty intimidating at first, but it's really helpful.  \nIn short, the class is a little intimidating at first but once you get into it, you'll be so grateful you didn't drop it.  Someday, I hope to buy Professor Rao a drink and call her by a nickname.  She's just that good.  \nWorkload:\nReading heavy and 2-3 page weekly responses, a \"spatial map\" project, and a final paper (no midterm, no final)\n"
        },
        {
            "course_name": "Bombay",
            "review_date": "February 19, 2013",
            "review_content": "\nAn incredible class. Wonderful theorist. Incredibly involved in her students' personal interests--she helped me, a year later, to be accepted to a Barnard trip to Mumbai. \nClass begins with theory (LeFebvre, Marx) and moves into history of Bombay and ends with modern pieces, creative nonfiction, and films. An enjoyable and immense learning experience about one of this decade's most important cities.\nThis class is ideal for someone with an asian studies/theory/urban studies background who is particularly interested in learning about the global south, colonialism and labor. It is not by any means an easy class and Professor Rao wants to know each student personally.\nWorkload:\nReasonable-- heavy on reading. Professor Rao expects a lot: lots of reading, weekly 2-page responses, 9 page midterm, 15 page final paper. \n"
        },
        {
            "course_name": "Bombay",
            "review_date": "October 05, 2012",
            "review_content": "\nProfessor Rao's class Bombay was absolutely wonderful and I recommend taking it whenever it is offered again. Rao is one of the most engaging professors I have met at Columbia, she is enthusiastic and present in class in a way that is quite rare at Columbia. The class was very small (6 people) which turned out to be a great thing as we did collaborative work that once again, I had not experienced in many other classes. As a class we were also part of an event on Bombay at Columbia; and Prof. Rao was very excited about using different kinds of media. I forgot to mention that Rao, apart from actually caring about the students, is also brilliant. Although the class was specifically on Bombay, which I have no direct interest in, it made me think about urban spaces, urban history and the related theory in a way - even as a history and anthropology major - I had really not considered. My senior thesis which was already part written became heavily influenced by it. In short, take this class! \nWorkload:\nHeavy reading. The theory at the beginning (Lefebvre) can be overwhelming, but it slowly turns into very dense history that is also overwhelming in a different way.\nWeekly responses - but we decided to do 'timelines' and other projects. \nMid term and final paper\n"
        },
        {
            "course_name": "Gender and Empire",
            "review_date": "August 25, 2008",
            "review_content": "\nBy far the best teacher I've ever had at Barnard. Rao's enthusiasm and rich vocabulary will make you jealous. She is downright inspiring. While I only took this class for a general requirement, I walked away with so much more. Take this class! \nWorkload:\nnot bad, some heavy reading but she doesn't always check. However...you do have discussions and she may put you on the spot. 2-3 papers, 1 essay-like final \n"
        },
        {
            "course_name": "Gender and Empire",
            "review_date": "February 24, 2008",
            "review_content": "\nProfessor Rao can be incredibly intimidating, simply because she's so brilliant. She literally knows everything about everything. This is both good and bad for you. It's bad because her mind works a mile a minute, and sometimes it can be hard to keep up with her in lecture because she's just thrown out several complicated concepts in the space of a couple minutes. It's good because you learn SO MUCH from this woman. South Asia is her area of expertise, but she can lecture in just as much detail and with just as much nuance on slavery in the Americas, or sex workers in colonial Nairobi. Because she is so brilliant, it can be really intimidating to speak up in class, and I often felt like she put me on the spot. But this is because she really challenges you to articulate your ideas clearly and back up your opinions. And despite all of this she is actually very approachable outside of class. If you are interested in the topic, and/or if you want to improve your speaking and argumentative skills, I highly recommend that you take this class.\nWorkload:\nA LOT of reading, and you should do your best to do all of it to get the most out of this class. Two papers, a group presentation, and a take-home final. \n"
        },
        {
            "course_name": "Gender, Caste, and Nation in South Asia",
            "review_date": "April 25, 2007",
            "review_content": "\nProfessor Rao is extremely knowledgeable, really easy to get along with, and A great way to learn how to read theoretical historical texts. I didn't find her to be as tough as previous reviewers did. She is definitely more aware of the fact that her students have other classes and commitments outside of her classroom, but is deeply committed to stimulating nuanced discussions. At times the class discussion went on forever. Not the best class to take to get hard facts about South Asian history. Her approach is definitely a combination of anthropology and history.\nWorkload:\nFairly heavy reading; 2 short papers; a few postings; take-home final; class discussion and attendance. \n"
        },
        {
            "course_name": "Gender, Caste, and Nation in South Asia",
            "review_date": "January 08, 2007",
            "review_content": "\nSo, I was thrown into Prof. Rao's course as a 2nd trm freshman (the class was full of jrs and srs).  I got my first paper back and got a B or a B- or something like that.  But, Prof. Rao is an AMAZING teacher.  She assigns tons and tons of reading and shes very strict about lateness and stuff.  But, if you work hard in her class it is possible to make a complete turnaround.   Her entusiasm and knowledge completely shines through and shes been my favorite prof at columbia/barnard so far.  Yes, it is a lot of work and its not an easy A.  But, shes fair.  Despite my botch ups in the begenning she gave me an A-.  So, take the class...shes really inspiring.  \nWorkload:\nA LOT OF WORK.  3 papers, the readings are insane.  She says about 100pgs a week...its more lk 300 pages a week so be prepared.  You can get away with not doing some of it but she values class participation....so be prepared.  Don't take this class and expect an easy A...but having said that shes fair and gives people second chances...rare for a clg prfsr.\n"
        },
        {
            "course_name": "Capitalism, Colonialism, & Culture",
            "review_date": "December 18, 2006",
            "review_content": "\nProf Rao is insane.  And she's also one of the best professors I've had at Barnard.  The readings were excellent, her lectures were amazing, the discussion was productive and on-point.  This class is an excellent look at colonialism and post-colonialism in different areas of the globe: Batavia, South Africa, and Haiti, mostly.  We read a mix of theoretical and historical/anthropological texts: the Wretched of the Earth, History of Sexuality, Country of My Skull, Avengers of the New World... all really fascinating, and Rao manages to tie everything together and create a coherent narrative throughout.  Excellent!!\nWorkload:\nAn unimaginable amount of reading--and it's dense stuff.  3-page postings every three weeks.  Two 7 page essays for a final.  And she's a pretty tough grader.\n"
        },
        {
            "course_name": "Gender, Caste, and Nation in South Asia",
            "review_date": "May 24, 2006",
            "review_content": "\nAnu is the best professor I've had at Columbia.  She presents cogent lectures that deftly mix theory with dry history and anthropology.  Some students find her lectures to be a little hard to follow bc she talks very fast and jumps from topic to topic.  Since she has a dual PhD from Michigan in Anthro and History, she basically knows everything.  Her purview extends far beyond the boundaries of south Asia; she focused on post-colonialism in general, so she can talk about the Caribbean and Africa in equal depth.   She pulls really nuanced discussions out of students, which is enjoyable. She's also just wonderful to be around, always joking around and definitely very approachable.  \nWorkload:\nPolitical Modernity had an unbearable amount of reading, but you could choose when to write you papers--essentially you had four options and only had to write three.  G,C and N had a ton of reading also (sometimes up to 450 pps/wk) and three big papers.  She grades according to your familiarity to the material, so if you come into one of her classes cold-turkey, she'll take that into consideration.  \n"
        },
        {
            "course_name": "Gender, Caste, and Nation in South Asia",
            "review_date": "May 12, 2006",
            "review_content": "\nAs previously noted, Professor Rao is pretty insane, in mostly good ways.  She knows an insane amount about her subjects, conveys an insane amount of information during her lectures, and  she is able to answer questions and provide insights insanely well (okay, very well).  Unfortunately, she also gives an insane amount of work.  She does try to manage it a little bit, i.e. make some weeks lighter than others, but there will be weeks when you will be expected to read 300 pages.  The actual amount of written work to be handed in isn't all that bad, but I found her paper topics very narrow and difficult to respond to.  For one paper, she asked us to \"trace the argument\" of a 300 page book in 5 pages.  She is very genial and understanding about turning in things late, which is nice, and sometimes she's just goofy, which is cool, but she's very serious about her work.    She also will bombard you with multiple emails a day about everything under the sun.  Overall, an enjoyable class with lots of reading, but you'll learn a lot if you put the time in.\n \nWorkload:\nLOTS of reading, not too much writing.  2 5 page papers, a few postings, and a 12 page take-home final of six 2 page essays\n"
        },
        {
            "course_name": "Gender, Caste, and Nation in South Asia",
            "review_date": "April 30, 2006",
            "review_content": "\nO my goodness, I love professor Rao! Hear she's hard? Hear she's hella demanding? Hear she assigns a lot of reading? IT'S ALL TRUE. But as long as you aren't taking this class or any of her classes just to fulfill a requirement you should have a great time! She is completely adorable, incredibly enthusiastic, quite brilliant, and all about the layers--if you like history that's linear like a story, this may not be the class for you. Think anthro meets history meets gender studies. Rao rocks my socks.\nWorkload:\nlots o pages of reading all the time, but minimal writing (two 5 pagers)\n"
        },
        {
            "course_name": "Gender, Caste, and Nation in South Asia",
            "review_date": "April 28, 2006",
            "review_content": "\nSweet lady but disorganized like anything. Grades harshly, has no clue what the standard is, hates multiple choice with passion, has deeply-held opinions that tend to eclipse those of other historians, and just unnecessary in order to learn. Taking her was a mistake, unnecessarily tough, unclear about what her demands are, and subjective without room for discussion. \nWorkload:\nCrazy\n"
        },
        {
            "course_name": "Gender and Empire",
            "review_date": "December 28, 2005",
            "review_content": "\nRao is a brilliant professor with an engaging teaching style and a flair for critical theory.  I found her to be very approachable - - she always made time for me despite her busy schedule.  \nThis course, however, is not for those who are looking for an easy A.  Style without substance will not score any brownie points.  I was a bit intimidated by my lack of a Women's Studies background, but found that Rao valued the logic of one's thoughts and the application of theory much more than casually throwing around feminist jargon.  All in all, I found her to be challenging but exciting...by far one of the best classes I've taken this semester.\nLast word, take this class, but only if you're actually interested in the subject.\nWorkload:\nWeekly readings (quite a bit of reading...100-300 pages a week...crazy, I know), bi-weekly response postings and a 20-30 page paper at the end of the course\n"
        },
        {
            "course_name": "Colonialism & Nationalism in South Asia",
            "review_date": "December 20, 2005",
            "review_content": "\nThough she is friendly, Anupama is probably the most insane teacher i have ever encountered.  She assignes approximatley 3000 pages of reading for the semester, will add on random weekly discussion sessions that meet at 8 or 9 PM and are essentially just a third lecture for the week, and, best of all, will send you about 500 emails every day explaining new assignments and more readings that we are to do.\nBasically there are two things to know here.  You will, based on the sheer amount of information that is pumped into you during her lectures, learn an unbelieveable amount from this woman.  Yet at the same time, a term paper due the day after Thanksgiving, a 600 page coursepack along with 3 other mandatory books might really not be worth it.  Don't think that i completley hated this class but i doubt it was really worth the whole effort\nWorkload:\nRediculous.  A 1000 level class with as much reading as an 8000 level.  The final and midterm were so long that no one could finish.  I wrote about three blue books for the final and 2.5 for the midterm...absurd.  1-200 pages weekly reading along with the books.  1 term paper but was due right after thanksgiving.\n"
        },
        {
            "course_name": "Colonialism & Nationalism in South Asia",
            "review_date": "December 19, 2005",
            "review_content": "\nRao gives a lot of work, yes, but more importantly, she is an amazing professor.  She covered so much in this lecture -- which ended up more like a seminar -- and most of it was fascinating and very relevant to the current political situation.  She's a great lecturer, engaging and enthusiastic, and obviously loves the material, but also is very open to questions and to changing her presentation if it's not working for people.  She obviously really cares about her students and this class was a wonderful experience.\nWorkload:\nlots of reading, most of it interesting; 3 essays, though she pretends she's only giving one; a hand-cramping midterm and final\n"
        },
        {
            "course_name": "Modern South Asia",
            "review_date": "April 27, 2004",
            "review_content": "\nShe will kill you if you aren't prepared to do the readings and spend hours and hours on the midterm and final. But hers was my favorite class at Columbia or Barnard. She is amazing -- brilliant, nice, approachable, understanding if you need an extension. I didn't find her to be such a hard grader. If you show that you're doing the reading and trying, you'll do well even if you're confused every lecture. I learned SO much in this class. \nThe reading is dense and filled with untranslated terms but she will help you if you bring it up to her.\nTake a class with her before you leave.\nWorkload:\ntake home midterm, inclass final, 300-400 pp reading per week, write-ups of some of it.\n"
        },
        {
            "course_name": "Modern South Asia",
            "review_date": "January 17, 2004",
            "review_content": "\nThis course is really hard, and Rao is really demanding, but you will learn a lot.  Do NOT attempt to take this unless you are interested; it isn't an easy MC credit.  Rao is a tough grader on exams (not so bad on the paper) and takes attendance seriously.  Her lectures can be a bit disorganized, but she knows the material really well, and teaches a lot about historiography as well as South Asian history through the colonial period.  She appears to force the TA to grill you during section, so be prepared and do the reading.  All in all, hard but good, although she's a better (read: amazing) teacher in seminars.\nWorkload:\nHeavy-ish reading.  2 map quizzes.  A HARD midterm and a pretty hard final.  One short (5-8ish) page paper, graded generously.\n"
        },
        {
            "course_name": "Modern South Asia",
            "review_date": "October 28, 2003",
            "review_content": "\nI went in knowing nothing about the region, and came away with a postmodernist perspective on South Asian history and politics. Rao is absolutely wonderful - she's energetic, brilliant, speaks quickly and extremely kind and approachable. This class taught me more about historiography than anything else - looking at the way that history is presented, Rao will challenge all mainstream perceptions and then put them back together. Warning: there is lots of work, and even more material to get through. It is completely worth the energy and effort you put into it. Highly recommended class. \nWorkload:\ntons of reading. midterm and final are really tough. a response at some point. mandatory discussion sections. totally worth it. don't even try to skip, or you wll get left behind. \n"
        },
        {
            "course_name": "History and Human Rights",
            "review_date": "April 11, 2003",
            "review_content": "\nThis is an amazing class, really a gem in the history curriculum.  Rao ties together a bunch of areas (South Asia, Indonesia, the Carribean, Africa, the US South ...) to present a bunch of different historical frameworks for understanding the development of capitalism out of colonial relations.  CU's history department sucks at teaching theory -- Rao is the exception.  So long as you have some background (i.e., read Marx in CC), you'll learn a lot about different narratives historians use to describe change.  The discussions were fantastic -- Rao would start with a sometimes-overcomplicated description of some different thinkers or theories, and then the class would try and pick apart the reading.  The readings themselves were long, dense, and heavily theoretical; a few really sucked, but most taught me a lot.  Warning: you can't slack in this class, but if you're a history major, take it.  Rao is an incredibly sweet woman who has her shit together, knows a ton about several regions and many areas of theory, and really cares about actually teaching, as opposed to just writing and getting famous (although her writing's good, too).  And the prev. reviewer is right, she does talk like a postmodern valley girl.\nWorkload:\nLots and lots and lots of reading, weekly responses, and 2 papers (research or 3 incredibly complicated essay questions).  Not a hard grader as long as you try, but it's a lot of very dense, complicated reading.  Some great guest lectures in which you get to watch the history and anthro illuminati take out their aggression on each other.\n"
        },
        {
            "course_name": "Modern South Asia",
            "review_date": "April 01, 2003",
            "review_content": "\njust don't do it.  i took a history class of her's to fill a requirement- huge mistake.  she makes little sense and is hard to follow.  she also doesn't erase the board.  if you really love history i guess she might be for you but if you don't, save yourself the trouble.\nWorkload:\nHEAVY...lots of reading\n"
        },
        {
            "course_name": "Modern South Asia",
            "review_date": "February 27, 2003",
            "review_content": "\nAnupama Rao -- you call her \"bad\"? I DON'T THINK SO!!! This charming, young professor is incredibly energetic, engaging, super NICE, and simply BRILLIANT. I agree that her organizational skills need some work but if you're confused, all you need to do is ask her to clarify some points during lecture...she's extremely open to questions. Unlike most classes that approach history in a linear, boring, conventional manner, Prof Rao knows how to engage us in a broader, more theoretical picture of history by persistanly asking us \"what is at stake?,\" \"why is this important,\" etc. This is a great class if you're trying to look at history CRITICALLY. I absolutely fell in love with Indian history after this course -- and Prof Rao too!!!  \nWorkload:\nTONS of reading, but extremely rewarding. TA was super helpful. 1 map quiz, midterm, paper, final, weekly discussion sections. \n"
        },
        {
            "course_name": "Modern South Asia",
            "review_date": "February 13, 2003",
            "review_content": "\noh my lord. what a bad professor. being young, rao feels like she has to prove something and thus talks in circles all day long.\nshe doesn't understand  any simple ideas.  and in order to get anything across to her you have to sound just as confusing as she is. ugh.\n\nWorkload:\ntons of reading which she makes you photocopy - 300 or so pages.\n\n"
        },
        {
            "course_name": "Modern South Asia",
            "review_date": "May 09, 2002",
            "review_content": "\nShe knows a lot, and you'll learn a lot. No question about that. But her organizational skills leave much to be desired. She showed up late to class almost as a habit and then told the class that tardy students should not show up at all. She would outline a five-point lecture and then an hour and ten minutes later (with only five minutes left in class) would still be in the middle of the first point. While her organization wasn't superb, she was enthuastic and, while opinionated, open to others' viewpoints. \nWorkload:\nThere seemed to be a lot of readings on the syllabus, and she'll weigh your backpack down with handouts. But not all of the readings are necessary, and reading the basic chronological historical text and picking important other readings worked fine for me. There was a take-home midterd and an in-class final, both of which were straight-forward and very easy if you had payed attention at least part of the time and reviewed your notes. There were little in-class writings here and there, but overall the courseload was very managable and proved to be quite informative\n"
        },
        {
            "course_name": "History and Human Rights",
            "review_date": "January 21, 2002",
            "review_content": "\nUnlike most history classes, that merely present facts in an interesting manner, Rao's class teaches the gritty, complex theory that is lacking in the history department. For example, her class on history and human rights does not talk about HR in the traditional way, but challenges it because it was a part of the same liberal project that created slavery and colonialism. She really looks at the big picture, and talks about how different historical paradigms work in different times and places. This class not only used traditional histories, but Foucault, Hegel and the subalterns. Her specialty is colonial and post colonial studies in South Asia, but she also knows a lot about other sights of colonial domination. I felt that Rao really filled in the gaps in my education and introduced a lot of tough ideas. The best part is that she is not only brilliant, but really nice, with speech patterns that can only be described as well educated valley girl (like, come on guys, power is diffused!). She is always smiling and treats all questions with respect. That being said, her class is very difficult, both concept wise (esp. if like most history majors, you haven't done much theory) and work wise. But worth it. \nWorkload:\nFor a seminar, she gave out a lot of readings and graded hard. Expect up to 500 pages a week and extra class meetings. As she is a young teacher, her organization needs worth but it is a small price to pay to be touched by her insights. For a seminar there was a midterm and final paper, as well as weekly responses. The papers are research optional (yay!) but still really dificult. \n"
        }
    ]
}