{
    "prof_info": [
        {
            "prof_name": "Stefan Andriopoulos",
            "prof_id": 1135,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 20, 2010",
            "review_content": "\nStefan is a wonderful professor! I enjoyed his class and learned a lot from it. He may not be the most enthusiastic or bubbly person - but he is fair and straightforward. I definitely appreciated that. He likes to stick to the text, and has a lot of background knowledge. He knows ancient and modern Greek (along with German) so he raises some interesting points that other teachers wouldn't. His points are interesting (he REALLY knows his stuff) and manages to lead good discussions that are text-based and lead to important themes about the books. He also gives you a five minute break in the middle of class, which is much needed and appreciated. Before you read, he tells you what to \"look for\" or \"pay attention to\" -- do as he says, because this stuff is what will be discussed in class. This stuff also appears on his pop quizzes - I think we got about 4 the whole semester? Anyway, he is understanding, kind, and has a good sense of sarcastic humor. Definitely take his class.\n\nWorkload:\nEasy as long as you do the readings. 2 papers (around 5 pages each), a few pop quizzes mixed in with your participation grade, reasonable and fair midterm/final. Stefan really prepares you for the exams -- just do the readings and pay attention in class.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "September 05, 2006",
            "review_content": "\nStefan is a great professor. He actually knows ancient and modern greek, so his insights into the texts are really helpful. He lectures more than discusses but you really learn a lot from him. It is easy to do well in the class as long as you keep up with the reading. He is also always available to talk or for help in his office. Go talk to him, he's a good professor to have a relationship with. \nWorkload:\nReading2 papersmidterm and final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 06, 2005",
            "review_content": "\nStefan is a great Lit Hum prof.  At first I wasn't sure that his class would be an interesting one, or that he'd be an interesting person, but over the course of the semester I grew to like Lit Hum more and more.  Stefan has a very unexpected sense of humor; if he tells jokes, it usually takes the class a few minutes to realize that he wasn't being serious.  Maybe this made some people uneasy, but I thought it made the class more interesting overall.\nThe only thing I didn't like about Stefan's class is how unless we ask questions or start a discussion on our own, he'll basically lecture us and tell us what the important things are, and then open the floor to discussion.  Sometimes this approach was good, and sometimes it wasn't, depending on the text we were discussing.  I think he always brought up interesting topics for us to discuss, and he certainly made me think of all the texts in a different way because of the different perspective that he provided.\nWe only had to write 2 papers over the entire semester, in addition to 3 pop quizzes which weren't hard, only making sure that you'd 1. done the reading and 2. paid attention during the previous class.  He's definitely a fair grader, and very approachable outside of the classroom. \nWorkload:\nIn addition to regular Lit Hum readings, 2 5-page papers, 1 midterm, 1 departmental final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 19, 2004",
            "review_content": "\nStefan's a really good professor for the first semester of Lit Hum (he's on sabbatical for spring 2005). He has a really deep understanding of the Greek texts, but when we got to the Bible, class discussion became less thorough. He grades leniently on the papers, even if the comments can be a little harsh and hard to read (my one thing against him is his handwriting). Also, he's got quite a nerdy demeanor to him, but you can take that either as good or bad.\nWorkload:\nNothing added to the syllabus. easy midterm, decent final, occasional pop quizzes that count towards your participation grade, and 2 straightforward papers.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 10, 2004",
            "review_content": "\nI definitely don't think Prof. Andriopoulos is the best Lit Hum teacher, but I'm sure he is not the worst. I didn't think he chose the best topics for discussion in class. The books are fairly interesting, but he often seemed to focus on uninteresting parts of the books. He was also a little harsh on students' in-class comments--he rarely agreed with what was said by students in the class, and when he did agree, it was often with some of the more silly comments. I also found his grading to be a little unfair. He finds many sentences \"awkward,\" even when they are perfectly acceptable. He is harsh in his comments, but not too bad with the actual grade.\nWith all this being said, Prof. Andriopoulos is a pretty good Lit Hum teacher. He knows the material very well. Although his class can be boring, he is always willing to have students participate. As the previous reviewer said, he is also a very nice guy.\nWorkload:\nPretty normal for Lit Hum. He only added \"Exodus\" to the syllabus. 2 papers (5 pages each), midterm, and standard Lit Hum final. He also asked us to meet in small discussion groups 1 time during the semester. There were also 2 pop quizzes on the readings early in the semester. Overall, not too bad, but you should do the readings.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 21, 2002",
            "review_content": "\nStefan is a really NICE teacher. He is extremely understanding and always gives extensions when needed. His accent is a little hard to decipher at first but he really does have interesting stuff to say. Our classes were pretty boring because he didn't make anyone speak so if no one offered he spoke. I would recommend him to anyone shy to speak in class or anyone looking for an easier way to get through Lit Hum. \nWorkload:\nMidterm, Final, Three 4-page papers, about 2 pop-quizzes. He also didn't add any books to the curriculum.\n"
        }
    ]
}