{
    "prof_info": [
        {
            "prof_name": "Katherine Isard",
            "prof_id": 1850,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "February 09, 2010",
            "review_content": "\nI have to say that Masterpieces of Western Art was the first of the core classes I took, and there was no doubt in my mind that I was in a room full of students who would have rather been somewhere else. The first thing that Professor Isard did was try to move the mentality from requirement to discovery, and I must commend her for doing it very well.\nThis course covers centuries of art and architecture, and she did a good job of connecting historic factors with artistic implications, and she challenged us by having us examine works of art with both analytic and emotional responses to help divulge deeper understanding or what these pieces of art meant within the context of the artists who created them, the society where the art was exposed and to us now.\nShe is a fun lecturer, but she can be impatient if she detects that students are shlubbing. She's at her best when she has you at a museum in front of the actual work where she becomes romantic and authoritative.\nWorkload:\nShe has students write regular short papers about what is being covered in class, and she requires students to draw and replicate works of art, which was at first irksome, and then became pleasurable. The midterm was no fun because it required the memorization of all of that Greek architectural filigree but the final is fun because it involves identifying art and creating a substantial essay comparing works of art.\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "August 05, 2009",
            "review_content": "\nKate has a cheery personality and is a good lecturer. I enjoyed her class and had a good rapport with her, but I was shocked when I received my final grade, which was the lowest I've ever seen at CU. The issue is that she's a PHD candidate, not an actual professor, and doesn't understand how the Columbia grading system and the \"columbia fail\" works. You will easily see a B-range grade without some serious effort and attendance, and lower efforts could possibly result in worse!\nWorkload:\nBrief weekly assignments, museum trips, 3 papers, midterm, final\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "August 04, 2009",
            "review_content": "\nKate is a stubborn, childlike teacher who will give you a good grade if you tell her what she wants to hear. she leaves no room for creative interpretations or alternative ideas, so you have to give the answers that she wants to hear and basically regurgitate information to get a good grade. for that reason, her class is pretty easy, but you won't learn anything. \nall in all, she is probably one of the worst professors i've had at columbia, and also one of the easiest. she allows no critical thought in her class, just straight up memorization and vomiting of information without any excess knowledge or analysis at all. she's pretty easy if you can sit through her trying to act out every contorted greek sculpture's pose in front of the class instead of providing any real stimulating background information or context for any of the works. if you don't care about art, don't mind butchering all art history, and are willing to just regurgitate information without critically engaging with it in any way, then this is the class for you.\nWorkload:\naverage/ easy: 3 five-page papers (one ungraded visual analysis, one graded visual analysis and one graded comparison), midterm, final, a few short reading responses and one easy drawing self-portrait project\n"
        },
        {
            "course_name": "Masterpieces of Western Art (Art Humanities)",
            "review_date": "December 13, 2003",
            "review_content": "\nKate was really enjoyable to have for a professor, the final, paper, and midterms were all fairly easy and she is easy to talk to.  She made the class intresting and even brought us back candy from Rome.  I would recomend her\nWorkload:\nmidterm, final, 4 essays, the first one is not graded\n"
        }
    ]
}