{
    "prof_info": [
        {
            "prof_name": "Margaret Vandenburg",
            "prof_id": 667,
            "total_reviews": 49
        }
    ],
    "reviews": [
        {
            "course_name": "Tipping Points",
            "review_date": "December 27, 2016",
            "review_content": "\nTAKE THIS CLASS! \nIf you are an incoming first-year at Barnard, there's no better seminar than this one. She is amazing and the readings are pretty cool. But the readings shouldn't even matter on your decision because it is MARGARET VANDENBURG. She is the most kind, funny, INTELLIGENT and engaging professor ever. She will make you feel more intelligent than you think you are by always encouraging you to speak. She will destroy every concept you think you have (like \"do you believe in nature?\" \"like, trees?\" \"yes, do you believe in it?\" I USED TO NOW I DON'T KNOW QUEEN  ???) and you will leave the class a lot smarter I promise. I can't even put into words how amazing she is. Fair grader and her comments are actually helpful. The class was so much fun and I wish I could take it again. She even took us on a class field trip on reading week just because. My writing improved and you are pretty free to explore something you are interested in in this class. Take the class, you won't regret it!\nWorkload:\nI got an A on the class. 2 essays about the texts and books we read in the period before the due date, 1 essay identifying a tipping point and 1 essay \"solving\" that tipping point. All the deadlines are spaced out somewhat evenly. The first two have a first draft that you have to hand in and she'll correct it but not grade it. She drops the lowest grade out of the 4. About 5 books to read and a bunch of like 5 page texts. Not a lot of reading but enough to be necessary to set a time to do it. Do the reading! \n"
        },
        {
            "course_name": "Modernism",
            "review_date": "December 08, 2016",
            "review_content": "\nThis class was really engaging. The class is comprised of reading literary theory and using it to analyze modernist texts. I believe that Professor Vandenburg is very good at explaining concepts in a way that makes them easy to understand, but there are certain times where she mentions points that are not necessarily covered in class and are sometimes hard to understand if you don't have the basis down already. That being said, she is very open to meeting and discussing papers and concepts during her office hours. \nI would recommend this class if you're looking for something to fulfill your literature requirement, and you enjoy modernist pieces. The concepts can sometimes be difficult, but overall the workload is manageable (midterm paper, final paper, 2 page take-home final). \nWorkload:\n1 4-5 page midterm \n1 7-8 page research paper\n1 2 page take home final\n"
        },
        {
            "course_name": "Postmodernism ",
            "review_date": "April 16, 2015",
            "review_content": "\nProfessor Vandenberg is a genius. (Perhaps I shouldn't label her as one because she might argue that this sort of categorization is not only oppressive but a modernist notion that is no longer relevant following Barthes' Death of The Author). That being said, she operates on an entirely different level of intellectual thought.  Don't let the theoretical essays and texts she references (many that you've never read) deter you; with time it becomes easier to place the references within the framework of the assigned postmodern novels. The following quotes best articulate the heart of her lectures: \n\"To be human is to be unextended\" and \"The cure to postmodernism is love.\" \nWorkload:\nA lot of great reading. Two essays. A final. \n"
        },
        {
            "course_name": "Postmodernism ",
            "review_date": "April 16, 2015",
            "review_content": "\nProfessor Vandenberg is a genius. (Perhaps I shouldn't label her as one because she might argue that this sort of categorization is not only oppressive but a modernist notion that is no longer relevant following Barthes' Death of The Author). That being said, she operates on an entirely different level of intellectual thought.  Don't let the theoretical essays and texts she references (many that you've never read) deter you; with time it becomes easier to place the references within the framework of the assigned postmodern novels. The following quotes best articulate the heart of her lectures: \n\"To be human is to be unextended\" and \"The cure to postmodernism is love.\" \nWorkload:\nA lot of great reading. Two essays. A final. \n"
        },
        {
            "course_name": "Modernism",
            "review_date": "April 09, 2015",
            "review_content": "\nThis will be a very specific review. First I'll support the many, many previous reviews that attest to how incredible Vandenburg is as a professor, a teacher, and person. Her content is interesting and challenging without being impossible, and in addition, she is ALWAYS there for students outside of office hours. \nThe important additional claim that I want to make, however, is about how \"phallic\" or whatever her course is. As past reviewers have pointed out, Vandenburg likes Freud and Lacan, argues that Virginia Woolf embeds androgyny in To The Lighthouse, etc. The thing that people seem to forget is that while it's clearly true that \"androgyny\" is Vandenburg's main theoretical interest, she is not teaching Modernism because she loves imposing weird Freudian imagery onto literature. She is teaching Modernism because the Modernists ACTUALLY WERE a group of people who literally read and wrote about Freud ALL THE TIME, and WERE unhealthily obsessed with the phallus and escaping femininity (or, for the few women, with escaping the phallus). This can be attested to, if you don't \"see it\" in their books, by the actual books that the Modernists read, by their letters, etc. In other words, it might be that Freud isn't your cup of tea -- Cool. You don't have to be a Modernist. You should still probably read their works through, because they're fucking great.\nTL;DR: #sorrynotsorry if you thought that Virginia Woolf was someone you could comfortably read out loud in your book club over tea. Yes, that scene really is about ejaculation. \nWorkload:\nIf you sit in the back, you don't have to do the reading. She will suspect, however, that you might not be doing the reading.\n"
        },
        {
            "course_name": "Modernism",
            "review_date": "December 31, 2014",
            "review_content": "\nI took Modernism this semester and would definitely not recommend it. While Professor Vandenburg is probably one of the most brilliant professors I've had thus far at Barnard, I found it EXTREMELY difficult to follow her lectures. I really did not enjoy class and I felt like a ton of what she was saying was made up and was absolutely not something I could draw out from the reading on my own. I really did not enjoy this class - it is absurdly difficult.\nWorkload:\nAbout 1 book per week but it's not absolutely vital to have it read the book by class. 2 papers (one about 5 pages, one 8-10), and an in-class final (she tells you the essay question in advance)\n"
        },
        {
            "course_name": "Modernism",
            "review_date": "January 05, 2013",
            "review_content": "\nMargaret Vandenburg changed the way I think. Vandenburg's lectures and guidance on essays led me to understand and appreciate the potential for the transcendence of the violent and limiting system of binary opposition. Although her angle on the texts that we read focuses on gender and preaches a move towards androgyny, this notion of fusing opposites the create completeness can be applied to almost anything (i.e. race, time).\nMoreover, I disagree with reviews that say she is not open to different interpretations of the texts. People brought in many different ideas in lecture which she readily accepted and sought to expand upon. \nAs a grader, she is fair. For every essay you write EMBRACE AMBIVALENCE RATHER THAN FIXITY. Seriously. When in doubt, remember the underlying philosophy of the class is that the slipperiness of meaning and theory should be embraced rather than feared. She appreciates effort and deep thinking. Go talk out ideas in her office. She may seem intimidating on the first day but she is incredibly warm, understanding and interesting. \nDon't worry about the final. I studied for maybe 20 minutes and got an A. Just go over passages discussed in class. Doing well requires that you get your money's worth and GO TO CLASS! Also DO THE READINGS! \n\nWorkload:\nAbout a book per week. You don't need to read every one in crazy depth, just the ones you write about about. \n2 essays graded fairly. Plan ahead so you have time to discuss your ideas in her office hours. This was very helpful. The research essay is kind of confusing because she wants you to bring in two disciplines apart from literature, but she is more lenient about this than you would think. \nFinal is really straight foward and easy. IDs and an essay with the question given out weeks in advance. Just keep up with the reading as you go along and maybe make up some of it finals week if necessary. \nNot bad at all. \n"
        },
        {
            "course_name": "Modernism",
            "review_date": "January 01, 2013",
            "review_content": "\nProfessor Vandenburg is brilliant. I took Modernism with her and each of her lectures was fascinating. Yes, she has a very specific niche take on literature and on Modernist literature especially, but it's one that's worth hearing in her words. This course was one of my all-time favorites and (after spending about fifteen minutes at the beginning of each class working my brain into a mode that fully grasped everything she said) I left most of the lectures with a new perspective not only on the books we were reading but on the political and cultural climate of the first half of the nineteenth century and on the authors and their legacies. To be completely honest, I left most of the lectures feeling like my mind had been blown in a number of ways. It's hard to go straight to another class right after Vandenburg's finishes. It's a very specific, strange and amazing experience if you do the reading, listen hard and love the works.\nThe one frustrating part of this course is the participation credit. Vandenburg likes comments and class discussion but the class is not small (about 70-80 students) and the discussion is generally overpowered by two or three students. A vast majority of students never speak during class, but Vandenburg seems to expect everyone to engage in the discussion.\nThe assignments are wide open and therefore a little intimidating, but Vandenburg is incredibly approachable and interested in her students and their ideas. Her office hours are mobbed but certainly worth attending.\nWorkload:\n2 papers, fairly graded, and a low-key final with short answers and an essay.\n"
        },
        {
            "course_name": "Modernism",
            "review_date": "December 26, 2012",
            "review_content": "\nI have very mixed feelings about Professor Vandenburg. She is witty and facilitates class discussion expertly. On the other hand, when talking about the texts herself it seems that everything is either phallic or androgynous. When the class seemed confused she would attempt to draw a diagram on the board, which tended to make the class even more confused. It often consisted of drawing a circle, and then coloring it in or writing two words on the board and connecting them with a line. One might call that line a phallus, but only if one were Professor Vandenburg. \nThat being said, the texts we talk about in this class are nothing short of brilliant, and if you have an interest in complex literature this is the class for you. \nWorkload:\nAbout a book a week, one 4-6 pg midterm paper, one 8-10 pg final paper, and one final exam. \n"
        },
        {
            "course_name": "Post-1945 American Literature",
            "review_date": "June 29, 2011",
            "review_content": "\nMargaret Vandenburg is a perfect impression. I once left her Post 1945 lit class, only to hear a girl in front of me go on and on about how she felt class was like a \"Vandenburg Time Warp,\" and that she \"felt bad for Margaret..\" something about how she must be so intellectually plagued, swimming in philosophical appendices. Margaret is brilliant, not so much because she is, actually a brilliant mind, but because she is a brilliant person. Her personality radiates. Yes, lectures invoke literary/critical/philosophical theory; and yes her delivery of the material may be interpreted as presumptuous (i.e, kant, lacan, barthes, freud, etc are constantly lingering behind discussion). If I wasn't a Philosophy major, particularly inclined to \"connections,\" applicable theory, further understanding, I don't know if I would have enjoyed the class nearly as much. \nAlso, Prof Vandenburg has a clear view point, a particular, consistent edge. You know..the whole feminist liberal thing. If you aren't sympathetic to/tolerant of to these ideas, class may be frustrating to you.\nBut back to the important part: there is not one iota of Professor Vandenburg's presence and disposition that is condescending or pretentious. The fact that the majority of her students, ... and there is a cult...., are just as intellectually and theoretically stimulated as Margaret, is tantamount to her class engagement). It is often students who provoke discussion. It is amazing how much lecture time is spent in class discussion (a class of 60+). Professor Vandenburg is incredibly interested in and committed to understanding students remarks and responses. She comes to class to learn. You always see her writing down students comments.\nMargaret is also the most welcoming, devoted, and responsible professor I have ever had. If you go into her office hours, you will both leave knowing something about the other as individuals - not so much as teacher, as student. \nShe is just an incredibly positive force. \nWorkload:\n2 5-7 page papers, a benign final exam\n"
        },
        {
            "course_name": "American Literature Since 1945",
            "review_date": "June 06, 2011",
            "review_content": "\nAs an English major, this was a class I definitely don't regret taking. That being said, I don't think I will ever take a class with Professor Vandenburg again. While I learned a lot about literary theory and the reading list is extraordinary, Professor Vandenburg is too set on a specific way of analyzing texts, to the extent that her analysis can become repetitive and--to some members of the class--slightly ridiculous. For instance, I heard a number of people outside of class criticize how she looks at everything from a Lacanian, poststructuralist or Freudian perspective. Don't get me wrong, Professor Vandenburg is clearly brilliant and knows what she's talking about, but sometimes it felt like every single text on the syllabus was exactly the same.\nOne of my biggest qualms with the class was that Professor Vandenburg doesn't lecture a lot and instead relies on people's comments to conduct the class. This often led to a very dynamic class. However, sometimes, members of the class would feel the need to discuss the texts using Vandenburg's terms and ideas, and most of the time, they would have no idea of what they were talking about. \nSo, in conclusion, yes, you should take this class, as Professor Vandenburg is extremely smart, the texts are fantastic and the lectures/discussions are often engaging and interesting. However, realize that Professor Vandenburg's perspective is not the be all and end all of literary criticism.\nIt is perfectly possible to do well in this class. I took it as a First Year and got an A, even though the only college Literature class I had took before it was LitHum.\nWorkload:\nApproximately a novel a week. 2 6-8pp papers. 1 final (easy ID's with lots of analysis and one essay question she hands out beforehand)\n"
        },
        {
            "course_name": "Modernism",
            "review_date": "September 10, 2010",
            "review_content": "\nModernism as taught by Margaret Vandenburg has changed the way I think. For all of you who just judged my saying that, don't worry. I would judge me too, because it sounds almost absurd. I shit you not, though. This woman has a cult following for a reason. \nAlthough her perspective is specific (feminist slant, philosophically sexualized views), she by no means discourages unique interpretations of particular works. I remember many instances during the semester when students made outlandish comments only to be rejoined with an affirmative response from Margaret. Less judgmental than many of the stuffy English majors who sat around to quietly scoff at those making wet-behind-the-ears comments (I was one of the scoffers), Margaret gracefully leads the class to its sweet and rapturous end: the discovery that the genesis of opposites (the necessity for things to be either black or white) has transformed this universe into a seething vortex of annihilation. Margaret's interpretation of Modernism is more than simply a line of thinking, it's a way of reading and breathing the Modernist plight. My most private and existential thoughts have closely aligned with what I internalized from this class. I have taken three courses on Modern texts, and this one was by far the best. I think the syllabus and course discussions shed brilliant light on this era. Many folks just don't understand why she thinks the way she does, but if you understand...you'll know it; something just clicks. It's worth trying out the class to see if it \"clicks\" for you. If it does, as it did for me, you will find yourself eagerly anticipating the next class, swallowing the readings whole, and churning out some of your most productive writing ever.\nWorkload:\nTwo papers and a final. Don't be scurd.\n"
        },
        {
            "course_name": "Modernism",
            "review_date": "December 06, 2006",
            "review_content": "\nAfter the last class of the semester, everyone burst into applause.  I really thought I was hallucinating.   Although Vandenberg is obviously very intelligent and knows what she's talking about, she simply repeats the same theories and buzzwords the entire semester.  I heard more about sperm in this class than in my high school Health class--nearly everything is a phallic symbol to this woman, regardless of the author's intent or the existence of other perfectly valid interpretations.  Also, she went on at length about outside literary/psychological texts and expected everyone to have read them--I don't understand why she didn't just assign the texts if she wanted to discuss them.  I was really disappointed, especially since I loved what we were reading and her approach prevented me from enjoying it.  I'm an English major because I enjoy interacting with literature, and there was none of that in this course.  There was tons of pretentious theoretical discussion though, so if you like that you should definitely take a class with her.\nWorkload:\nOne 5-6 page paper and one 8-10 page research paper, plus a final exam.  Lots of reading.\n"
        },
        {
            "course_name": "Modernism",
            "review_date": "December 02, 2006",
            "review_content": "\nThis is probably not the class to take if you've read Ellmann on Joyce more than Portrait of the Artist, nor if you dig talking about what the articles in the title really mean. It's also probably not for complete Modernism novices and English majors/GS students etc. who really jst need some 20th C. lit and don't like dicking around with crazy impenetrable stuff, nor for people who only like Woolf and just want an excuse to concentrate on her, nor for people with very rigid, fixed ideas about the interpretation of the readings, because all of the latter will be disappointed. Modernism is probably the most fun, thought-provoking, and amusing-anecdote-generating class I've taken, though, and its success or failure as an enjoyable experience lies as much with the professor as with the material. Margaret Vandenburg is, basically, about as colourful as a professor can get without veering into actual eccentricity. Her Well-of-Loneliness-informed novel tells a story of lesbian sexual awakening in '20s Paris expat society, and, at least if you've any familiarity with '80s feminist culture, that won't surprise you once you see her: she tends towards loose suit jackets or button-down short-sleeved shirts, and she has this pair of neat black Docs she wears often. She's extremely demonstrative in this very dry way, and tends to spend class leaning or curled around her pulpit-like podium-\ndesk.  The class seems to generally run to a few dozen in the single hottest room on either campus; the size is prohibitive to seminar-style discussion if you're one of those people who doesn't feel the need to raise their hand every time they get an epiphany or have a question, (and if those people irritate and offend your sensibilities in general, feel free to take this review with a grain of salt, or several); it's mostly La Vandenburg ranting, with interjections/digressions from students at random intervals, which is both oddly personal and yet as pulpit-y as a lecture class- a setup actually ideal for Vandenburg's purpose: to get into your head and implant her ideas about androgyny, style, and the Transcendental Signifier into your head (and if that last one isn't obvious, either rush to your academic advisor now or don't even bother looking at this class, I don't know which).\nActually, in all seriousness, for someone with such pronounced ideas about their subject matter, Vandenburg is surprisingly willing to allow one their own opinion; while she can be dismissive about questions, she often defers to a questioner's subjective interpretation; whether this has always been the case, I don't know. She even asks for feedback sometimes, and likes hearing what the class thinks of the reading, unless it's the often-true 'I don't get it'. Her Freud/Kristeva/Saussure-related babble isn't as unfounded as it seems on second glance- she cites, even- and, no matter what one thinks of its validity, it's incredibly amusing- she knows how ridiculous she sounds sometimes, but once one has gotten used to her interpretation, the reading will start to seem ridiculously obvious, too, and if you can get past the transgressive kicks of talking about penis to the really subversive fun of anticipating what she would say before she says it, you'll be made, both in enjoyment of the class and ability to use her strategies.\nI'll admit that there are a lot of things about this class that would irk me, were I of such a mindset, and that many of the reviewers aren't too far off in their negative assessments. I still wouldn't trade this one for any other for the sheer amount of really interesting ideas that've collected around some familiar texts since I've been in the class, and the sheer comedic value of it has been enough to make far more fallacy and impenetrability worthwhile for me. So, in other words, weigh this one carefully. \nWorkload:\nMostly very, very light for fast readers/those very into the subject matter, hard for slow readers, easy to skip readings (though skipping too many is inadvisable- class makes even less sense then). Intermittent bursts of frenzied, painful work that will, despite much advance warning, spring on you out of nowhere; you'll be glad of her willingness to give extensions and counsel. Two papers: one seemingly easy persuasive essay that will be graded harshly, and one enormous research essay that will instill panic in the hearts of all but history majors and senior English majors. Final exam in the form of an essay.\n"
        },
        {
            "course_name": "Modernism",
            "review_date": "November 30, 2006",
            "review_content": "\nI loved this class!  I am not an English major, and was originally just taking this for the lit. requirement, but I am so happy I did!  It's definitely not easy, but I loved the readings and her engaging lectures.  There was a handful of people in the class who I figured were here \"followers\", but they weren't as irritating as I had heard.  She's incredibly approachable, and extremely helpful with the papers during office hours.  I cannot say enough wonderful things about her!  Make sure to take at least one class with MV before you graduate. \nWorkload:\n2 essays (6-8pgs, 8-10pgs) and a final\n"
        },
        {
            "course_name": "American Literature 1871-1945",
            "review_date": "May 30, 2006",
            "review_content": "\nProfessor Vandenburg is fun to study with and whether you agree with her readings or not, you will learn a lot about literary theory and the historical moment from which each of the texts emerged. SheÂ’s funny, brilliant, and approachable. She welcomes other points of view, and appreciates them, especially when they make her reconsider her own point of view. I feel like many people who condemn Vandenburg never took the opportunity to voice their own points of view. She welcomes them, and she will not belittle anyone no matter how ridiculous their interpretation/insight happens to be. \nIf you strictly adhere to purely literal readings, you might not like her method. She tends to find an entirely new layer to the novel that most people do not see reading it once. But, that is why I loved her class. Who isnÂ’t sick of listening to students regurgitating obvious conclusions theyÂ’ve come to after reading a novel once through while the professor nods approvingly? If you actually do the readings and go to class, I promise you will come out of most of the classes feeling like you know so much more about the novel than you did immediately after reading it.\nIf you are skeptical that there is anything worthwhile in the American literary canon, take this class. Granted, some of the early texts were tedious, i.e. Theodore DreiserÂ’s Sister Carrie and, at times, Edith WhartonÂ’s House of Mirth. But, there are many more great reads than there are mediocre ones. Some highlights: The Beast in the Jungle by Henry James, In Our Time by Earnest Hemingway, The Bear by William Faulkner, There Eyes Were Watching God by Zora Neale Hurston, Native Son by Richard Wright and Miss Lonelyhearts by Nathanael West. \n\nWorkload:\nPretty heavy reading. 2 papers. The first paper is 4-6 pages about anything you want graded by her reader (piece of advice: donÂ’t use block quotes unless you are going to do a mini-passage analysis of them). The second paper is an 8-10 research paper. Grading is very fair. Vandenburg cares that you are competent on the papers, but she is much more concerned that you seem engaged and interested. DonÂ’t sit in the back and say nothing for four months.\n"
        },
        {
            "course_name": "American Literature 1871-1945",
            "review_date": "May 17, 2006",
            "review_content": "\nEvery student at Columbia University should take a class with Vandenburg if they can. Sure, she's a \"crazy feminist\" who scored a cameo depiction in the Varsity Show, but her views on misogeny aside, Vandenburg is a very engaged professor who really cares about her students. She is the first professor who ever asked me about my life in office hours because she wanted to know me better. Class is large 45-50, but a true combination of discussion and her lecturing in insight into the text. While this class takes a very historical approach, I have heard that her Modernism classes are even better. And even though it is easy to write her off as a crazy feminist, it will surprise you how much her approach to literature will change your view of the world.\nWorkload:\nNo topic assignments. Midterm and final \"multi-discipline\" essay, 20% and 40% each (I think), participation: 10%, final: 30%. You must go to class at least most of the time to do well.\n"
        },
        {
            "course_name": "Modernism",
            "review_date": "January 20, 2006",
            "review_content": "\nI found Vandenburg tedious and inarticulate.  She constantly says \"you know\" to explain her points, but the problem is that I never felt as if I did know what she was talking about.  Though others have a more positive view on their experience, almost everyone feels slightly confused and overwhelmed, and this seems to me to be the WORST way to teach a class.  I appreciate the syllabus that I was exposed to, and what little I gleaned from the class, but I did not have a good time of it.  She lets other students talk as much as they want, which is great if you are feeling excited about a work, but awful for everyone else who sits through you rambling on and rephrasing Prof. V.  I think if she had allowed only limited discussion and lectured more, the class would have improved.  Also, she does a great job of bringing in additional sources and references, but I often didn't understand how they related and wished we had focused more on the texts in front of us.\n"
        },
        {
            "course_name": "Modernism",
            "review_date": "January 03, 2006",
            "review_content": "\nI am not as obsessed with Professor Vandenburg as some other students, but I can see why they are and I loved her class. This was definitely one of the most challenging classes I have taken at Columbia, but only because I did all of the work--I think some of the other reviewers say it was easy because Professor Vandenburg doesn't check up on you or your work, so you really have to do a lot of it independently. And I don't think it was an easy A at all (I worked VERY VERY hard for an A). That said, the class is very rewarding and she is always ALWAYS willing to meet with students outside of class (and I would recommend it to boost your class participation grade--it's always better if she knows your name--and she does try to learn everyone's name). As a survey course, I would very much recommend this class.\nWorkload:\nLots to read but only three actual grades: midterm paper (4-6 pages), term paper (10-12 pages), final (ids and an essay: What is Modernism?). And class participation is 10%.\n"
        },
        {
            "course_name": "Modernism",
            "review_date": "December 20, 2005",
            "review_content": "\nSometimes it really pisses me off when I see negative reviews of Professors I admire, but this time I just think it's FUNNY--how can anyone think Vandenburg \"rules over class with an iron fist?\" The woman is the personification of chill, intelligence, and sincerity.  Yes, she conducts discussions along the lines of her reading of the material, but to accuse her of tyrranical teaching is beyond absurd, like I said before--hilarious. I think if there is one Professor I've had at Barnard or Columbia who had zero ego and every right to have a huge one, it is Vandenburg. That said: She will not give you an easy A.  She will treat you like a person.  She will make you want to impress her by virtue of her knowledge of and passion for English. She will not treat you differently as a human if she doesn't like your work.  A note on the class itself--these texts are heavy stuff, so really only take the class if you want to dig dig dig. And go to office hours--you won't want to leave, Vandenburg is so personable and humurous.       \nWorkload:\nOne paper and one research paper. And a final. Do the readings. \n"
        },
        {
            "course_name": "Modernism",
            "review_date": "December 19, 2005",
            "review_content": "\nAs an English major, the class still seemed pretty daunting. Even though I was scared the first week too, the readings are amazing. Even if you may not get into it at first, Vandenburg's lectures bring new insight to them and even if many students are talkative in class-they bring a lot of interesting insight to the reading as well. Class was enjoyable, because it was lively-most in part due to the class' lively discussion and the professor's amazing lectures. \nGrading on the first paper was done by a reader. The final paper is read by Professor Vandenburg herself [advice: don't wait till last minute to do this paper] The finals-ids and an essay\nWorkload:\none short paper (5-7 pages), one research paper (8-12 pages) and a final (ids, essay) \n"
        },
        {
            "course_name": "Modernism",
            "review_date": "December 05, 2005",
            "review_content": "\nAs nearly all the other reviwers say, Vandenburg is amazing. She's incredibly knowledgable, modest, and very good natured, both one-on-one and in class. This class is mostly full of English majors- if not all English majors than people who could or should be. I myself, not English-major type, freaked out the first week- This is way over my head! I'm gonna fail!- but it was fine. Sure, there are the VERY vocal few who spout out thier extensive knowledge of other modernist works and basically anything else ever written ( Vandenburg herself cites many other books in lectures- but you don't need to have read them), but, as in any other class, just ignore these people, and you'll be fine. The material ranges from great to awful (for the non-English major. Those talkative few LOVE everything). Likewise, the class is either awfully boring if you didn't like the reading, or SO amazing if you did. I'd say all in all, this class is great. You may be subject to fits of passion/rage, but any class that is as good as the good parts of this one is well worth it.\nWorkload:\nNot bad at all. Books and poetry, but you have ample time to read them, a short essay (5-6) and a research essay (8-10). Final.\n"
        },
        {
            "course_name": "The Modern Novel",
            "review_date": "July 04, 2005",
            "review_content": "\nOk, to put it simply, I agree with all of the positive things said about Prof. Vandenburg and this class. She's incredible, brilliant and she values other opinions. The people who complain on and on about her \"narrow\" or \"incorrect\" beliefs regarding the modern authors and their works are a bit to sure of themselves, and their remarks don't make sense to me considering the way Vandenburg approaches teaching. Vandenburg loves it when you disagree with her, and say something intelligent to back up your own theory. She'll say, \"I think you're right...that's interesting because if you look at it that way then...\" In fact, I remember numerous occasions on which she scribbled something down as a student said it because of how interesting she thought it was. So, I don't really see how people can complain about not agreeing with her ideas...that's perfectly welcome in her class...in fact, I'd say it's rewarded. More often than not, I found myself agreeing with her, and one of her main criticisms of my work was that I was ready to move on to even more unique readings...and trust me, hers are tough enough to wrap your head around. Coming up with something completely original and completely ground-breaking to say about these authors was a bit out of my scope...though I found Vandenburg's insights fantastic. So, as for the reviewers who think they know it all, and who feel the need to tell you all that they got an \"A,\" the fact that they are grade-dropping on culpa should tell you enough about whether you want to trust their opinion of this class. \nYes, she could come down harder on certain people who continuously express their not-so-interesting ideas. I will say that. There was one person in particular in my class who spoke at least 2-3 times per class for a 4-5 minute rant that no one really wanted to hear about. But, in the end, it gives you time to reflect and think about what has already been said in discussion and what you are wondering about. \nYou'll come out of this class a better reader. Trust me. I'd never read like that before. She's incredible, truly. Yes, like any class, there are the frustrating moments. But, I measure a classes worth based on what I got out of it. And, I can't even begin to tell you HOW MUCH I got out of this class. It has been BY FAR, my most positive class experience at Columbia so far. It is what all classes should be like. \nWorkload:\nLots of reading. 1 5-6 pg. midterm that asks you to use style as a path by which to reveal something about the novel, 1 8-10 pg research paper that requires you to create a thesis about one of the novels and incorporate 2 other disciplines (i.e. history, philosophy, psych, etc.) 1 final that consists of easy passage ID's. The idea is that you use the ID as a microcosm of the novel. Therefore, there are no surprises or tricks. The class is awesome. Take it. \n"
        },
        {
            "course_name": "The Modern Novel",
            "review_date": "May 09, 2005",
            "review_content": "\ni took this class after reading piles of awesome reviews on it, and i regret it. i definitely understand why people love her as a person (she's very interesting and very approachable). but the class is made up of 60+ people and, i'm sorry, no matter how much vandenburg tries, she cannot create effective discussion with that many people. she name-drops like crazy and expects everyone to have read heart of darkness and sons and lovers and all of gertrude stein and virginia woolf before enrolling in the class. oh, and also be well versed in all of freud's and jung's theories. even everything we covered in lit hum and CC weren't enough for this woman. her office hours consisted of me asking her for further explanation of her lectures and her ending every vague sentence with \"YOU know. YOU know what i mean.\" I'm sorry prof vandenburg, i do not know. maybe a different class with her would be more productive.\nWorkload:\n10% attendance/discussion (how she keeps track of this i have no idea), 25% 4-6 pg paper, 40% 8-10 pg paper, 25% in class exam with 6 IDs and the vaguest essay question you will ever receive in your life\n"
        },
        {
            "course_name": "Modernism",
            "review_date": "April 17, 2005",
            "review_content": "\nI will admit it:  I was in the Vandenburg Cult (but not in the annoying, speaking all the time and going to her office hours to have inane discussions) way.  But, when I was a sophomore, I believed the hype, loved the modern novel, thought Vandenburg was brilliant.  And then I grew up, and realized, hey, we're just misreading a whole lot of critical theory and hearing Vandenburg fondly expound ad nauseum on HER very narrow view of the Moderns--\nand if you have different opinions?  Well, you're in Camp Vandenburg, so, as said in a prior review, leave original thought at the door and be prepared to listen to lots of sophomores who raise their hands REALLY high parrot back the gospel according to Professor V--not just in this class, but in ALLLLLL English classes at Barnard--\"oh, I haven't read Freud, but Vandenburg says . . .\" was actually a comment I once heard in an upper-class English SEMINAR.\nBut, digression aside, Vandenburg is dangerous because she teaches baby-\ncollege thinking, while making people think that a) they're thinking really hard and are so, so smart or b) because they have original thoughts, are thinking differently or are engaging intertextually, that they don't understand, that they don't get it.  Vandenburg subtly runs the class with an iron fist, and this shoddy thinking seems to permeate the English department at Barnard.  The class discussions are RIDICULOUS (and so regenerative--the same ubiquitous four to five people waving their hands wildly), the novels fabulous.  But, remember that the idyllic meadow of novels is filled with some poisonous snakes who will at the very least make you feel nauseous.\nBitter?  A bit.  Not grade wise (I got an A), but education wise .  . .  this class praised me and others for shoddy, simplistic thinking which just isn't fair!\nWorkload:\nsame as described below . . . although people will tell you that it's SO hard and there's SO much work . . . not really.  \n"
        },
        {
            "course_name": "The Modern Novel",
            "review_date": "April 03, 2005",
            "review_content": "\nFascinating woman with fascinating theories. As a teacher, Vandenburg is engaging and animated. I'd recommend taking this course as an upperclassman -- not because it is so difficult (although it is challenging) -- but because the more knowledge one has going in to her class, the more one has the potential to appreciate her ideas (or not). Her readings stray from canonical norms, so if you are not already well-versed in \"the moderns,\" you may not understand why what she's saying does in fact deviate from more traditional readings. As for these theories, she applies the same ones to everything we read, over and over. Although she says you're welcome to disagree with her on the way she sees things, good luck trying -- especially if this is your first in-depth examination of modern era lit. it seems that she wants to hear only what she thinks and not much more. \nBottom Line: Vandenburg is cool, and it's easy to see why the Barnard masses are so enamored with her. But before you sign up for her class, just know that you'll be spending a lot of your time trying to fit your thinking into her worldview, instead of expanding your own. That said, she wants to show you how these novels can change you -- and they can. If you can put up with the frustration of leaving your original thought at the door, her class is worth the temporary inconvenience.\nWorkload:\n4-6 page midterm; 8-10 page term paper; final exam.\n"
        },
        {
            "course_name": "The Modern Novel",
            "review_date": "March 08, 2005",
            "review_content": "\nI really don't get all the fabulous reviews. Sure, the texts are great and Vandenburg is brilliant, but that doesn't make for a great class. I'd say more than fifty percent of class time is for discussion, which is pretty difficult considering its size. Moreover, I'm guessing most people diddn't sign up for this course to hear the same 4 or 5 people talk about modern literature without end. I was rarely impressed with what anybody said, and found myself wishing the whole time that Vandenburg would speak more. I always left class feeling like there was so much more to these texts than was discussed in class, where it seems like, with all the time devoted to student comments, we could only skim the surface. And the professor will often cite sources, after which she'll say \"you guys know it right?\" and honestly, I'm not sure I knew any. This makes it pretty difficult to follow, especially when you're discussing the really abstract, complex theories of Jung, among others. All in all,  its pretty difficult to take notes and I would have preferred more indepth analysis. \nWorkload:\nLots of reading, but the books are worth it. \n"
        },
        {
            "course_name": "American Literature 1800-1870",
            "review_date": "January 18, 2005",
            "review_content": "\n1) PLEASE NOTE that this teacher is possibly THE most overrated teacher at Barnard. 2) She is still a great teacher and her classes are stimulating 3) If you hate suck-ups then dont take this class, in my opinion vandenburg loves them. 4) she is reluctant to give A's on papers and grades somewhat on the harsh side 5) She is incredibly difficult to reach outside of class as she is a very popular teacher on campus 6) If you go into this class disliking any  early american literature, you will leave the class appreciating and understanding the books\nWorkload:\nheavy reading, 2 papers and a final. you better raise your hand and kiss her arse if you want that extra boost for your grade.\n"
        },
        {
            "course_name": "American Literature 1800-1870",
            "review_date": "January 09, 2005",
            "review_content": "\nIf I were a literary work that had been accused of a crime, I would want Margaret Vandenburg to be my attorney. I've rarely heard anyone argue as cogently and persuasively as she does about literature. While I have high esteem for her intellectual prowess and her congenial demeanor, I was dissappointed with the fairly limited scope of examination in this class. I felt that Professor Vandenburg emphasized the psychological aspects of the literature we studied ad nauseam and left me with a limited perspective on the works. Things seemed promising at first when Vandenburg stated her intention to examine these texts from a number of different angles, such as their relation to the American definition of democracy and their stylistic qualities, but the range of discussion rapidly shrank. If you're really into Freud and Jung, drop everything and take this class, but if you're looking for a more eclectic examination of nineteenth century American Lit I'd suggest you go elsewhere. \n\nWorkload:\nWe covered a pretty estimable number of works here; the syllabus definitely serves well as a primer for 19th century American texts. Two papers, one standard 5-7 page length, the other a 10 page research essay. \n"
        },
        {
            "course_name": "American Literature 1800-1870",
            "review_date": "January 02, 2005",
            "review_content": "\n I will not deny that Vandeburg is smart. However, if you have not had any psychology courses (excluding intro to psych-which I took), DO NOT TAKE THIS CLASS!  She references psychologists and expects her students to know what she is talking about.  Also, she references novels that aren't assigned for her class, making it extremely difficult to understand what she is talking about.  On top of this, she grades extremely difficultly and has a reader who grades the first set of papers who is even harder.  One more thing, apparently all of her classes, even though the topics are completely diff.erent manage to apply all of the same themes to the novels assigned.  So, basically, unless you want to hear Vandenberg and her cult ramble on about how every novel leads to the taming of women, donÂ’t take her classes.\nWorkload:\none 4-6 page paper: open topic - graded by reader, very hard grading. second- research paper 10-12 pages, also very difficult. A final exam: fair but hard to study for.  Class paricipation is 10% and she takes attendance, both of which were annoying. \n"
        },
        {
            "course_name": "Modernism",
            "review_date": "January 02, 2005",
            "review_content": "\nVandenburg is extremely knowledgable in many areas of literature and able to explain many esoteric texts, easily bringing out nuances in the works.  Although the class is run as a lecture, she welcomes questions and discussion and has the ability to never make anyone's comments seem stupid.\nI recommend staying on top of the reading (all of the works are interesting) and taking notes in class.  I also recommend NOT taking this class as a first-year.  I did that, and although it was easy to stay on top of the reading and the lectures, it was obvious that my writing was well below par and lacking in ways that everyone else in the class (mostly seniors and juniors) did not have problems with.\nOverall: very interesting and fun because of Vandenburg's intellect and witticisms.  definitely my favorite class this semester.\nWorkload:\nnovels and poems to read each week (though load is spread out and managable)\none midterm essay on any text/any topic\none research essay due at the end of the term\none final exam (passage identifications and one essay)\n"
        },
        {
            "course_name": "Modernism",
            "review_date": "January 01, 2005",
            "review_content": "\ni really like professor vandenburg, but the class was not so likeable.   some of the readings were great, while others were impossible to understand or boring.  she sometimes assumes that her students know a lot about other religious, mythological, or literary works not read in class, which can make the class a little overwhelming.\nWorkload:\n2 papers (1 research), and a final. final has quote ids and an essay\n"
        },
        {
            "course_name": "Modernism",
            "review_date": "November 27, 2004",
            "review_content": "\nShe's the best.  Once you take a class and if you \"get it\" you join the Vandenburg Cult...i.e. voluntarily attending office hours and waiting in line with other \"admirers\"\n"
        },
        {
            "course_name": "The Modern Novel",
            "review_date": "August 13, 2004",
            "review_content": "\nAMAZING I loved this class so much that I'm registered for her Modernism class next semester even though I'm not too big on theory. You'll keep up with the reading because you'll want to understand what's going on in class (plus the books are great). I had absolutely no background in this time period and had never taken and english class at columbia before but this has convinced me to take many more.\nWorkload:\n2 papers--2nd one's a research, pretty intense but do-able. midterm and final so-so\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "July 31, 2004",
            "review_content": "\ni would be lying if i said she wasn't a great prof, because her lectures and critiques improved my writing a LOT.  the readings were a lot, but i got through the class without reading about 1/2 of them.  throughout the sem we had a bunch of conferences for the papers, but for each one i remember leaving her office on the verge of tears because of her criticism that was meant to help, but hurt even more.  hey, if you ever liked getting stabbed in the heart with a bouquet of flowers, she's your kind of teacher.  \nWorkload:\n2 4-6 page essays, 1 10 page research paper\n"
        },
        {
            "course_name": "The Modern Novel",
            "review_date": "May 20, 2004",
            "review_content": "\nThere is a cult of students who worship Vandenburg, and after taking her course I know why. The woman is brilliant, funny, understanding, and very approachable. Yes, she references outside sources a lot, but usually just as supplemmentary--if you don't know a single one of them, you'll be fine. She finds crucial meaning in the smallest turns of a phrase, and introduces you to an entirely different way of looking at literature and the world as a whole. She's also very understanding--faced with a class of 60 students where maybe a handful had actually done the reading, she'll chuckle and say, \"Yeah, I guess you guys just have a lot of other work. That's OK.\" Highly recommended, unless you don't feel like thinking.\nWorkload:\nA TON of reading, midterm essay, research essay, final.\n"
        },
        {
            "course_name": "Modernism",
            "review_date": "January 20, 2004",
            "review_content": "\nAll too often during Vandenburg's lectures---which all too often degenerated into maddeningly idiotic (and maddeningly unchecked) pontifications by students---I found myself shrieking inside my head, \"I AM NOT PAYING THREE GRAND A CLASS SO THAT I CAN SPEND THREE HOURS A WEEK RELIVING A HIGH SCHOOL ENGLISH CLASS.\"  Because, in too many ways, that's what Vandenburg's class was.\nSure, Vandenburg cites plenty of Classical and poststructuralist references, offering links to other thinkers and writers--but too often, the links offered seem either arbitrary or obvious (more often the latter; how many times do the names of Freud, Jung, and Lacan really need to be cited a la some Modernist sign of the Cross?).  Sure, she has a good sense of facilitating discussion--but too often, she lets students rattle off countless inane questions and comments.\nAn important thing to note about Vandenburg's Modernism class is that at first it sounds damn promising: she's a lively but approachable lecturer, she asks and answers questions, and she tries to bridge disciplines.  But after attending more than a few classes, you'll realize how damn reductive her whole process is.  For the most part, the class is an extensive list of buzz words bandied about in a dangerously general fashion.  The same names, sooner or later, will crop up in just about every class, as will general mention of gender, tradition, and duality.\nThat's all well and good, yes, but after a point, Vandenburg doesn't really go anywhere with them.  She makes general, digestible, and really very obvious assertions by way of grossly reductive drawings on the blackboard:  \"light\" and \"good\" go under \"presence,\" \"dark\" and \"bad\" under \"absence,\" etc.  It's sheer high school-level simplification that might prove useful were Vandenburg to use it to prove some larger point---but unfortunately, those larger points rarely come along.  Instead, you're left with a series of general ideas about the major players of High Modernism that in no way do their respective works justice and that leave you with juvenile assignments.  (For instance, paper assignments that are far too far-reaching to fit into the short page-lengths allotted to them.  Oh, and the topic for the essay on the final:  \"What is Modernism?\"  Ha.)  Not only that, but I got the distinct impression that Vandenburg -wanted- things that way.  When I went in to her office hours to discuss a possible topic I'd come up with for my research paper, she immediately discouraged me, telling me it would be too difficult and suggesting I try a safer topic.  Uh, since when are professors supposed to encourage students NOT to take intellectual risks?\nIf you want to go in-depth in Modernist novels at all and not spend an entire class period leaping from generalizing statements about a work/author (i.e., \"Woolf's writing is cubistic!  Joyce likes epiphany!\") to ineffectual nitpicking (\"look, it's another example of Eliot's obsession with tradition!\"), then Vandenburg's Modernism is not the class to take.  If you're totally new to Modernism, though, and just want a general overview, the class could be beneficial.\nWorkload:\nShort midterm paper (4-6pp), open topic.  Slightly longer (but still kinda short, 8-10pp) research paper focusing on one book and spanning three \"disciplines\" (for instance, relating some aspect of 'Dubliners' to both psychology and music).  In-class final.\n"
        },
        {
            "course_name": "Modernism",
            "review_date": "January 19, 2004",
            "review_content": "\nDo not graduate without taking this class. This class is what I thought all of college would be like. The reading list is excellent, but beyond that, MV illuminates the works with a combination of depth and wit, constantly focused on engaging the class. \nWorkload:\nNot too bad. You'll want to read the books. A fair grader. Don't slack off on the final research paper. Everyone in the class went crazy a couple of days before it was due...start it early and meet with her often. \n"
        },
        {
            "course_name": "Modernism",
            "review_date": "December 31, 2003",
            "review_content": "\nVandenburg is an intense teacher. Class has a great reading list and classtime itself is well structured. Vandenburg interacts often with students, and seems to genuinely respect their opinions. But, she does assume A LOT of background on the topic. The first couple of lectures were even very confusing at times. Also, paper topics are VERY open, which can make them even more difficult. Overall I would recommend the class to upperclassmen who are interested in learning a precise outlook on Modernism that may contrast with other interpretations of the subject.\nWorkload:\n6 page essay, graded by reader. 10 page research essay-- very time consuming and you should go to office hours, straightforward final, attendance.\n"
        },
        {
            "course_name": "Modernism",
            "review_date": "December 11, 2003",
            "review_content": "\nThis class, and this professor, epitomized what I always imagined my college experience to be.  As a first-semester freshman, my first day of class (and many subsequent days, as well) were quite intimidating, but the extra effort was 100% worthwhile.  The syllabus is incredible and Professor Vandenburg is absolutely brilliant, not to mention approachable, helpful and funny.  Although the class has about 60 people she manages to run it as a seminar, appreciative of every contribution.  Entirely in awe of her, I found myself--and got the impression that others did the same--making sure that my comments were well thought-out and had evidence to back them.  Because the majority of students seemed to make the same effort, the class level was very high and I appreciated others' comments almost as much as Prof. Vandenburg's explanations.  Something I particularly liked about her is the way in which she is always supportive of a student's contribution to the discussion.  Not once throughout the semester did I see her make anyone feel at all uncomfortable or unintelligent.  Even if a student said something blatantly incorrect, she managed to manipulate it in a supportive manner to correct the statement without acknowledging the fact that they had made a mistake.  This class was absolutely amazing; I found myself raving about it to all my friends, family members and even past teachers.  If you enjoy English and are willing to work hard, you will emerge a better person for it.\nWorkload:\nA midterm paper (5-7) and a research paper (8-10), both of which require a lot of preparation and work (but because you want to impress her, they'll probably be the best things you've ever written) and a final exam.\n"
        },
        {
            "course_name": "Modernism",
            "review_date": "September 08, 2003",
            "review_content": "\nCould be the best professor I have had in my Columbia career.  I have only a few points on which I differ from most of the other postings.  I don't think it's actually necessary to be as well versed in modern literature as others would contend.  I didn't get the impression that Prof. Vandenburg expects you to know that stuff when she references it, rather she admits that it's impossible to cover all of modern literature in one class and frequently references other authors not on the syllabus as avenues for further research or reading.  Also, if you think you are an expert on modernism and modern thought, think again.  Vandenburg takes no bullshit, so if you name drop in class, make sure you know what you're talking about.  That said, she is incredibly approachable and encourages contributions from all of the class, not just the typical brown-nosers or over-enthusiasts.  (a small confession:  I am one of these people.  Among other things, Vandenburg taught me to enter into dialogue with other students in class, listen critically, and be critical of my own contributions).  Because of her frequent integration of writings from other disciplines in her lectures, both scholarly and pop cultural, I had not only an example of how to write a solid research paper, but also the beginnings of a bibliography.  \nBe prepared for some unorthodox views about literature, the classroom, and modernism, including critiques of over-simplified feminist readings of works by Hemingway and D.H. Lawrence.  Professor Vandenburg  loves the authors on the syllabus, and after her inspiring class, you will too.\nWorkload:\n1 five page close reading of a text, graded by the reader (who is a tougher grader than Vandenburg).  1 ten page research paper, graded by the Prof.  Reading comparable to other English classes\n"
        },
        {
            "course_name": "Modern Novel (Barnard)",
            "review_date": "July 15, 2003",
            "review_content": "\nVandenburg is an incredible professor.  She is stunningly knowledgable about her subject and therefore has very definite ideas about it but she is very interested in listening to your ideas as well so it makes for a nice mix.  She is into class discussion, even in a large class like Modern Novel, and she manages it well.  There's not too much off-topic wandering in this class.  One of her favorite techniques is to answer a question with another question or say, \"Well, what do you think?\"  This means you better keep up with the reading but also ensures that classes are never dull.  Vandenburg is very theorhetical, which goes nicely with a class on modernism, but can be intimidating if you are new to the study of literature (or history).  Don't take this as a freshman or first semester sophmore unless you are a bit precocious.  \nWorkload:\nHeavy but very managable if you make the class a priority and keep up with the reading.  One 5-7 pager, an 8-10 page interdisciplinary research, and a final that looks for you to know the BIG ideas.  \n"
        },
        {
            "course_name": "Modernism",
            "review_date": "May 24, 2003",
            "review_content": "\nTruly one of the best professors I have had. She completely cares, and while at first you find her insights to be overdetermined, over the course of the semester, you see that what she says about modernism is correct, interesting and true. She provides you with a lens and a languagge with which to talk about modernism in literature and in the world, and also a way to be critical of it. I love her and she has really moved me. \n"
        },
        {
            "course_name": "The Modern Novel",
            "review_date": "May 14, 2003",
            "review_content": "\nWow.  What an INCREDIBLE teacher.  With over 60 students crammed into the classroom, she still manages to turn it into a discussion based class.  She's brilliant, both in terms of knowledge of her subject matter and in terms of her teaching style.  She loves having students come in to office hours and makes an effort to learn everyone's name.  We read great authors as well-- Faulkner, Woolf, Joyce, etc.\nWorkload:\nTwo hard papers and a final, the reading can be a lot but it's enjoyable.\n"
        },
        {
            "course_name": "Modernisn, The Modern Novel",
            "review_date": "May 11, 2003",
            "review_content": "\nThis is a CAN'T MISS PROF.  Vandenburg is absolutely amazing.  She synthesizes psychological, historical, philosophical, and more elements with the literature at hand (EXCELLENT syllabus).  She knows how to run a class and is always willing to joke around.  Perhaps a bit too feminist for the Barnard fearful, the class is usually 90% female, but that actually makes her love the few male students more.  She will change the way you think about literature and the world.  I promise.  TAKE HER CLASS!!!!!!!!!!\nWorkload:\n2 papers (one 5-7, one 7-10), final - her reader is a bit of a hard grader\n"
        },
        {
            "course_name": "The Modern Novel",
            "review_date": "April 20, 2003",
            "review_content": "\nThere should be a prerequisite listed for this class: To have read every piece of modern literature except for those on the syllabus.  From day one, Vandenburg makes sweeping statements about authors and references novels that are not on the syllabus as comparisons instead of actually explaining her ideas.  She uses the board only to scribble abstract pictures that allow her to avoid explaining herself even longer.  Don't get me wrong, students who were familiar with most of Vandenburg's references seemed to enjoy the class, but there is no room for anyone who hasn't been preparing for the class for years.\nWorkload:\nTwo papers: a short paper on style and a longer research paper, both graded by a reader who doesn't even come to lectures and a final exam.\n"
        },
        {
            "course_name": "First Year Seminar: Women and Culture",
            "review_date": "January 17, 2003",
            "review_content": "\nThis class was semi-enjoyable for a non-English enthusiast. We had reading assignments due every class which I found manageable, but I found out many of my classes didn't even do them and then talked about the books like they did. Vandenburg has a dry sense of humor and takes the class seriously. I found her to be semi-intimidating because of this, but she honestly really cared about her students and scheduled many out-of-class conferences with us, and contacted me by phone several times to discuss a topic I was unclear on. She's not an easy grader by any stretch of the imagination, but I feel that my ability to read deeply into works and write strong papers greatly improved over the course of the class.\nWorkload:\nReading assignments due every class (manageable), 2 4-6 page papers and one 8-10 page one as a final.\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "December 12, 2002",
            "review_content": "\nOkay, I love this woman. She is an incredible thinker, a brilliant discussion leader, and a remarkable writing editor. Everything she says during her seminars left me in awe of her abstract ideas. In addition, she is extremely patient, fair, and easy to talk to. Her class was a pleasure.\nWorkload:\n2 thematic essays and a research paper. Manageable.\n"
        },
        {
            "course_name": "First-Year English: Women and Culture",
            "review_date": "December 12, 2002",
            "review_content": "\nOkay, I love this woman. She is an incredible thinker, a brilliant discussion leader, and a remarkable writing editor. Everything she says during her seminars left me in awe of her abstract ideas. In addition, she is extremely patient, fair, and easy to talk to. Her class was a pleasure.\nWorkload:\n2 thematic essays and a research paper. Manageable.\n"
        }
    ]
}