{
    "prof_info": [
        {
            "prof_name": "Cheryl Palm",
            "prof_id": 12575,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Global Food Systems",
            "review_date": "December 29, 2012",
            "review_content": "\nThe title for this course is very misleading; it should actually be called Agriculture 101. It was purely lecture based and entailed guest speakers from the Earth Institute lecturing on their specializations with regards to agriculture, whether they were nutrition, soil, climate, or socioeconomics. Overall it was a very interesting course, and I personally feel that every student majoring in Sustainable Development should take it since agriculture is an often overlooked subject compared to energy (i.e. fossil fuels). At the same time, however, the class could use some improvement, which is understandable since this is its first year.\nProfessor Palm is real friendly, and you can tell that she is passionate about the subject matter, which truly is interesting. At the same time, however, I didn't like how she would be unable to answer certain questions in class, and how she would sometimes exhibit displeasure at some of the calls for clarification by students. In the end I realized that questions were never truly answered throughout the semester, mostly because of this, her inability to answer questions regarding lecturers that were not hers, and the fact that most of the lecturers were foreign nationals who, while extremely intelligent and knowledgable in their respective fields, were hard to understand due to their thick accents. The accents were diverse and ranged from African to South American to French, which made comprehending them and grasping the dense material an exhausting task. It did not help that the TA, Chris, as nice and carefree as he was, could not upload the PowerPoints for the lectures beforehand. This meant that the  burden of taking notes on both the PowerPoints and the lecturers was placed on the students. This was very frustrating, even as I really appreciated being able to meet these Earth Institute professors, all of whom are renowned pioneers in their respective fields.\nNotwithstanding this fact, the main problem with the class is the fact that the final grade was based on a midterm, final, and 10-page research paper. I found this rather problematic since the material varied by lecture; the subjects covered ranged from soil science, an extremely dense and emergent discipline; to simpler concepts such as socioeconomics, which includes concepts such as the relationship between falling food prices and increases in crop yields from the Green Revolution. The information, while interesting, was so diverse and variable for a survey course on agriculture that it could get overwhelming at times. While I liked how the class was focused more on the big picture and was based on hard scientific facts rather than politic, there was simply too much information times. This course would probably do better with weekly responses and papers corresponding with the topics covered in the lectures rather than a midterm and final that required the regurgitation of countless facts. It also did not help that the readings were extremely dense, often being scientific studies and NGO reports (they corresponded with and supplemented the lectures, and thus it was blatantly obvious that nobody did them), and thus they were impossible to do, especially with the  looming 10-page research paper.\nThe research paper was actually pretty simple. Many topics were available, and students were split into groups depending on the topic of their choice before being allocated to the respective professor of that field. I did my paper on nutrition, specifically the double burden of nutrition in urban and rural India, and Professor Remans was really friendly and helpful in helping us do research and find sources. Overall a very interesting assignment, and I felt that I got more from the paper than from lecture (even though I learned so much from the class in general).\nWorkload:\nMidterm, final, and 10-page research papers. Also around 70+ pages of reading that you really don't have to do since you aren't tested on it (despite Professor Palm's assertions that they'll be on both the midterm and final). Don't let the small page number fool you; the readings are extremely dense and hard to read. Again, you don't have to do them, which makes sense since the class is more about the big picture than details (and the main ideas of the readings are essentially the lectures)\n"
        }
    ]
}