{
    "prof_info": [
        {
            "prof_name": "Melissa Ball",
            "prof_id": 13143,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Organic Chemistry II",
            "review_date": "May 18, 2015",
            "review_content": "\nMelissa Ball is an incredibly capable TA, who genuinely cares about you doing well in Nuckolls' class. As a post-bac, she took Colin's Orgo 2 in the spring of 2014. Afterwards she joined the Nuckolls group as a Chemistry grad student. She knows what high performance means for Orgo exam and will do everything possible to prepare you; during her recitations she often reviews particularly tricky mechanisms and goes through problems Colin prescribes during lecture. Melissa, like Colin, will stop to answer your question at any point during recitation, no matter how small. If you email her, she will generally get back to you. If you go to office hours or make an appointment, you'll find her to be very helpful.\nHer quizzes are generally straightforward and test the material from the previous week's lectures. If you go over the lecture and recitation notes two or three times, you should do well on her quizzes.\nMy one criticism of Melissa's teaching style is that she often treats everyone in the class as if they were a fellow post-bac. Notecarding and memorizing every lecture mechanism, homework problem, and practice exam are the sort of things you can do if you're only taking two classes per semester, however this is an unrealistic recommendation for many undergraduate students. That being said, if you are a post-bac, Melissa's your gal. If you're not, go to her recitations, do what you can, and don't sweat it if you haven't achieved post-bac level studying habits. Oh, and later in the semester, she can be spotty about passing back quizzes\nOne last interesting note; Melissa's obsession with Colin is thoroughly entertaining. A friend once recorded the number of times she said Colin's name in a recitation (\"Colin wants you to know...\", \"Think to yourself, what is Colin trying to test...\", etc.). 25 times.\nWorkload:\nVaries\n"
        }
    ]
}