{
    "prof_info": [
        {
            "prof_name": "Nataliya Kun",
            "prof_id": 12952,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "First Year Russian I&II;",
            "review_date": "October 11, 2016",
            "review_content": "\nEvery wonderful review you will read below about Nataliya is true, but I feel compelled to add to chorus of praise because Nataliya is just that good. Take a class with her!!! She is deeply passionate about her subject and about teaching. She obviously works incredibly hard, supervising the curriculum of all the First-Year Russian courses as well as teaching her own section. She returns every piece of writing you do, from basic grammar exercises to short stories and essays, with detailed comments/corrections the very next day. She is dedicated to her craft and is consistently prepared and engaging. Nataliya is endlessly energetic and her steadfast enthusiasm for an admittedly challenging subject is refreshing and inspiring. It's easy to fall in love with Russian when Nataliya is teaching it. She is also probably the most compassionate and kind-hearted professor I've had the pleasure of studying under. She is picky and demanding in only the best possible sense; she tirelessly corrects our pronunciation, cases, grammar, etc., and while this can be exhausting, it makes all the difference in developing a good accent and good grammar habits. After taking First-Year Russian last year, I happened to get the chance to have a conversation with a native Russian speaker over the summer. He told me that I must've had a good teacher, as my Russian was so \"clean\". Russia turns of phrase aside, he was absolutely right.\nWorkload:\nHeavy. Russian is tough, and it meets MTWT. Though the format may be subject to change, we had around 2hrs of homework a night, and a chapter quiz every Wednesday (not too hard, chapter vocab, conjugations, cases, short composition). Plus a written and oral midterm (very hard! but you'll be impressed by how much you've learned) and a written and oral final.\n"
        },
        {
            "course_name": "First Year Russian I&II;",
            "review_date": "May 11, 2016",
            "review_content": "\nThe previous reviews are all on point, but, having finished my second semester with Mrs. Kun, I had to add to her high praise. I cannot speak highly enough about her dedication to her students and their success. If you are contemplating the long, hard road that learning the Russian language can be, I strongly recommend that you, at the very least, start your journey with her. She will go to great lengths, assisting you through any struggles and making learning aids, to help you with your studies. She is also very understanding when you get behind in your studies because of other course workloads. Mrs. Kun is competent and delightful, but will challenge you to assess your progress. I am glad to have had the opportunity to learn with, and from, her.\nWorkload:\nWith studying and homework, 2-3 hours per day, depending on the subject. Oral and written midterm, oral and written final. \n"
        },
        {
            "course_name": "First-Year Russian I",
            "review_date": "May 27, 2015",
            "review_content": "\nNataliya is not only one of the best professors I have ever come across, but is truly one of the most kind-hearted and welcoming individuals on this planet.  Seriously.  In class, she is a compassionate (albeit demanding) professor, who sets high expectations and thoroughly invests herself in the progress of her students.  She always comes to class with a huge rush of energy, despite the fact that she teaches multiple sections and oversees the entire language program (with Alla Smyslova, I believe).  Moreover, she makes herself essentially available at all hours - willing to meet at any time, answering e-mails late at night, staying after class to talk, etc. \nShe and her husband Ilya (also a fantastic human being) recently came here from Harvard, and they both are exuberant and devoted to their subject.  I have heard stories of students going to Russia and meeting up with Nataliya and Ilya, going around the city with them to concerts, bars, museums, etc.  For me personally, Nataliya has been an essential member in my progress - writing numerous letters of recommendation (often at short-notice), referring me to different language programs and different people, offering advice, discussing topics related to other courses, talking about life, etc.  \nI wholeheartedly recommend Nataliya, and would tell any of my friends to take Russian with her as a must before leaving Columbia.\nWorkload:\nElementary and Intermediate Russian both have a lot of nightly homework assignments, but they are always extensively graded and corrected.\nTests and quizzes are relatively easy, the expectations are always made clear, and time is devoted in class to preparation.\nBe prepared to speak in class, especially in the Intermediate level.\n"
        },
        {
            "course_name": "First Year Russian",
            "review_date": "June 25, 2014",
            "review_content": "\nNataliya is a rare gem at Columbia, a professor who is consistently engaging, has an unfathomably thorough and wide-reaching knowledge of her subject matter, and is an extremely nice person who will spend as long as she needs to working with you to improve. She's taught me in all of my first and second year Russian classes, and that's because I've pretty much built my schedule around making sure I could keep my MTWR free at the time she teaches the class. for all my Columbia-honed complaining tendencies, it is very difficult to find a flaw in her teaching of the class.\nBasically every day is like this in the first four semesters of Russian. You come in and have at least a 10 or 15 min conversation in Russian led by her; she'll prompt you with content and level specific questions. She will hound you (nicely) on your pronunciation and intonation  from day one, so you don't develop bad habits that often remain in non-natives who teach Russian (or any language really). You'll usually do a few minutes of group work, which is pretty much unavoidably awkward at first but gets better with time. Then she'll cover the actual grammar topic for the day, and finish it off with a video or a song which shows the lesson in contect. It's a ridiculously balanced class and it does a great job of enforcing cross-disciplinary learning.\nIt also helps that the books for all four semesters were written by Professor Miller, and he likes to visit class once in a while to see how his curriculum is going. The first year book is very very good. The second year one is average/kind of dated in terms of organization and presentation of information, but has a logic to it that you'll start to pick up during second year spring. \nShe makes you work hard and be thoroughly involved in learning the language, but her grading is incredibly fair. She looks for reasons to give you credit rather than to take it away, and she's much more happy with seeing you improve from a lower point than just contenting yourself with a B and not putting in any more effort.\nOverall a phenomenal teacher with a very balanced curriculum to back it up. Russian is still complex of course, but Nataliya is a more than capable guide.\nWorkload:\nA few small exercises every day, with a composition usually assigned on the weekends. It seems like it's more than it is but the exercises are usually pretty short. It's usually more of a problem to actually keep up with the number and not miss too many days; they really start to pile up after a while. That being said, she will almost always accept late homework and not penalize your grade for it; she cares more about if you put in the effort than when you did.\nTests every two weeks or so (time limits are a bit rough on these), written and oral midterm and final respectively.\n"
        }
    ]
}