{
    "prof_info": [
        {
            "prof_name": "Martha Howell",
            "prof_id": 23,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "European Merchants in the East",
            "review_date": "August 22, 2014",
            "review_content": "\nThis course was conceptually fascinating but the execution was mediocre. The syllabus was split between European primary sources, scholarly analyses of existing histories of this period, and one very good novel (David Mitchell's \"The Thousand Autumns of Jacob de Zoet\"). This was the first year that Professor Howell had taught the course (or at least this iteration of it, she told us), and the syllabus focus reflected that. Her research specialization is in the VOC, so that section of the course is both broad and deep, and quite rewarding in comparison to most professors' handling of that particular subject. However, (at the time) she had conducted no primary source research with the non-European sources from this period. This wasn't always an issue, but it definitely truncated the point-of-view of the classroom discussion at least.\nAbout Professor Howell - she tells students up front that she will harshly grade their prose as well as their ideas and argument execution. It's not as bad as it sounds, so long as you actually edit your essays before you hand them in. What's by far the worst part of the class is the way she handles classroom discussion. If people don't want to really discuss a source, or didn't come prepared, she won't move on - similarly, if she wants to move onto a different source or topic, she will interrupt a rich conversation to say that it's time to move on. She is a really nice person and very smart, but overall I thought that the class needed to both be more relaxed (in discussion) and tighter (in syllabus focus).\nOverall, I would only recommend this class if you have a particular interest in the social parts of economic history or if you want to learn more about the VOC. I used it to complete a specialization requirement, and if I didn't need it in my final semester I would have dropped it for another history seminar.\nWorkload:\nFor undergrads - three papers and required class participation. The first paper is short (5 instead of 8-10 pages) but graded harshly to, as she justifies it, get you ready for her grading of the next two papers.\nFor grad students - one of the last two papers should be longer (25-30 pages) and focused on primary-source research.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 04, 2009",
            "review_content": "\nI cannot believe that this woman is recommended as a CC teacher.  I had her Spring 2006 (she only teaches one semester).  We had to buy a TON of extra stuff that wasn't on the syllabus (including a Foucault reader - ugh) because she had no idea what the CC syllabus was since she hadn't taught it for two years.  True, her lectures were more interesting than average, but the sheer ridiculousness of her grading is enough for me to wholeheartedly tell anyone and everyone never to take her.  She actually told me, following a conference with her about my paper, that \"Well, I had already given six people A's, so I had to give you a lower grade so that there would be enough of those.\"  Her final exam was essay questions that she gave you (sounds great, doesn't it?  Just wait), but there are 10 of them, each requiring you to discuss at least 6 books (most required 8).  The topics were incredibly obscure and did not at all encompass points of merit from the works, merely addressed her own interests/agenda (she loves feminism/women's rights).  I wish I still had the topics to include and fully forewarn you NOT TO TAKE HER.  My wholehearted warning will just have to suffice.  Stay far away.\n"
        },
        {
            "course_name": "Family, Sexuality, and Marriage in Premodern Europe",
            "review_date": "April 06, 2008",
            "review_content": "\nI absolutely disagree with the previous reviewer, and therefore felt compelled to write a review. This class was the best I have taken at Columbia thus far, and Professor Howell was by far the best professor I have had thus far. True, this isn't a class with an incredible volume of details, names, and dates that have to be committed to memory, but I think if you get used to the fact that history does not have to be that way, you appreciate Professor Howell all the more. Howell assembled a  great selection of primary sources through which to examine the institution of marriage in European society. She was far more interested in having us understand the evolution of family and marriage over time, and the subtle nuances of these institutions, than simply having us spitting out a bunch of laws/dates/notable figures. She lectured clearly and I can honestly say that she made each class interesting and a pleasure to be in. She really tried to engage the students and make the class as interactive as possible. Furthermore, she is incredibly willing to make herself available to students and does not have a drop of arrogance, which is especially rare in professors of her stature (she is one of the foremost scholars in women's history). While she certainly did not give out A's like it was her job, when people had a hard time with her midterm, Professor Howell allowed us to go home and rework them to bring up our grades. She definitely has a heart, and was never a stickler just for the sake of it. She truly wanted every student to do their personal best.\nWorkload:\nFair amount of reading (you don't have to do all of it, but definitely do some because she calls on people in class). Two essays, which I did well on, but others seemed not to...Midterm and final, which were difficult, just because of the number of citations required in a very short amount of time.\n"
        },
        {
            "course_name": "Family, Sexuality, and Marriage in Premodern Europe",
            "review_date": "January 11, 2008",
            "review_content": "\nThere is not enough material on this subject to make up a semester long class!  Professor Howell sometimes spent an hour and fifteen minute class going through less than ten pages of clearly written texts.  The information was spread so thin it was difficult to keep track of it all--the class had no cohesive narrative.\nProfessor Howell grades incredibly harshly on papers and writes incredibly HARSH comments.  She is not just content saying that you wrote an grammatically incorrect sentence--she goes after your whole writing style.  I had to spend an extra three or four hours scrutinizing my grammar in order to get a good grade on the paper.\nThe midterm and final were way too hard.  She asked us to write 2 essays that would typically take a week to research and write (one prompt was identical to a take home essay she had recommended we take two weeks to write) in very, very short amount of time.  The midterm was the most stressful test I had ever taken at Columbia.\nWorkload:\nVery uneven readings (usually readings were under ten pages, then, occasionally, they were over a hundred!), 2 papers, midterm, final\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 09, 2004",
            "review_content": "\nIn all honesty, Martha is possibly the best instructor I've had at Columbia thus far.  She is extremely intelligent but she applies this towards making her students think critically.  Reading is a must if you want to participate, and participation is key if you hope to get a good grade.  Her grading is pretty harsh, but she forces you to improve in grading so hard.  If you want to get the most out of CC, I would recommend Martha in a heartbeat.\nWorkload:\n2 papers, 4-5 pgs in length, a midterm, a final(rather tough), and a presentation to the class (on one of the works during the course. You are expected to teach class with another student for about an hour, and you must hand in a 3 page summary paper of your presentation).\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 11, 2002",
            "review_content": "\nIncredibly engaging teacher who really loves what she is doing. Made CC the best core class I have taken. Has fairly evident leftist and feminist leanings but still open to non-leftist/feminist ideas. Fair but still somewhat difficult grader.\nWorkload:\nthree two-page response papers on a topic of choice (graded pass/fail); two five page papers with typical gradin scale; midterm and final.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 10, 2002",
            "review_content": "\nLiberal feminist who overwhelms the class with feminist theory and reading. She most certainly is not the easiest teacher of CC at Columbia or anywhere near it. Class usually goes by relatively quickly, and discussion is good if you can stay up with what she's talking about, but I would not recommend taking her if you can avoid it. If you do, be prepared for a grader who grades you on grammar and style, not thought. L&R; part II.\nWorkload:\n2 moderately difficult papers. Midterm and Final where you are given 7-10 relatively difficult questions prior to the test and have to study them as 2-3 will appear on the test and you have to do all of them. 3 500 word response papers that are annoying more than difficult.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 31, 1999",
            "review_content": "\nLeftist leanings pretty apparent. Nevertheless, a good teacher, pretty lenient in allowing the class to not read, one of the easier sections of CC.\n"
        }
    ]
}