{
    "prof_info": [
        {
            "prof_name": "Caleb Crain",
            "prof_id": 2475,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Melville's Novels",
            "review_date": "May 07, 2005",
            "review_content": "\nProfessor Crain's intellectual strength manifests itself in a number of ways.  His published academic work and his journal reviews/articles are brilliant--historically informed, politically conscientious, logically rigorous, fun.  While he won't smother you in insights, he subtly coaxes the class into making its own.  Perfect. \n"
        },
        {
            "course_name": "Melville Seminar",
            "review_date": "April 28, 2005",
            "review_content": "\nHe is humble and unassuming, but he has more than enough background and requisite knowledge of the material, since that material is usually the subject of his books, research, and free-lancing articles.  Despite writing and theorizing on the texts in his own publications, he hardly mentions his own theories in class, let alone forcing them down your throat.  Brilliant without being intimidating, he's quite anxious to hear your interpretations in class and in office hours.  The one time he finally laid out one of his theories, he did it in such a riveting way and the suspense was genuine.  One or two office meetings with him and you'll have more than enough secondary material or research for your paper.  I hope that the English Department doesn't keep him an adjunct forever.  Hopefully he'll have the chance to rise up.\nWorkload:\n150-200 pages a week, though we have five classes exclusively for Moby-Dick.  1-2 page responses for at least nine readings, and it benefits you to do them since he'll comment about whether your responses can lead to essays or where to find more material.  A culminating seminar paper of 10-15 pages, but if you follow along with one theme in your response papers, you'll have more than enough to fill the seminar paper.  \n"
        },
        {
            "course_name": "Melville Seminar",
            "review_date": "March 22, 2005",
            "review_content": "\nAn absolutely amazing professor.  A little shy, a little nervous, but brilliant.  A great class, with an entire 5 weeks devoted to a patient reading of Moby-Dick.  One of the young and budding stars of the English department.  Cannot recommend him enough.\nWorkload:\nVery fair.  Reading is the usual amount for a seminar (about 150 pages a week) with weekly 1-2 page response papers due.  But you only have to do 9 response papers out of the 14 weeks, for whichever weeks you choose.  Also, 10-12 page final paper.\n"
        }
    ]
}