{
    "prof_info": [
        {
            "prof_name": "Jennifer Zwarich",
            "prof_id": 3979,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to the Study and Theory of Film",
            "review_date": "May 03, 2011",
            "review_content": "\nInitial feelings toward Professor Zwarich was definitely a bit negative due to disappointment that she wasn't Korean or named Nelson Kim, but she ended up being a pretty good instructor who you could tell wanted students to like/enjoy the class (and her). The only thing is that a lot of the times she would read off long passages of really pretentious sounding quotes from the assigned readings for that week. I mean, come on, we're reading this already (sometimes). We don't need to hear it again via an audio version. Hence sometimes it was easy to not follow her during her speeches. She definitely conveyed her passion for the films she was showing which sometimes ended up being contagious. Overall a good teacher who tries hard and so deserves some commendation.\nWorkload:\nMidterm, paper, final paper. \n"
        },
        {
            "course_name": "The Documentary Tradition",
            "review_date": "March 21, 2009",
            "review_content": "\nJennifer is young and smart and beautiful, but a little uncomfortable as a professor, and unfortunately her lack of confidence makes her seem unfriendly. I really thought she was mean (and nervous) until i met with her (which she was happy to do) and realized that she's totally sweet, just nervous in front of a class. She really is quite nice and very helpful and wants everyone to understand and ask questions...she just isn't very good at creating that kind of environment (yet). She would ask us questions about the readings, but would also read her own academic-style summaries (with quotes and everything) of the readings. These were not helpful for me because i found her writing style to be confusing, but the TA in my section always answered lingering questions. It was my first film class and my first semester at Columbia, and i survived...i might even take more film classes. Overall i would say go for it if Jennifer teaches here again. (She's really from NYU.)\nWorkload:\na lot of reading (but not too much), midterm paper, final paper. no tests. section required, but very helpful.\n"
        }
    ]
}