{
    "prof_info": [
        {
            "prof_name": "Alan Stewart",
            "prof_id": 2053,
            "total_reviews": 14
        }
    ],
    "reviews": [
        {
            "course_name": "Tudor Stuart Drama",
            "review_date": "February 04, 2011",
            "review_content": "\nAt first, I was very weary of this course.  Having read some Tudor and Stuart plays I was already not a fan of many of the works covered.  I will not say that Professor Stewart necessarily made these plays significantly more appealing to me, but I definitely appreciated his knowledge and attempt to make these plays seem interesting.  The course does cover a lot, and I agree with the other reviewer that I wish he delved deeper into some of the texts.  He picked a wide range of plays that contrasted and were deliberately chosen to give a wide span of the time period.  While I didn't enjoy all of the plays, I was pleasantly surprised at how much more I learned about the period by the end of the course (there were a lot of \"bad\" playwrights and I think it was beneficial to see different styles).  He knows A LOT about the period and brings in materials to class to help put the plays in context (and therefore made it clearer why the plays differed in style and quality at times).\nAs a professor, I really grew to appreciate Professor Stewart over the course of the semester.  He encourages people to speak up and is very encouraging and open to his student's thoughts in class.  He was a very fair grader and he appreciates you coming to his office hours and is very helpful in terms of giving you feedback, improvement, etc.\nIn a university where at times professors give their exams and papers to TAs I really appreciated Professor Stewart's dedication to each student's exam and paper.  He graded every single exam/essay and wrote extensive comments on both.  Not only was this helpful it also made me realize that he actually cares about his students and doesn't just want to hear his ideas regurgitated back to him.\nWorkload:\nA play a week, 1 short 4-page close reading essay, a midterm with IDs and an essay, an 8-10 page essay worth 40% of your grade, and an exam with 2 essays.  Very manageable.  However, he grades VERY fairly and expects excellent writing in everything you turn in.  He also is very clear in the format of his exams and even gives mock questions to help you prepare.  He wants you to do well, but you do have to work for it.\nAlso, he takes attendance so go to class and will grade against you if don't attend.\n"
        },
        {
            "course_name": "Tudor Stuart Drama",
            "review_date": "December 30, 2010",
            "review_content": "\nDr. Stewart seriously attempted to make this class as entertaining as possible. Many students appeared to enjoy the course. I was not one of them.\n1. Stewart's lecture \"technique\" consisted of glossing the texts. For virtually the entire class.\n2. Stewart allowed certain class members to completely dominate the discussions with their inevitably inane comments. \n3. I found the texts themselves exceedingly dry and tedious. (After the first 3 plays, I was happy to not read another for a few months.)\nOn the plus side, Stewart knows an incredible (almost scary) amount about this period, and does provide some interesting reads. He's also an extremely fair grader, reasonable, and an overall nice guy. I wish he had focused on delving deeper into the texts instead of just explaining \"what happened\" and moving on to a cursory interpretation.\nWorkload:\n2 papers--1 3-4 page, one 6-8. \n1 midterm with ids and an essay. Final with 2 essays.\n"
        },
        {
            "course_name": "Tudor Stuart Drama",
            "review_date": "January 23, 2010",
            "review_content": "\nProfessor Stewart is very British and very hilarious--his dry sense of humor definitely brightened my day each time I had class. Though perhaps Stewart's demeanor may be too dry for some, in general I found the class to be quite interesting. Stewart is clearly extremely knowledgeable about the subject matter and was great at pointing out comical idiosyncrasies in the texts. He deftly balanced both a respect for the commonly-marginalized non-Shakespearean dramatic works of the Renaissance, as well as a good-natured appreciation for how absurd some of these works are at times. The plays he selected were generally very enjoyable to read. He also made sure to make himself available for students to discuss papers, and gave very helpful suggestions. \nWorkload:\nOne 4 page paper, one 8 page paper, mid-term, final, all graded fairly. Enjoyable reading. \n"
        },
        {
            "course_name": "Tudor Stuart Drama",
            "review_date": "November 18, 2009",
            "review_content": "\nProfessor Stewart is witty, humble, and seems like a really nice person, but he doesn't seem that excited about teaching this class. Lectures leave much to be desired. A lot of the information is in the introductions to the plays given in the course anthology. He does provide some interesting historical material to situate the plays in a way you couldn't on your own, but other than that, the class is pretty dull. If you're going for the drama req, take Shakespeare with Shapiro instead of this class. If you do take opt for this course, pick your favorite stimulant - you'll need it. \nWorkload:\nNot much. Just annoying. \n"
        },
        {
            "course_name": "English Lit 1500-1600",
            "review_date": "May 14, 2009",
            "review_content": "\nProfessor Stewart gives really dull lectures that are not intellectually stimulating at all. This might be a good course to take if it's your very first English course ever in your life, but otherwise, you will find it to be incredibly boring and elementary. If you do sign up, expect a semester of Stewart reading the poems back to you in class, then rambling a bit about nothing in particular, and then moving on. The whole class is like that. Not recommended, unless you are looking for a hella easy pre-1800 class to knock out that last requirement.\nWorkload:\nReading is so little you will probably end up not even doing it. That's okay, though, because he reads it back to you the next day. Plus, the midterm is just one question on one author, and the final is two on two. One short paper, and one  8-pager. \n"
        },
        {
            "course_name": "English Lit 1500-1600",
            "review_date": "May 11, 2009",
            "review_content": "\nSigh, I get tired just thinking about this class.  The professor admitted that he was teaching it because he had to, not because he wanted to.  Most of the class was him lecturing and asking questions that nobody wanted to answer because they were too elementary or because nobody really cared, leading to a lot of awkward silence.  That's about it.  \nWorkload:\nOne 2 page paper, one eight page paper, midterm (1 essay), final (2 essay)-both tests were fairly easy if you just read one or two texts all the way through, weekly reading which you could easily get away with not doing.  \n"
        },
        {
            "course_name": "Shakespeare II",
            "review_date": "May 20, 2007",
            "review_content": "\nThis was a good class. Prof. Stewart did a good job of approaching the works from one or two different angles rather than trying to cover them from all angles. He was interesting and a good lecturer, and he kept a good sense of humor despite the class' slight lack of enthusiasm (myself included). I would recommend this class.\nWorkload:\nA short close reading assignment, a longer paper, a midterm, and a final. The midterm and final are very straightforward and not too difficult. All are graded fairly.\n"
        },
        {
            "course_name": "Shakespeare II",
            "review_date": "May 10, 2007",
            "review_content": "\nA very kind and unpretentious man.  When I had read the play, the lectures were very stimulating.  And his awkward jokes are always adorable.  A very good intro to Shakespeare.\nWorkload:\nOne 3 page paper, one 8 page paper.  midterm and final.  but they're all graded easily\n"
        },
        {
            "course_name": "Shakespeare II",
            "review_date": "May 06, 2007",
            "review_content": "\nI took this class in Spring 2006, too, and I found Professor Stewart to be a very nice man, but a mediocre lecturer at best.  He begins the class with Hamlet. The Shakespeare I class I took the semester before ended with Hamlet - so you get Hamlet twice if you take both classes - but I'm not complaining because it's a fantastic play.  But, I found Stewart's reading of it to be significantly less insightful than my previous professor's.  In general he spends a lot of time discussing the history behind the plays which is very interesting, but not very engaging, and often less than illuminating (if you have a reasonable background in English history, you can come to many of his \"insights\" on your own).\nWorkload:\nNot a lot at all.  Like a play a week - midterm and final are so easy and the 2 papers are very fairly graded. \n"
        },
        {
            "course_name": "Shakespeare II",
            "review_date": "May 13, 2006",
            "review_content": "\nPr. Stewart is a hidden gem. I'm not sure I should even be writing this.\nIf you're the kind of person who goes to class regularly (95%-100% of the time), who shows up on time and who reads the plays assigned, you should love his class. \nIf you have genuine respect and interest for his class, he will know it, and your experience with him will be valuable. \nIf you don't care, or don't try, he'll know it too, so it's not even worth trying. He values students who value his class, and who work hard.\nSome students felt like he simply read through the handouts during class, but I disagree. Without his explanations, the handouts were useless. They were also very well crafted. \nHe is an extremely funny man, so sitting through class is actually quite pleasant.\nFor those who like to suck up to professors, it will not work with him, he's far too smart, and will detect it immediately.\nBasically, if you do your work, show up on time regularly, and ask a couple of questions now and then, you'll be fine.\n\nWorkload:\n1 short paper, 1 long paper (8 pages), a midterm (with some IDs and an essay), and a final (which consists of two essay questions you can pick out of ten). If you read your plays, it's no problem to get good grades.\n"
        },
        {
            "course_name": "Shakespeare II",
            "review_date": "May 07, 2006",
            "review_content": "\nEither Stewart has improved tremendously or the first two reviewers are full of it.  I took the Shakespeare II course in spring 2006 and thought it was great.  What's wrong with reciting key speeches in class?  How else can you teach Shakespeare?  He even gives you a handout of all the text and other material he will discuss in class, so you don't have to tote the book around or take many notes.  Stewart also interweaves general topics, such as textual problems and Jacobean politics into the discussion of the particular play assigned.  He leaves about 10 minutes at the end for questions and discussion, which is good or bad depending on the quality of the students' input.  I enjoyed the class in its present (2006) configuration and I recommend it.\nWorkload:\nMaybe a little too easy.  We did one play per week, with no secondary sources assigned.  Perhaps a good scholarly article about each of the plays could be added without making the assignments too arduous.\n"
        },
        {
            "course_name": "Complete Works of Christopher Marlowe",
            "review_date": "April 29, 2005",
            "review_content": "\nThe name of the class pretty much says it all. You read all of Marlowe's plays and poems over the semester, spending one class per play in discussion. Professor Stewart comes well prepared with lots of interesting details and trends to examine for each work, but is open to students' interpretations and willing to let the conversation get off the original track.  He knows a lot about Marlowe's life as well as the period in which he was writing, but doesn't parade his knowledge in a showy or irrelevant manner. I would definitely recommend this class.\nWorkload:\nOne play per class, but they're not long and you'll probably find them interesting. Plus, if you decide to bail on the reading you can just pay attention to class discussions to find out important themes, etc. One 15-20 page final paper, or two 8-10 page papers (midterm and final).\n"
        },
        {
            "course_name": "Shakespeare II",
            "review_date": "July 22, 2004",
            "review_content": "\nI totally agree with the previous reviewer: this class is a waste of time. Basically, you can get away with doing nearly no work (reading about two of the plays will get you through the midterm and final), and you're not given any motivation to read anything either. Stewart doesn't lecture and spends most of the class asking people what they think. Honestly, why would you take a lecture if you wanted to only hear what the other students thought (generally the same 5 people talking) as opposed to the professor? He can't control the more obnoxious students who interrupt him and tell useless stories about their Uncle Herman or how this and that passage was really funny. He's too nice to tell them to be quiet. As for his essay instructions, it's utter rubbish. He gives single sentence instructions and docks lots of points for you not giving him what he wants. If you go see him in office hours, he'll tell you what he wants and then dock points for you giving him what he wants, claiming that it WASN'T what he wanted in the first place and that he really wanted what he originally told you he wasn't looking for. Stewart is obviously not very interested in Shakespeare or at least he displays a total lack of enthusiasm for what he teaches. Don't expect to learn anything from this class. If you take it, don't bother going to class--basically nearly half the class was missing during each lecture towards the end of the semester. \nWorkload:\n2 papers (one short, one long), 1 midterm, 1 final (cancelled due to strike and another paper was cancelled too)\n"
        },
        {
            "course_name": "Shakespeare II",
            "review_date": "April 29, 2004",
            "review_content": "\nDespite the fact that the syllabus includes some of the greatest literature ever written, this class is a total waste of time.  Stewart hardly lectures at all, and instead reads long passages aloud and then asks the class \"So what do you make of that?\"  The rest of the time is filled with generally pointless and random comments from the peanut gallery, which is usually dominated by a single student.  Stewart generally didn't build off the comments at all, so the class just degenerated into a free-for-all and no one learned anything about the plays.  And man, were there ever a lot of old people taking up space in an overcrowded classroom.  Despite some attempts to structure things more (handouts, themed discussions), no real order or substance ever evolved.  The only highlight was a hand-out featuring Renaissance translations of classical texts dealing with man-boy love ( \"The only true love is that of younge boies..\")  Perhaps the class would have been more fun if we had talked more about pederasty; after all, Prof. Stewart is the author of \"Close Readers: Humanism and Sodomy in Early Modern England.\" You can learn more about Shakespeare by reading the plays at home with a few supplemental texts, don't bother with this class.  \nWorkload:\nVery light.  Two papers (2 pages, 8 pages) and an in-class midterm.  The final was cancelled due to the Grad Student strike.\n"
        }
    ]
}