{
    "prof_info": [
        {
            "prof_name": "Aaron Gullickson",
            "prof_id": 2375,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Global Populations",
            "review_date": "December 22, 2006",
            "review_content": "\nGullickson really teaches population theory rather than current population issues.  The majority of the class is spent bouncing back and forth between famous demographers' famous theories--I wished we could learn more about what ACTUALLY happened in population instead of  what famous men theorized might happen.  The workload is light--maybe 60 to 100 pages a night--but there is no textbook, only thesis papers.  Thesis papers only give information that is relevant to proving the thesis, so it was difficult to sift through what was actually true.  Gullickson was really good at clearly laying out each demographer's hypothesis and theory on population--but he was a superhard grader on the midterm. \nWorkload:\nReading every day, 1 midterm, 2 final papers (3-4 pages each)\n"
        },
        {
            "course_name": "Statistics/Methods",
            "review_date": "July 25, 2006",
            "review_content": "\nProfessor Gullickson is a fair teacher. He's mindful that statistics is not exactly what most students consider a fun time. His teaching style is purely conceptual, so he outlines how to apply theory in certain problem sets, but rarely delves into detail on how to solve them mathematically. It would be wise for you to take advantage of his office hours.  \n"
        },
        {
            "course_name": "Statistics and Methods",
            "review_date": "October 28, 2005",
            "review_content": "\nFor a first-time teacher at CU, it was clear to me throughout the course that Professor Gullickson certainly had some kinks to work out.  For example, the entire class ran out of time on our midterm.  For a class of non-math majors, I found that he was not able to apply \"theory to practice\" in an effective manner (he rarely went over examples on how to actually do different types of problems).  During office hour meetings, I also found this to also be the case.\nThat being said, if you put a tremendous amount of work into the class (I spent roughly 6 hours a week on problem sets--which he said to the class at one point was typical), the curve allows it that you should walk out with a B. He also assigns odd problems often which have answers in the back.  He is a nice guy and was also extremely accessible outside of class.  After the midterm disaster, he compensated by making our final much shorter and extremely manageable in the time that was alloted.  HWs also got progressively shorter as the semester progressed.\nWorkload:\nWeekly problem set, midterm, final\n"
        },
        {
            "course_name": "Statistics and Methods",
            "review_date": "January 02, 2005",
            "review_content": "\nI believe that this was Prof. Gullickson's first class and he did a good job.  I am a sociology major so I had to take this course as a requirement.  I'm not a math person, and this class doesn't exploit that.  The subject matter is relatively straightforward.  Personally, I didn't really learn that much in class since there is a lot of material covered.  I taught myself mostly while working on the weekly problem sets, which were rather time-consuming.  This is really no fault of Prof. Gullickson's.  He was very responsive to student comments and questions and was very easy-going.  You can choose to be engaged in this class or to teach yourself from the expensive book.  Overall, I enjoyed the class and it was pretty easy.\nWorkload:\nWeekly problem sets that took a few hours to complete.  The worst two grades are dropped.  The midterm and final were moderately difficult.  There is a curve of some sort, my B+ was bumped to an A-.  I only worked on this class on Sunday nights doing the problem set.\n"
        }
    ]
}