{
    "prof_info": [
        {
            "prof_name": "Francesco Angelis",
            "prof_id": 3959,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Roman Art & Architecture",
            "review_date": "November 17, 2011",
            "review_content": "\nProf. Angelis was excellent and I hope to take other courses with him in the future.  Although he has a slight accent and seems disorganized in the beginning, he is actually one of the most organized presenters and lecturers at Columbia.  The slides he picks for each lecture tell a theme/story from start to finish and there is never an excessive slide in that mix.  I really appreciated that each lecture had a topic which ended up being one of the many options for essay topics for the final.  This made the subject matter easy to understand and follow. for example, one week the topic would be roman portraits, another one would be funerary monuments, another one would be triumphal arches...simple and organized.  \nI did most of the readings, but they were not really necessary.  Most more interesting, some no so much.  It is important to come to class to get notes from his lectures as the textbook is decent, but does not follow the same order of topics.  Textbook seemed more disorganized compared to his lectures. \nDefinitely take this class!  The subject matter is also very interesting. \nWorkload:\nOne midterm (which includes an essay /book review already prepared), one final exam and one 10 page paper on whatever topic related to the book you chose for your book review.  Totally doable.  Additional readings, but not necessary.  Definitely come to class and listen to his lectures, and take notes, you will be fine.  He hands out a long list of possible books beginning of semester to choose from.  Augustus is fascinating! \n"
        },
        {
            "course_name": "Roman Art & Architecture",
            "review_date": "March 29, 2010",
            "review_content": "\nKill me now.  I have no idea of what the organizing principle was behind this class.\nDe Angelis is a lovely man, who's willing to help you out, but the exams are murder -- 150 slides for the midterm, of which we had to identify ten (seriously, slide identification is bad enough, but ten percent?  that's just not on), and all the floorplans look alike and oh my god, kill me now.  As a non-art-history major (who has taken art history classes before!), I had a really difficult time figuring out when something in the lecture needed to be in my notes, and when it was just \"interesting thing I would like to remark upon.\"  \nThe TAs in Spring 2010 were pretty good; responsive to emails, willing to admit when they didn't know something, and that is really all I can ask.\nWorkload:\nMidterm, final, 10-page paper, reading, trip to the Met.\n"
        }
    ]
}