{
    "prof_info": [
        {
            "prof_name": "Grayson Cox",
            "prof_id": 11028,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Basic Drawing",
            "review_date": "January 14, 2012",
            "review_content": "\nThis class was definitely a mixed bag. On one hand, I'm pretty sure that most people who came into the class with some experience had a great time. Grayson was nice, funny, and encouraged us to push our creativity and style in whatever direction we chose. The second half of the semester was focused mainly on developing independent projects of whatever ilk we liked. One kid parodied Italian Renaissance saint portraiture by including lemurs crawling on the saints, another girl drew a bunch of body parts in great detail, including a horrifyingly accurate penis, and another student drew a series of abstracted self-portraits. In other words, we were given a *lot* of freedom.\nThat said, the class was lacking in actual teaching. A few of the classes focused on specific topics, like drawing in perspective and figure drawing, but beyond short introductions or demos, teaching consisted of words of encouragement that weren't really helpful. During critiques, Grayson would open up discussion to the students, then would occasionally sprinkle in soft constructive criticism along with positive reviews, whereas the TA, Lauren Silva, would usually be more honest and harsh about the quality of a piece. Things got awkward when they critiqued poor drawings, because they didn't want to be mean, but they didn't have much good to say -- which meant nothing much was said at all. \nAll in all, I think the quality of the class depended on who you were. The students who had never taken drawing classes before clearly struggled (some dropped the class late in the semester, probably out of frustration), whereas those who entered the class with some experience were able to use their already-acquired skills to push their creativity and expression. More focus on the techniques behind drawing would have been helpful, especially for those with little experience. In other words, it seemed to me more what a Drawing II class should have been.\nJust as a side-note, he mentioned that he also taught at Pratt, and I could never shake the feeling that we were his \"just for fun\" class that he didn't take too seriously. The grading (many students got an A+, and I would be surprised if anyone received below an A-) seems a reflection of that.\nWorkload:\nWith rare exception we had a take-home drawing every week, which took as much time as you let it. The final portfolio consisted of 25 in-class drawings and 10 homework drawings, which was easily doable. \nGrading was never made clear during the semester, but I think something like 50% of the class got an A+ and everyone else got an A or an A-.\n"
        }
    ]
}