{
    "prof_info": [
        {
            "prof_name": "Valerie Purdie-Vaughns",
            "prof_id": 6710,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Cultural Psychology",
            "review_date": "May 15, 2015",
            "review_content": "\nPROS: \n1. The professor is knowledgeable and cool.\n2. She is enthusiastic about teaching and cares a lot about her students.\n3. The material is interesting.\nCONS:\n1. She refuses to post the lecture slides and is very adamant about not posting them. To make this worse, she would often change the slides too quickly. I spent the majority of my time and concentration trying to copy the notes rather than listening to what she was saying.\n2. She is misleading about the difficulty of the tests. What she claimed to be a straightforward take-home midterm that would take \"6 hours at most\" took the vast majority of the class 2 days to finish and was highly detailed, complicated, and tedious (some people did very well, some people struggled). Furthermore, a good number of the multiple choice questions on the final exam were weirdly worded and tricky/detailed. (You must do all the readings and memorize the lecture notes.) \n3. The group project was time-consuming and annoying sometimes. You know the deal: someone is always slacking off, it's almost impossible to find a time that's good for everyone, there is one person doing all the work, etc. She made us sign a group contract, but it was completely useless. Oh, and you have to make a poster, do mini-presentations for your classmates, and write a single-spaced 7-page paper with your group. The only upside to the group work was that it forced us to interact with our classmates.\nIt was a good class but some parts were very annoying. Be prepared to put in the work and time taking lots of notes and doing the readings.\n\nWorkload:\nTake-home midterm and final exam; poster, mini-presentations, and single-spaced 7-page paper with your group members.\n"
        },
        {
            "course_name": "Introduction to Cultural Psychology",
            "review_date": "November 12, 2014",
            "review_content": "\nI highly recommend taking this course- whether you are majoring/concentrating in Psych or not. The material is applicable to everyday life, with especially significant implications for business, law, and policy. \nProfessor Purdie-Vaughans is a fantastic lecturer who is both extremely organized as well as engaging. She assigns only necessary reading and makes a point to keep it minimal and the work level entirely doable. She also makes it very clear that her goal is just to help students learn, not to trip them up or create an impossible course. She actually means this. Often, she would consult the class on assignments, exam dates, etc. Whatever she said would be on the exam was on it- and nothing more. Extremely considerate and fair.\nThe TAs were all also very helpful, approachable, unpretentious, intelligent, and well-prepared when it came to answering questions and running review sessions. \nThere is a required group project for the course. Since I hate group projects, this made me question whether I wanted to take the course. But the project can actually be a great learning experience and an opportunity to do actual research and visit a site related to a particular interest you select. Putting up with the typically frustrating group project aspects are, in my opinion, worth it for this. \nSHORT VERSION- TAKE THIS CLASS. Everything about it is amazing. \nWorkload:\nCompletely reasonable and doable, if not light \n"
        },
        {
            "course_name": "Introduction to Cultural Psychology",
            "review_date": "November 17, 2011",
            "review_content": "\nProfessor Purdie-Vaughns is great. I'm so glad I decided to enroll in her Introduction to Cultural Psychology class this semester even though she had no culpa reviews. I've enjoyed her teaching style so much that I'm writing one now!\nVPV (no one calls her that, by the way...) is a great lecturer. Her lectures (with projected slides that aren't posted on courseworks) are always clear, interesting, and manageable for note-takers on computer or by hand. She teaches at a relatively slow pace, allowing for a surprising amount of class discussion for a lecture hall. She always answers any and every question. VPV is eloquent, knowledgable about the field, and generally likable. \nIf you're a psych major or just thinking about it, take anything with her. She says outright that her class is designed for everyone to do well, and she means it. She just wants us to learn. This has not been a really difficult class, but just enjoyable and somehow relaxing.\nWorkload:\nreadings (not tested on them until the exams)\ntake-home midterm\nfinal exam\ngroup project\n"
        }
    ]
}