{
    "prof_info": [
        {
            "prof_name": "Adam Knapp",
            "prof_id": 6616,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Calculus II and Calculus III",
            "review_date": "July 28, 2011",
            "review_content": "\nNot a helpful professor at all.\nIf you are in a situation to take this professor, there is always a next semester... trust me class average has never went above 50% for all exams and that is a pretty clear indication of him not using the ANY of the review problems.\nClassmates will disappear from the class as semester progress and if I knew about culpa before taking this class, I wouldn't have taken it.\nNot helpful, always gets lost in his own little world, and exams are retarded.\nWorkload:\nWorkload is very easy, most of homework assignments are even numbers so answers are pretty much given to you. once in a while he decides to be a rocket scientist and gives out some retarded questions though... don't waste your time/money/gpa\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "January 26, 2011",
            "review_content": "\nOk this is the first time I ever write on CULPA and i have to say this calc III section is absolutely a joke. Homework assignments are super easy considering that there are a lot of even-number questions so basically you can just use the solution manual to \"check\" if you got the answers right :) \nI stayed through the first lecture but found the pace of his lecturing tooooo slow. In the end, I only went to that classroom three more times:midterm one, midterm two and the final. \nAnd those exams are really easy and i can hardly imagine anyone who doesn't come out of this class with an A. So take Knapp's class if you don't care about math at all and all you want is an easy A! Just cram before each test and you will just do fine. But STAY AWAY FROM THIS CLASS IF YOU LOVE MATH AND APPRECIATE THE BEAUTY OF MATHEMATICAL KNOWLEDGE. As for me, i don't think i have learned anything despite getting an easy A which somehow makes me sad about Columbia and its record-high number of applicants this year....\n\nWorkload:\nBasically nothing\n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "January 18, 2011",
            "review_content": "\nTo cut right to the conclusion: do not take this class. There are plenty of other better Calc 3 instructors out there, and you really want to avoid this class at all costs if you don't want your GPA to be screwed over and if you are looking for a helpful instructor that actually cares about his/her students. I know of many sob stories as regards this pathetic, utterly unhelpful class, and please, do not fall for the misleadingly positive review below as it seems to be a trap concocted by the sadistic Adam Knapp himself to alleviate the pathetically petty attendance of his class last semester. \nWorkload:\nHonestly, not a lot; but homework is not helpful at all and you'll find yourself struggling on exams even if you have done all your homework \n"
        },
        {
            "course_name": "Calculus III",
            "review_date": "December 06, 2010",
            "review_content": "\nI thoroughly enjoyed Professor Knapp's class. I felt that he presented everything in a clear, well-thought out manner. He was always willing to stay after class to answer any questions, whether they directly related to the material in class or not, and promptly responded to all e-mails. Although I never took advantage of it, he also made himself available on Skype at certain times during the week to supplement his office hours, which I thought was pretty neat. Oh, and since we're talking about the Math department here, it's worth noting that English is his native tongue and he's friendly and easy to talk to. \nThat being said, he isn't for everyone. He's very knowledgeable about the material, but being a topologist, he would go off on tangents about how the things we're learning in class relate to topology and knot theory. He would also often extend techniques to working in complex numbers and quaternions, although he was always clear that he wouldn't test us on that. Being a math major who plans to specialize in topology and modern algebra, I found these digressions to be incredibly interesting, but based on the declining attendance through the year, I think many people just found them confusing and off-topic. \nOverall, I would highly recommend Professor Knapp if you are strong in math and want to learn about things that aren't strictly in the Calc III curriculum. However, if you're just taking Calc III to learn the material and move on to something else, he may not be the best fit.\nWorkload:\nWeekly problem sets (10%), two midterms (25% each), final (40%).\nProblem sets were straight from the textbook and fairly easy. I don't think I ever spent more than an hour on any of them.\nTests were very fair and only contained information that had already been covered in the homeworks. Professor Knapp puts together practice problem sets before each test, and as long as you know how to do everything on them, the actual tests are a breeze. The Calc III syllabus, for the most part, builds steadily and progressively on topics throughout the semester, so if you keep up with the class there isn't a whole lot of \"old\" stuff to re-acquaint yourself with before the final either.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "February 07, 2009",
            "review_content": "\nadam's calc 1 class was pretty bad. he would murmur only to the few rows of students at the front of the class and go in extremely roundabout ways of teaching, never really making anything clear. he is as helpful in office hours as he is in class, which is not very helpful. also, he absolutely did not prepare us in the right way for the midterms and the final -- although he puts up practice questions prior to the exams, the exams are always extremely brutal and of a whole different style away from the practice qs. you could argue that this is challenging, sure, but when you're smacked in the face with a first midterm with a level of difficulty he didnt prepare you for, it's a whole different story. his TAs on the other hand were extremely helpful and taught way better than him, always getting to the point and explaining the math in very clear and concise manners. bottom line: messy style of teaching, impossible exams with harsh grading, unhelpful, unengaging. \nWorkload:\n a weekly problem set of questions from the textbook that takes abt 2-3 hours, 2 midterms and a final\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "December 26, 2008",
            "review_content": "\nAdam was a fine teacher. He explained things well in class and posted all of his lecture notes online. He (or maybe his TA's) were particular graders, so don't expect a bunch of free points for writing down a few possible functions. He was definitely difficult to get a hold of outside of his scheduled office hours (I had a conflict and despite repeated attempts to make an appointment, we never did meet). The homework he assigns is fine, but his tests can be tricky. He gives out reviews before each test, however, which pretty much cover everything that is going to appear. Do them several times each and you won't have a problem getting an A or A+ in his class. I don't know if this will be standard for all of his classes, but there was a generous curve.\nWorkload:\nLight. 2 hours of homework per week. 2 mid-terms and a final. \n"
        }
    ]
}