{
    "prof_info": [
        {
            "prof_name": "Francesco Benelli",
            "prof_id": 1680,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Architecture",
            "review_date": "January 28, 2014",
            "review_content": "\nWhen you start this course, Benelli's accent will make it hard to understand, but that's probably mostly due to the fact that you're unfamiliar with the architecture terms so it all sounds foreign. Just pay attention and you will adapt quickly. The course is interesting. You learn a lot about Western architecture and it's nice to walk around the city, recognizing the different characteristics of the architectural styles used and knowing why the architects made those choices. He posts the power points for the class every morning on CourseWorks. You have to take good notes (I recommend typed) and attending the discussion sections (which are only about 5 for the semester) is EXTREMELY helpful, especially approaching exam times. The TAs relieve a lot of stress. My first exam I nearly failed, but through the TAs help for the final, I managed to get a B in the class overall.\nWorkload:\nOne midterm, one final (eight IDs each building flashed on the screen for about 3 minutes each, two comparison, one short essay) and five drawings. The midterm and final are completed during a class period, so they aren't too consuming.\n"
        },
        {
            "course_name": "Introduction to Architecture",
            "review_date": "November 10, 2010",
            "review_content": "\ntake it. even if you don't have to. it's super interesting and fun. there were a lot of slides for the midterm and final, but i think everyone did alright even though it was basically impossible to actually learn them all. the main thing thought is that benelli is a fantastic lecturer. he does have an accent, but you'll get used to it. and if you have questions he's happy to address them. the weekly drawings were a great break from sitting in the library like we have to do for most of our other courses. the discussion sections were great preps for the exams, but otherwise pretty boring.\nWorkload:\nweekly drawings (not hard, not graded on \"beauty\" at all), midterm and final. no paper!\n"
        },
        {
            "course_name": "Introduction to Architecture",
            "review_date": "April 19, 2010",
            "review_content": "\nBenelli is great. At first I was very concerned about his accent but after about 2 weeks, you get used to it. He is a great lecturer and the fact that he is a practicing architect really shows--he really does care about the subject. He often interrupted himself to ask the large class if everyone understood everything. When someone asked a question (even stupid, irrelevant ones) he always gave the question a thorough and insightful response. He's got a sense of humor too which made this class seem like a nice break in my day rather than another 1.5 hour lecture.\nAs for the exams, he expects you to know the date, name, and architect of all the works in the seen in class (and always posted promptly on courseworks)--standard for art history, I know, but it gets extremely difficult and confusing when you have to differentiate one floorplan of a church to another floorplan of a similar church. My only advice is to start studying very early if you really care about getting 100% on the ID section of the exam.\nThe best part about this course, though, was how it really made me appreciate architecture specific to New York. The drawing assignments force you to explore New York and make observations as to how all the previously studied, mostly European-in-origin, styles had been transplanted to New York. Now, when I'm walking around, I find myself constantly staring up at the building facades. This class not only enriches your architectural knowledge but your experience in the city. Truly the BEST art history class I've ever taken.\nWorkload:\nStandard of any art history class. Exams have the ID section, comparison, and then essay with a bonus question at the end.\nIn lieu of papers, you get 11 drawing assignments graded on a scale of 0-3, 3 being a well-rendered drawing (that shows that you actually visited and observed the place in person, rather than looked it up online) WITH annotations (these are more important than the formal details of the drawing). Remember that the assignments are supposed to show an understanding of the style, it's logic, and its origins rather than your drawing skill (though that helps a lot). That being said, if you just can't make time to visit the assigned site, looking it up on the internet will suffice.\n"
        },
        {
            "course_name": "Introduction to Architecture",
            "review_date": "December 17, 2009",
            "review_content": "\nThis was a fantastic course - you get a great overview on architecture beginning with ancient Greece and ending with present day architecture. Professor Benelli's accent can be a bit difficult to understand at first, but his lectures are phenomenal. I always looked forward to going to class. \nThe drawing assignments can be intimidating at first, but they're very enjoyable once you get comfortable with your drawing skills, plus they're also a great way to get yourself out of campus and visit the city's architectural landmarks. If you are interested in architecture or if you have a visual arts requirement to fulfill, this class is HIGHLY recommended.\nWorkload:\n11 drawing Assignments (the lowest grade is dropped), a midterm and a final exam (both consisting of building IDs, comparisons, and a short essay).\n"
        },
        {
            "course_name": "Antiquity-Artchitecture: French Renaissance-Postmodernism",
            "review_date": "May 18, 2005",
            "review_content": "\nHmmm..this is a tough review. When we had class, during normal class hours, this man said some really brilliant things. His accent can be tough now and then, hes personable, friendly, stays in great contact via email, and...well, when he screws up, hes willing to play ball. We only had this class maybe 8 times all semester, do to a bunch of weird cancellations....so he made the midterm and paper into pretty open-ended options. I guess my only complaint is that i wanted more. a lot of students were frustrated by the time changes, reschedules...but in my mind, that doesnt make him a bad prof.\nWorkload:\nmidterm, two short papers, final, two short papers\n"
        },
        {
            "course_name": "Italian Renaissance Architecture, 1400-1600",
            "review_date": "January 18, 2005",
            "review_content": "\nBenelli is a very nice guy, always willing and eager to answer questions, and knows just about EVERYTHING about Italian Renaissance architecture.\nNonetheless, I would be lying if I didn't say that this class made me want to scream.  As others have said, it was basically one big, fruitless exercise in slide memorization.  The lectures were too focused on minutia and included almost no theory of any kind.  The quantity of slides we were expected to memorize for the exams was simply unreasonable, particularily  as there was no slide list, the slides we did have were often not labeled, and Prof Benelli often neglected to give us the name of the architect, date, etc during the lecture, meaning, I guess, that we were supposed to look them all up on our own.  I studied like I have never studied before for the exams and still found them to be quite difficult.  However, Benelli clearly uses a big curve in the end, because while I got a B- on the midterm and couldnt have done much better on the final, I somehow ended up with an A in the class.\nMy advice: only take this class if you TRULY have a STRONG interest in Renaissance architecture. \n"
        },
        {
            "course_name": "Italian Renaissance Architecture, 1400-1600",
            "review_date": "December 27, 2004",
            "review_content": "\nVery good class taught by an excellent professor.  Prof. Benelli knows an enormous amount about the Italian Renaissance and gets very excited about having students appreciate it/understand it as well.  He is always willing to meet with students in office hours or hours outside of office hours and treats students with respect.  Francesco does have an accent, but it is pretty easy to get used to and offers a dimension of authenticity to the class (Italian prof teaching Italian RA).  The lectures were ok to follow, but I would recommend taking notes on a lap-top to keep up with the ideas and analyses Francesco provides at lightening-speed. \nWorkload:\nWorkload=studyload.  There is a 4 page paper due towards the beginning of the semester (the timing of which I think was very well-placed) and readings which weren't particularly necessary.  The midterm required an enormous amount of studying and the final required an obscene amount of studying.  It's manageable if you start  in advance, esp. for the final.\n"
        },
        {
            "course_name": "Italian Renaissance Architecture, 1400-1600",
            "review_date": "December 22, 2004",
            "review_content": "\nThis class was great. Benelli really knows his stuff and has a lot of interesting facts to enliven the subject. Some of the lectures get very detailed oriented on things architects might be interested in, but since I'm I wasn't, but thats only a few lectures. His accent is not hard to get used to and gives the class more authenticity, since this is an Italian teaching about Italian RA. He is very smart and fair grader. Everything you need to know for his tests will be covered in class and a quick read over a website on  architecture if you havnt been exposed to it before.\nWorkload:\nOne paper, one midterm, one final. Tests consist of memorizing info on buildings, and a very short essay. Readings....honestly not necessary for good performance in the class.\n"
        },
        {
            "course_name": "Italian Renaissance Architecture, 1400-1600",
            "review_date": "December 20, 2004",
            "review_content": "\nProf Benelli was a really nice man always willing to take students questions and input during lecture and always asking us to make sure that we understood everything that he said. However, the class itself was not thrilling. He pretty much related every building from the Italian Renaissance to the Roman triumphal arches, the Baths of Diocletian, the Colosseum, or the Temple of Fortuna Primegenia. Additionally, while I was able to do very well  in his class, the examinations were HARD. He does not give a slide list and only posts his unlabeled powerpoint lectures online. For each of the maybe150 buildings for the final we needed to find a picture and look up the architect, date and city. Additionally, we had to know the facades and the plans for every building. In my case, a friend and I split the work of locating everything and it still turned out to be truly obscene. I have never studied so much for a final in my life and still felt inadequately prepared. That said, if you do memorize all the information, the grading is pretty lenient. If you are truly interested in memorizing all of the buildings from Renaissance Architecture, then this is the class for you. I wish that he had limited the number of buildings he showedd us and told us more about the history behind why or how things developed or changed and what was going on historically that allowed for a certain architectural innovation. It was pretty much a run through of a lot fo slides.\nWorkload:\nMidterm, 4 page paper and final exam (nothing is difficultly graded, but the tests require lots of preparation to do well)\n"
        },
        {
            "course_name": "Italian Renaissance Architecture, 1400-1600",
            "review_date": "December 19, 2004",
            "review_content": "\nI think it fitting to write a review the night before the final so that my unadulterated hatred for this class can be fully articulated. The class is not absolutely terrible, but it is painfully close. Perhaps it is the nature of Renaissance architecture to be exceptionally redundant and boring, or maybe that is just Professor Benelli's teaching style and choice of content. \nLet me save you a semester: in the Renaissance, architects quoted the coliseum. There. I said it. If you want to spend a semester learning how every building during this period (or at least the wonderful ones he chooses to discuss) simply mimic the coliseumÂ’s architectural order, then you are a sad excuse for a Barnard freshman and you deserve the misery you will experience as a result of this class. Enjoy committing blueprints to memory.\nIn all fairness to Benelli, however, I am bitter in large part due to the flaws in his exams. Do not enter this class laboring under the delusion that the images shown in class will be labeled online. Do not expect them to be able to download the images in under 12 days as the PowerPoint presentations are about 628 terrabytes in size. Do not expect a slide list. Enjoy sifting through many hundreds (yes hundreds) of images of myriad buildings in a fruitless attempt to create a study guide. I swear to all that is good and holy he tries to make this as confusing and difficult as possible. When you try to draw a comparison between four identical buildings on a single slide, it would seem logical to label them. Nope. Not here. Have fun figuring it out yourself. Then again entering the examination clueless must build character. I am sure that is the goal of the class . . . ?\nPre-requisites: 1) Fast laptop with wireless internet and lots and lots and lots of memory\n2) Sadomasochistic disposition\nWorkload:\nReading? Sure, if that helps you memorize the names and dates of 677,000 slides, go for it. Four page paper, about the most remedial assignment imaginable (but at least you get to draw a picture as part of this intellectually stimulating project!!!), midterm (wait, did we EVER look at that slide? I wonder what all the confused faces staring blankly at the screen for a full 5 minutes are doing instead of writing a slide ID?), final (honestly just give up if you've come this far. it's not worth it). On the bright side, there is a massive curve. (Did you see what I did there? ThatÂ’s called sar-cas-m. har har har.) For very simple material and not particularly insightful analysis, it seems unusually difficult and a bit absurt to have to worry about staying in the B range. Take the class pass/fail (like I so unwisely did not) . . . and then worry about passing.\n"
        },
        {
            "course_name": "The Roman Circle: 1495-1527",
            "review_date": "June 25, 2003",
            "review_content": "\nDon't be scared away by this man's accent!  The half of the class that dropped after the first day because of Benelli's heavy Italian accent really missed out.  He's a heck of a smart guy -- he speaks five languages, knows basically everything about Italian Renaissance architecture, and about just about everything else besides.  You can come to him with just about any question and get an incredibly well-informed and in-depth answer.  He also cares a lot about his students and really wants every single person to get interested in the subject and to excel.  Although there are probably better lecturers in the department, Benelli was a super nice guy, really encouraged me to get excited about my paper, and was available to meet with me whenever I wanted.  Definitely a good class.\nWorkload:\nGroup presentation, short paper, 15-20 page seminar paper with presentation.\n"
        }
    ]
}