{
    "prof_info": [
        {
            "prof_name": "Jessica Gordon-Burroughs",
            "prof_id": 9920,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Intro to the Study of Hispanic Cultures",
            "review_date": "January 01, 2012",
            "review_content": "\nI think Jessica does a good job at connecting with her students. She seemed quite familiar with the readings for this class (which are determined by the department) and was usually correct in anticipating where we might have trouble with them and discuss those troubles. There is at least one article of reading for every class period and the questions which she prepared to guide us along were extremely helpful. A lot of times we would just divide up into pairs and discuss the texts with her questions as a guideline, and then discuss as a class for the last 20 minutes or so. Almost all of the readings were quite interesting and I thought all the topics covered in this class connected to each other rather well; it was definitely one of my more interesting classes and usually a pleasure to do the work for.\nJessica herself is very nice and wants her students to learn; she has fantastic fashion as well. As far as I can tell, she doesn't really make any language mistakes, and whenever someone had a grammar question she was able to answer it. Overall, I'd definitely recommend taking this class with her. My only gripes were that sometimes I felt like her comments on essays could have been a little more extensive. Her grading is definitely fair though. \nWorkload:\n3 three-page essays with 2 versions each (the two grades are averaged) - every version counts for 5% of your grade \nOne final essay, 5-7 pages \nParticipation counts for 45%, so make sure to participate a lot! Her grading for this is generous though\nReadings for every class, and (very) short grammar exercises for all of them. \nNo midterm, final, or other exams. \n"
        },
        {
            "course_name": "Advanced Language Through Content",
            "review_date": "December 27, 2010",
            "review_content": "\nI thought Jessica was great. She keeps us engaged, and really teaches us about the language. The course, though, had nothing to do with Dictatorship and Democracy, so don't take this class if you're interested in the content, take it if you want to improve your Spanish. It's a little writing intensive, but she returns each of our papers with adequate comments so that you can improve. Overall, I thought it was an interesting class, but I don't think we could've gotten further off topic from Dictatorship and Democracy than we did...\nWorkload:\nfour writing assignments throughout the semester, one final paper, all 900-1200 words. participation grade, and at times, nightly homework.\n"
        }
    ]
}