{
    "prof_info": [
        {
            "prof_name": "Yoshi Nakazawa",
            "prof_id": 11119,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Law, Liberty, and Morality",
            "review_date": "February 02, 2011",
            "review_content": "\nIf you're a philosophy major who does not intend to go to law school -- do not take this class. If you are interested in going to law school, then this is the closest thing you'll get to a pre-law class. The first half of the semester is devoted to legal philosophy and concepts and the second half of the semester is devoted to specific cases, rulings, etc. There was a lot of potential to weave the two halves together conceptually, but it never happened. A lot of class time was spent just going over the readings, though there was some room for discussion. We discussed \"law\" quite often, but not \"liberty\" or \"morality\" as much. Not entirely sure why this is listed as a philosophy class, as one really does NOT need to have taken any philosophy classes in order to understand the material and do well. However, if you're looking for a fascinating treatment of the various issues surrounding legal theory, you're not going to find it. Philosophically, a really boring class (especially the second half). The readings are very dry. However if you like reading cases and are interesting in going to law school, then it's probably worth it. Some people really liked the class, but most people did not enjoy it.\nPrreview_contentr review_content: Professor Mendelson is a really nice person, really funny, and very easy to get in touch with. She spent time with everyone going over their final paper prospectuses (?) and really helped us develop our topics. She's good at leading class discussions (when they occurred); however, most of the time was spent just reviewing the readings due for that class. I can't decide whether she or the material is what made the class so boring. If you do not like it when your professor injects his or her political views into lecture, then avoid review_contentlass.\nTA review_content: Yoshi is approachable, responds to e-mails quickly, and is willing to respond to student concerns. His comments on the draft for my final paper were extremely helpful. Overall, a good TA. It's worth mentioning he's really attractive because otherwise sitting through this class was like watching paint dry. \nWorkload:\nA lot of (long and dry) readings. Take-home midterm, one 10-15 page paper, and a take-home final.\n"
        }
    ]
}