{
    "prof_info": [
        {
            "prof_name": "Jesse Wilkins",
            "prof_id": 3145,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "American Foreign Policy",
            "review_date": "May 15, 2007",
            "review_content": "\nThe review below pretty much sums up Jesse.  HE seems like a really nice & smart guy, but he just does not know how to run a discussion section.  This particular class had an extreme amount of reading & we hardly ever touched on any of it, which was definitely detrimental for the midterm & final, especially since the other TAs in the class reviewed the readings meticulously.  He does offer good comments on exams though.  I would probably say try to switch sections if you don't think that you can keep up with all the work yourself. \n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "April 16, 2007",
            "review_content": "\nJesse is cool. He tries to make the course material relevant by tying ideas to current events--which is helpful when 85% of the class was spent analyzing the world before 1989. \nThe discussions were a little quiet sometimes, but that's because most people didn't bother doing all the reading. You get out of it what you bring to it. He's approachable and not one of those TAs who assume because your an undergrad you can't have your own, valid, ideas. Good feedback on papers, very reasonable.\nWorkload:\nIn Marten's class, A LOT of reading, two OK midterms, and a straightforward final. \n"
        },
        {
            "course_name": "Introduction to International Politics",
            "review_date": "January 09, 2007",
            "review_content": "\nJesse seems like one of those TAs who doesn't really put any effort into his section.  You can tell he's fed up with the students' silence , but at the same time he offers no real incentive to participate and usually lets one loud mouth student talk the 50 minutes away.  The section was boring but not quite painful (close, though).  He does seem really smart and could answer questions well, but did nothing to  guide our reading/offer insightful discussion/prepare us for midterms or papers (during one section when we were discussing a topic no one really seemed to understand, he tried explaining it but it didn't catch on... he eventually just gave up and said \"well if you don't get it I'll be able to tell on the midterm\" without actually  making it any clearer).  I would not recommend him as a TA- he's meticulous with attendance and you don't get anything out of showing up.\nWorkload:\nno courseworks postings or discussion section papers required; automatic A- for section grade as long as you show up (you get 1 absence for free); grading was hard but he did offer good criticism \n"
        }
    ]
}