{
    "prof_info": [
        {
            "prof_name": "Monica Cohen",
            "prof_id": 2286,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "19th Century Novel Seminar: Austen, Bronte, Eliot",
            "review_date": "January 05, 2010",
            "review_content": "\nI would absolutely take any lecture course Professor Cohen offers, however, this course was at times disappointing. A lot of any seminar experience depends on the class members, but there is a certain amount of handling that needs to be done from the instructor and in this regard, I often felt that Professor Cohen was TOO nice - wanting to make sure everyone with a hand raised got comments in and never cutting off people who rattle on FOREVER. Also, because she let anyone who wanted to speak do so one after the other, it felt like class discussions had no structure or consistency; lines of thought were rarely followed through. Just a bit more handling could have made this a significantly better course. Professor Cohen is really wonderful one-on-one and I would suggest meeting with her to review paper ideas and just talk about your experiences with the novels.\nWorkload:\nReading as you would expect from a Victorian seminar and 2 papers. \n"
        },
        {
            "course_name": "Country and City",
            "review_date": "April 16, 2008",
            "review_content": "\nMonica Cohen is exactly what an English professor should be. Her class was a perfect mixture of lecture and student participation. She asks a lot of questions that lead to productive, and insightful discussion, which is a feat, as any one who has taken an English class will know. I completely disagree with the reviewer below who said that her lectures seem like she is reading from her notes, as well as the reviewer who said that she talks too fast. Her lectures are interesting, to-the-point, extremely erudite, and somewhat complex, but she is always willing to break for questions or to expand on her ideas if the class doesn't quite follow. She is also amazingly sweet, friendly, helpful, and appropriately casual at times. The reading list is incredible and Prof. \nCohen is passionate about the books, which is infectious.\nWorkload:\nLots of reading. Excellent choice of novels. 2 Papers, Easy Midterm and Exam.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 02, 2006",
            "review_content": "\nI loved Professor Cohen.  Other than being the greatest personally, her classes were fun without losing focus on the texts.  she's a total english teacher -- lots of discussion of the characters, few \"answers\" about how to understand texts, enthusiasm for literature in general.  she expects a fair amount from her students without being at all unfair, and left a lot up to the students -- no assigned paper topics unless you wanted them; lots of choice on the midterm.  she graded the essays fairly harshly but tended to grade better for the semester than the papers, especially, i think, if you talk in class.  overall great and inspiring lithum class.\nWorkload:\nweekly responses; two 5-7 page essays; easy midterm; course-wide final.  pretty easy to stay on top of the work.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 09, 2006",
            "review_content": "\nI didn't find her class particularly engaging, though I really liked her personality.  She's really funny sometimes, most of my class really really liked her.  She just talked way way to fast to keep me interested.  She'll probably be good preparation for the final though.  I wouldn't take it with her again, but everyone else in my class definitely would have.  She's a pretty fair grader.\nWorkload:\n2 mid-length papers, weekly 1 page reactions due\n"
        },
        {
            "course_name": "19th-Century Novel In Europe",
            "review_date": "April 17, 2006",
            "review_content": "\nMonica Cohen is a very nice woman.  Her lectures often seem like she is reading directly from her notes.  Okay, they seem like that most of the time.  And the class isn't terribly engaging, but the books (Pere Goriot, Persuasion, Middlemarch, Our Mutual Friend, Eugene Onegin) are fun reading, so if that's what you like the class is still worth it.  Also, she asks a lot of questions to which no one or the same few people answer, and when they do, it's nothing insightful.  But to her credit, she will correct them if they are totally off.\nWorkload:\nLots of reading, Midterm and a final (not bad), Two short (3-5) one long (8-10) page papers. The TA grades the papers fairly.\n"
        },
        {
            "course_name": "Work and English Culture",
            "review_date": "December 21, 2004",
            "review_content": "\nExcellent. Although only an adjunct, Prof. Cohen did a great job in this class, which focused on 19th century British novels. Her own perspective on the books we read (Ivanhoe, Oliver Twist, Vilette, Jude the Obscure, Dracula, etc.) focused on how work and vocation influenced the culture and the lives of the characters - a pretty atypical stance in the English department, which tends to focus on literary movements or authors. Prof. Cohen integrated theoretical works with the readings very well (again, unusual for the English Department) and was always warm and engaging in class. She's also really good with comments on papers and topics (go to office hours), and led the class well by allowing lots of discussion without disengaging her own points. If you can handle a Friday class, this one of the better seminars in the department.\nWorkload:\nStandard seminar course work. A novel every week or two (19th c. British novels, most of which are A: long and B: skimmable), response papers on each book, a 5-6 midterm paper and an 8-10 final paper. And of course, class discussion is required if you want to do well.\n"
        }
    ]
}