{
    "prof_info": [
        {
            "prof_name": "Xavier Vila",
            "prof_id": 211,
            "total_reviews": 23
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "May 31, 2011",
            "review_content": "\nHonestly my favorite professor I've had at Columbia!\nProfessor Vila is unbelievably nice and funny and approachable, and the whole class consists of group discussion and exercises. The only homework is a 1-page composition each week. All the grammar exercises are just done in class, and the three presentations we had to give throughout the semester were all really simple and laid-back, and they were done in groups.\nI really feel like I learned more from this class than I have from any other Spanish class where I had to do pages of grammar exercises and vocab at home. Vila organizes the class so you can learn without really realizing you're learning. When the midterm and final rolled around, I realized that I had learned all the concepts through the group discussions without noticing.\nIntermediate II was the only Spanish class I had to take, and I was dreading it, but I actually ended up loving it. This is the only class I've ever actually looked forward to going to, and now I wish I had more Spanish classes to take with Professor Vila.\nThe one piece of advice I have: if you don't already have it, DON'T go out and buy the workbook and grammar book for this class. You will not need it. I wish someone had told me that before I bought it.\nWorkload:\n1-page composition due each Friday, with corrections due the next week, 3 very laid-back group presentations, department midterm and final\n"
        },
        {
            "course_name": "Beginner 1& 2, Intermediate 1&2 Spanish",
            "review_date": "February 03, 2011",
            "review_content": "\nXavier Vila is absolutely a god. If you are in his class, you are SO! SOOO! SOOOO! fortunate. DO NOT SWITCH for any other section. Classes are entirely based on the discussions the class wants to have (it is a class focused on conversation). Xavier is more concerned about beauty and fun and the things that really matter in the long run of life outside of Columbia. I really want to be his friend more than anything.\nThe homework is ONE WEEKLY PAPER. ONE! ONE!!! That is VASTLY less work than you will encounter in any other Spanish section.\nStudying for the final and the midterm is up to you, however. If you do the exercises in the blue workbook for whatever three chapters you're studying (just go do them in a room in Butler for an hour, for the love of God) and just copy the yellow pages/vocab from the textbook. That's how you make an A. That's the end of that. Enjoy life.     \nWorkload:\nOne paper due each Friday. Midterm and Final.  \n"
        },
        {
            "course_name": "Advanced Language Through Content",
            "review_date": "February 01, 2010",
            "review_content": "\nXavier was the crucial homie. He's interesting and quirky but so much fun to have in class. He's also mad flexible with papers and ideas. The only thing that was hard were grammar quizzes in which he didn't really teach the material and the tests were kinda hard. But in the end I think he graded you based on mostly participation. Read the essays, talk in class and study for these grammar things and you'll do fine. Also pay attention to what he says! A lot of it is quite smart.Overall I'd say take this class because he's a nice guy and gives you interesting readings (most of which you can find in english if you really wanted to).\nWorkload:\nA couple of grammar quizzes. One one page (double spaced) commentary on short stories per week.\n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "May 14, 2009",
            "review_content": "\nXavier was very down to earth and always flexible with due dates. His infectious mood and sense of humor brightened my spirits every time I came to class. Class time was usually fun and social. \nKnow that this is not the most rigorous of Spanish classes and you will not be doing a lot of grammar exercises for homework. Xavier's learning philosophy is that writing and speaking are the best way to assimilate the language, not endlessly writing out verbs. \nWorkload:\nOne single-page composition due each Friday. \n"
        },
        {
            "course_name": "Catalan",
            "review_date": "February 25, 2008",
            "review_content": "\nI enjoyed both the class and the professor. As someone who had never taken Spanish before (only French) I thought Xavi was very helpful. He focused on learning how to speak and listen naturally, though he also focused on the technicals when it came to pronouns and tenses. The cultural element was also important, with Xavier giving out poetry, popular songs, and stories. All in all, I felt like I learned a lot. \n \nWorkload:\nIn class and take home quizzes (not many); weekly compositions; some worksheets; midterm and final. \n"
        },
        {
            "course_name": "Catalan",
            "review_date": "February 25, 2008",
            "review_content": "\nI enjoyed both the class and the professor. As someone who had never taken Spanish before (only French) I thought Xavi was very helpful. He focused on learning how to speak and listen naturally, though he also focused on the technicals when it came to pronouns and tenses. The cultural element was also important, with Xavier giving out poetry, popular songs, and stories. All in all, I felt like I learned a lot. \n \nWorkload:\nIn class and take home quizzes (not many); weekly compositions; some worksheets; midterm and final. \n"
        },
        {
            "course_name": "Grammar and Comp (3200)",
            "review_date": "August 30, 2007",
            "review_content": "\nVila is entertaining, even though some people complain that they don't learn much from him directly. He is more interested in having students develop natural speaking, reading and writing abilities through practice rather than dry drills, although he gives out plenty of worksheets, which we go over in class. The class is very friendly and you can basically go off on a tangent in a discussion also long as you say most of it in Spanish.\nGrading is pretty basic: grammar quizzes (hard for beginners but he lets you retake them), weekly 1-page creative compositions, and lead one class discussion on reading.\nTake this is you are decent in Spanish and want a fun class, or if you want more practice using Spanish informally.\nWorkload:\nWeekly compositions (easy!), Biweekly grammar quizzes, lead 1 class discussion, 1 reading per week. Very light overall.\n"
        },
        {
            "course_name": "W3200 Spanish Grammar and Composition",
            "review_date": "February 12, 2007",
            "review_content": "\nIn response to the previous reviews: yes, the guy is really funny -- but not on an intellectual level, it is more about saying things in a funny voice. What is funny about him is more inherent: he is a native speaker with a Phd in Spanish who has been teaching the same course for ages. My experience: learned nothing in class, nothing from the material but all from independent study.\nI do not recommend this \"teacher\". \nWorkload:\nFair amount. \n"
        },
        {
            "course_name": "Grammar and Composition I",
            "review_date": "December 23, 2004",
            "review_content": "\nColumbia needs more professors like Xavier.  He is a great guy who is down to earth and makes his teaching environment very relaxed.  He is very accesible outside the classroom and responsive to the requests of his students.  If you have the opportunity to take a class taught by Xavier Vila it'd be in your interest to do so. \nWorkload:\nMinimal homework.  About 4 in-class quizzes and compositions.  Weekly 1 page essays (the grading for those takehomes is the average grade of your inclass quizzes and compositions).  No midterm. No final exam.  However, its a little bit difficult to get a good bearing on where exactly your grade stands.\n"
        },
        {
            "course_name": "W3200 Spanish Grammar and Composition",
            "review_date": "June 13, 2004",
            "review_content": "\nProfessor Vila is a nice, cheerful man.  That said, he is a terrible teacher.  I learned next to nothing from him.  He is very laid back, which works well for native spanish speakers, but for students who are working hard to pick up grammar, his nonchalance and answers of \"I don't know, man\" or \"It doesn't really matter\", make this class pointless and more difficult.  I would not recommend taking this class with Professor Vila.\nWorkload:\n4 quiz/tests, 4 in class compositions, weekly 1 page compositions (not graded)\n"
        },
        {
            "course_name": "W3200 Spanish Grammar and Composition",
            "review_date": "April 18, 2004",
            "review_content": "\nVery, very laid back class. Vila is funny and easygoing, which makes it easy to participate in class. However, if you are looking to really improve your Spanish, this might not be the class for you, especially when the prof admits that he doesn't know the answer to a question about grammar.\nWorkload:\nVery, very light. An ungraded, one-page composition due weekly. A few in-class writing assignments and easy quizzes. No final.\n"
        },
        {
            "course_name": "Span 3200",
            "review_date": "December 25, 2003",
            "review_content": "\nGreat professor.  Always happy and cheery in the class, he makes waking up for a 9 a.m. class less painful.  He is always willing to answer any questions and he stresses class participation, which is essential in a grammar class.  For those who may have a previous background in Spanish, Xavier understands, and even talks about, the different dialects or difference in specifics between certain regions, and gives leway on these specifics.  Bright, energetic, and enthusiastic.  Highly recommended.\nWorkload:\nweekly papers, in class writings, short final.  fair grading.\n"
        },
        {
            "course_name": "3200 Intermediate Spanish",
            "review_date": "December 15, 2003",
            "review_content": "\nVila is an incredibly caring professor. I was amazed by his desire to help us not only learn Spanish but also succeed at Columbia.  He was always responsive to questions in class, and was the first to admit when there was no clear answer to a question. I think he was a good explainer; Vila just didn't make things clear cut when they weren't, and language often isn't clear cut.  There were students of varying ability in the class and Vila was able to take care of all of us. He created an environment where you could feel comfortable asking even the simplest question.\nIf you enjoy Spanish you'll probably enjoy his teaching style. It's easy to make a grammar lesson boring, but Vila knows how to keep the students entertained. There were a few times when I did feel like things were getting repetitive, but in general I looked forward to the class.\nI'm not going to pretend that the class was challenging -- it wasn't.  The Spanish was mostly review for me, and the tests were pretty straightforward. If you want a teacher that forces you to learn, do not take this class if it's taught by Vila. On the other hand, if you can keep yourself motivated, you'll find his style rewarding. Once a week, you hand in a 1 page paper on literally anything, he hands it back to you with corrections, you make your corrections, and then he hands that back with more corrections. Sounds complicated, but it's a good way to improve grammar, and since he doesn't grade the stuff, it's totally no pressure.\nI should make it clear that I felt the class moved too slowly, and I definitely was challenged more in my Spanish classes in high school. At the same time, I didn't enjoy them as much as this one, and I do believe that I've gotten a better feeling for the Spanish language from it.\nWorkload:\n1 page paper on anything, once a week. 4 in class writing assignments. 2 tests. everything pretty easy and straightforward. no mandatory homework.\n"
        },
        {
            "course_name": "W3200- Grammer and Composition",
            "review_date": "December 07, 2003",
            "review_content": "\nel profe IS as fun and interesting as everyone says, but you really don't get much out of the class. it really is just a review of all the spanish you've taken before and he doesn't explain things in the best way. a lot of times his answer to your questions is just \"hey i don't know man! that's just the way it is!\" and then the whole class laughs... however, he has like eight office hours or something outrageous like that, so if you go to him then he will help you out a lot. you can tell that he really would rather be teaching some literature class or something, but he doesn't punish you for it. i recommend him.\nWorkload:\nweekly one page compositions, four in-class compositions, four quizzes, no midterm, no final\n"
        },
        {
            "course_name": "Grammar and Composition I",
            "review_date": "June 19, 2003",
            "review_content": "\nXavier is the coolest guy.  I am going to miss him as a teacher.  He is very fair.  Make use of his office hours, he has many.  He enjoys teaching and enjoys his students.  The guy is always in a good mood.  If you do the work, which is not much, an A is very doable.\nWorkload:\nA couple of quizzes, occasional quizzes and three in-class compositions.\n"
        },
        {
            "course_name": "Advanced Grammar and Composition",
            "review_date": "April 21, 2003",
            "review_content": "\nI love this man.  I wish he taught more classes.  The class is very relaxed, but you learn a lot.  He's funny and engaging and one of the most caring professors I've had at this godforsaken school. \nWorkload:\neasy weekly essays; 4 grammar quizzes;4 in-class essays in lieu of midterms and finals.  all very fair\n"
        },
        {
            "course_name": "3200",
            "review_date": "April 17, 2003",
            "review_content": "\nAs other reviews have said, Vila is a really cool, nice, dynamic guy.  But this class sucks.  The book is incredibly disorganized and the classes are only slightly less so.  The classes are also BORING!  Worksheet after worksheet covering the same stuff over and over and over.  Vila spent a really long time in the beginning of the semester on simple stuff and crammed the more difficult stuff in at the end.  This class might be better with someone else, but I doubt it.  It is required for Spanish majors, but if you're not a major, you should definitely avoid it.\nWorkload:\nVery light, no midterm and no final\n"
        },
        {
            "course_name": "W3200- Grammer and Composition",
            "review_date": "December 19, 2002",
            "review_content": "\nI'm sorry, but am I the only one who doesn't think this guy is great.  He definitely tries incessantly to prove how funny and cool he is, but he rarely focuses on teaching the material.  When posed with a question on grammar he responds, \"Hm.  That's just how it is.  I know they say it like this in Catalan.\"  Yes, but this is SPANISH.  I found the lack of instruction and the fact that I came away with nothing to override the fact that he may be a spectacle.  I'd stay away if you can. If not, ride it out.  Giving A's is a convention.\nWorkload:\nEssays that he \"grades\" and a final \"essay\" (basically busy work)--Talk in class and get on his good side\n"
        },
        {
            "course_name": "Catalan",
            "review_date": "November 19, 2002",
            "review_content": "\nCatalan has a cult following on the Columbia campus: it does, after all, take a special kind of person to want to study an obscure romance language. Xavier (pronounced Sha-B-Ey) brings a real sense of humor to the class, and tries to make the learning as fun as possible. He encourages lively discussion of all topics, and is incredibly patient when you can't figure out what the hell you're trying to say. The 3 semester Catalan sequence is infrequently offered, so catch it while you can!\nWorkload:\nWeekly 1-page compositions, monthly quizzes, midterm (all takehome), and final (in-class). He's generously flexible about deadlines, and I can't imagine that he's ever given a bad grade in his life...\n"
        },
        {
            "course_name": "3200",
            "review_date": "May 08, 2002",
            "review_content": "\nThis class was a load of fun because Vila's such a fun, sunny, easy-going guy. He'll explain stuff in English if need be, and he never gets frustrated or mad at students. He's just a really good guy, and you'll learn a lot without having grammatical rules shoved down your throat.\nWorkload:\nOne-page paper each week on any topic. Rewrites of papers. About 3-4 grammar tests, which can be tricky. A few short readings scattered about. No final exam!\n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "May 10, 2001",
            "review_content": "\nGreat teacher. I hate taking Spanish, and he was perfect for my final semester with it. He's willing to explain things in English, which makes the classes more productive than those with professors who are rigid about only speaking Spanish. He always comes into class with a huge smile on his face, and really makes an effort to make the class fun. I highly recommend taking Spanish with Professor Vila\nWorkload:\nquiz every other week, 4 one page compositions about anything you want, midterm, final, group presentation. fair grader.\n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "December 31, 1999",
            "review_content": "\nOne of the popular favorites. Xavier is a warm and funny guy, who loves to teach.  The workload is on the light side; slack off, though, and he gets pissed. Not hard to slip by, but there is plenty of opportunity to learn, and he loves to answer questions. Heavier than most on discussion, but because the class is fun it's more easygoing than with other teachers, which is good for us shy types who want to practice our verbal Spanish skills.\n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "December 31, 1999",
            "review_content": "\nVila is a muy cool guy, definitely recommeded for any type of student. If you know your stuff he'll challenge you (yet reward you with a good grade), if you don't he'll work with you and cut you lots of slack. He does rely a lot on conversation but if the words don't come to you then he understands. Vila is very approachable and even likable... you'll begin to look forward to his \"Que Tal\" as he enters class. The best in the Spanish department that I have found.\nWorkload:\nVarious quizzes, a midterm, 1 page essay, a final. Very little reading, very little work. Maybe 1-2 hours per week.\n"
        }
    ]
}