{
    "prof_info": [
        {
            "prof_name": "Dalia Inbal",
            "prof_id": 3228,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "August 08, 2012",
            "review_content": "\nDalia is an angel. It was her first year teaching LitHum, as she is in the Germanic Languages department at Columbia. She has a moderately thick German accent and is rather insecure about her English-speaking abilities, but there we had absolutely no problems understanding her. She likes to make a few jokes and always keeps the mood in the classroom lively. We had a 6-8pm class, which might be one of the worst timeslots you can have for LitHum, but she started a cookie sign-up sheet, and so we had a 10~15 minute break in the middle of each class just to eat cookies and stretch/talk. She's a pretty easy grader; most of our class got A's. She's very lenient with papers (again, most students got A's) and doesn't seem to mind if a paper is 3/4 of a page shorter than it needs to be.\nThat being said, she DOES prepare you well for the LitHum final exam, which is standardized for most LitHum professors. As long as you do all (or most of) your reading and pay attention to the passages she brings up in class for discussion, you will be well prepared for quote identification/passage analysis on the midterm and final exams. Trust me, you want Dalia for LitHum.\nWorkload:\nRoughly 150~200 pages of reading between each class. This is average, if not less than average, compared to the readings assigned by other LitHum professors.\n"
        },
        {
            "course_name": "Elementary German I and II",
            "review_date": "April 23, 2007",
            "review_content": "\nDalia ist sehr fantastisch. She's delightfully friendly, wondefully enthusiastic and totally warm and genuine. \nShe's also the best way to learn german. I don't think she stops smiling. You never want to miss her class - she always engages everyone and she's never condescending. \nBut she does correct you if you're wrong, which is absolutely necessary.\nShe's not gonna drive you with grammar and put notes on the board everyday. That's what the book is for. Dalia is all about participation - if you participate, you will learn.\nPlus, she's pretty lenient. Lateness won't kill her, but the homeworks do count in your grade.\nI'm going to miss her next year.\nWorkload:\nEasy but not light. Typical elementary language workload: 10 - 45 minutes of Hausaufgabe per class. Biweekly tests, sometimes quizzes, biweekly short compositions, final with oral exam, no midterm.\n"
        }
    ]
}