{
    "prof_info": [
        {
            "prof_name": "Julia Hirschberg",
            "prof_id": 1957,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Fundamentals of Computer Organization",
            "review_date": "May 10, 2016",
            "review_content": "\nGrading is very opaque and partial.\nWorkload:\nNot so much\n"
        },
        {
            "course_name": "Topics in Computer Science: Computational Approaches to Emotional Speech",
            "review_date": "January 06, 2012",
            "review_content": "\nAwesome professor who in any other context may be mistaken for a cat lady. She puts interests in every one of her students (admittedly easier than others because of a class size of 15 or so), is easily approachable, and keeps the long (2 hr) discussions as fun as they could possibly be. Also one of the best academics in her field... if you're a CS major looking to do coursework in NLP, you should absolutely take at least one class from her!\nWorkload:\nWeekly paper readings (varies in length), 1 Final Project (Proposal, Interim Report, Final Report and Presentation)\n"
        },
        {
            "course_name": "Natural Language Processing",
            "review_date": "December 21, 2010",
            "review_content": "\nThis is not the class I thought I signed up for, but now that I'm done with it I think it was worth taking.\nIt's insufficiently clear from the course directory that NLP (at least with Prof. Hirschberg) is entirely a survey course: you learn very little that you can sit down and implement, and a lot about broad categories of problems in computational linguistics and the general approaches that has been used to solve them. There are a handful of algorithms I'll hang on to---two months after the midterm I'm fairly confident I could write a Brill tagger or a CYK parser---but realistically, I'll never need to, and most of the material is not that specific. This class is not so much about learning to do NLP as it is about learning to understand what's already been done.\nProf. Hirschberg herself is very sweet---helpful and accessible outside of class. She also has a very soothing voice. This turned out to be a bit of a problem: I came every day, but to my great shame would start to doze off around the 45-minute mark almost half the time. I would love for her to read me bedtime stories, but the bottomless slide decks and repetitive nature of the material mean that the lectures are unstimulating to the point of peril.\nIf you're at all interested in NLP I'd certainly recommend that you take this class; if you're just trying to fill the AI track requirements you'll learn more impressive things in graphics.\nWorkload:\n2 programming assignments that require potentially infinite time---you're evaluated on a blind test corpus so you have no idea how you'll do. No \"A for effort\" here---your score is entirely based on how well you handle the test corpus relative to the rest of the class.\nOne (fairly lengthy) written assignment.\n1 midterm, 1 (non-cumulative!) final.\n"
        },
        {
            "course_name": "Spoken Language Processing",
            "review_date": "August 30, 2008",
            "review_content": "\nAwesome. Her and Professor Gross are my favorite professors.\nHer classroom delivery is fantastic. Slides were lacking in content but she more than made up for it.\nIf you attend class you'll be perfectly fine. Notes don't really convey audible concepts well so it helps to hear them in person. I think you'd get pretty lost if you didn't attend regularly. At least skim through the assigned readings, I found actually reading them to be unnecessary. Just getting the gist of it or reading the abstract is usually ok. \nThe lectures are the theory, the homework is the implementation, which makes it sometimes necessary to visit the TA to find out how to do it.\nWorkload:\nHomework (biweekly) was very, very light, and interesting. The subjects were scattered and sometimes disconnected from the lectures and you may need to go to the TA to figure out exactly what's going on in the assignment, but once you do, each takes less than 2 hours. \nWe didn't have a midterm, and the final project was 3 3-page scientific papers analyzing various topics in the readings (don't worry, you don't have to read all of the readings). \nGrading was average. \n"
        },
        {
            "course_name": "Natural Language Processing",
            "review_date": "January 06, 2008",
            "review_content": "\nMan, I must not have been taking the same class as the other two reviewers. NLP is an interesting topic but somehow it ended up getting reduced to baby talk, with endless probing of the uninterested students for examples to incredibly simple questions. She's a nice person and all, but this felt like a big waste of time.\nWorkload:\nThree long programming assignments, two pretty easy exams (a lot of memorizing terms).\n"
        },
        {
            "course_name": "Natural Language Processing",
            "review_date": "January 02, 2005",
            "review_content": "\nAn excellent professor, not a bad class. Professor Hirschberg is engaging, friendly, and interesting, incredibly well prepared for class, and impressively knowledgeable about her field. \nYou should expect the class to tend towards your humanities side, if you are used to the standard comp. sci class. Exams consist of essays rather than calculations, and at least half the class is devoted to the study of natural language itself, often seperate from computation. There are very few algorithms to learn, material is approached on a \"higher level\" that avoids technical knowledge.\nGoing to class is not strictly required, since there are beautiful lecture notes for each class, as well as chapters and sections in the book posted for each lecture. Missing class however would be a mistake, as she is an engaging lecturer.\nWorkload:\nThree homework assignments that require only a relatively minimal amount of programming (repeated use of regular expressions, mainly), but are interesting. One was organized as a competition. Two exams that were fair, with term definition and essay sections. \n"
        },
        {
            "course_name": "Natural Language Processing",
            "review_date": "January 18, 2004",
            "review_content": "\nJulia is, in a word, amazing.  She is a really sweet, nice lady who is also extremely knowledgeable about her field and seems to really LOVE teaching.  Her melodic speaking voice makes her sound like she's talking down to the class, but don't be fooled; once you get used to her you realize that she truly respects her students.  The classes are a mix of lecture and discussion, but tend toward discussion most of the time.  Julia really encourages the class to get involved (there is a class participation grade), and usually there are many great insights into the material.  She will learn your name, and you are always welcome to chat with her after class or in office hours.  If you are at all interested in NLP, or you think you might be, do not miss this class.\nWorkload:\nAssigned readings (textbook and papers - definitely NOT optional, but the book is quite good), 3 homework assignments (VERY INVOLVED, so start early), and a closed-book midterm and final.\n"
        }
    ]
}