{
    "prof_info": [
        {
            "prof_name": "Noha Emara",
            "prof_id": 10764,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Development Economics",
            "review_date": "May 14, 2012",
            "review_content": "\nVery interesting course. the prof covers a wide range of topics from poverty to gender to econ growth models. the lecture can be dull at times unfortunately. she expands a little bit off of the ppt slides but its not entirely necessary to attend class. she is a really nice lady. not the best of professors from an academic pov but defintiely cares about students she knows personally. the ppl who went to her oh got to know her better personally and understand how much she cares about being a better professor. she has a significant amount of teaching experience so students expect more from her than what she offers. this class is an easy a compared to most econ classes but there is a significant amount of work with 5 assignments and a project along with 3 non cummulative exams. overall i would recommend this class for ppl interested in the topic. you do walk away knowing more about development economics. \nWorkload:\n5 assignments (15%), 2 midterms (20% each), 1 non cumulative final (25%), 1 project (15%), 5 pop quizzes (5%)\n"
        },
        {
            "course_name": "Development Economics",
            "review_date": "April 25, 2012",
            "review_content": "\nStay away from the Egyptian Plague if you are actually interested in learning about Development Economics. I originally entered this class thinking it would be a great learning opportunity. Instead, I endured an entire semester of a teacher reading off her slides and holding her students hostage with the threat of pop quizzes. \nHer understanding of the subject is very questionable as she was never able to answer most questions asked in class.\nFinally, the TA graded most of the assignments haphazardly and also knew little about Development Economics.\nWorkload:\nEasy A if you are great at memorizing. This class includes a lot of busy work. 5 long problem sets, 2 midterms, 5 pop quizzes, a research paper and a final.\n"
        },
        {
            "course_name": "Introduction to Economic Reasoning",
            "review_date": "January 09, 2012",
            "review_content": "\nTHIS CLASS IS TERRIBLE! Don't take this class unless you have already had some experience with economics. I recommend taking Principles over at Columbia. The lectures were boring and not even the slightest bit helpful. The assignments were fairly simple yet somewhat time consuming. When it came time to study for the midterm and final there was no explanation on exactly what kind of problems would be on the exams. The class project was also horrendous. She wanted 15 pages for something that is only worth 5 percent of your grade. Just avoid this class. \nWorkload:\n5 bi weekly assignments\n2 midterms\n1 final \n1 project\n"
        },
        {
            "course_name": "Econometrics",
            "review_date": "September 15, 2011",
            "review_content": "\nThese reviews are quite harsh. She is a very nice woman and cares about her students. In the spring she was teaching too many distinct courses to measure her fairly. It is very unusual for a professor to be teaching three courses let alone three courses so different from each other. The class is not very difficult. We spent a month on stats. It was excessive and we could have done a great review in no more than two weeks. Had this happened we would have learned significantly more about econometrics. We also learned the basics of STATA. The tests were easy. Basically if you study the powerpoints on courseworks, you will do well. There was a project also in which we had to apply econometrics to a real life situation. It was difficult if your data wasn't good meaning the results came out incorrect. She, however, is very accommodating and tries to help the students through the problems (or at least she did for me and several other students in the class. Since most students were pretty critical of her in my class, I'm sure her reviews that she received were critical meaning. She seems very eager to prefect her teaching skills (she gave us mid semester evaluations for us to fill out about her and she looked them over right away), so I think that she will improve as a teacher. She is a smart and really sweet lady and does not deserve the harsh criticism from the students below. \nWorkload:\nbi-weekly assignments, 2 midterms, 1 final, 1 project. \n"
        },
        {
            "course_name": "Econometrics",
            "review_date": "September 02, 2011",
            "review_content": "\nDON'T TAKE THIS CLASS!  Professor Emara is by far the worst professor I've had in my 3 years here.  She doesn't explain concepts, she contradicts herself, and she ALWAYS has typos in her handouts and lectures.  It is extremely unprofessional and confusing.  By the end of the semester, you won't have learned anything and econometrics is a really important class if you want to go further in economics.  Knowing how to use STATA is also an important and marketable skill, which you don't acquire taking this class.  \nPlease don't take any classes with her.  \nWorkload:\nEasy.  The first half of the semester was spent reviewing probability and statistics, so of course we were off schedule to actually learn econometrics.  1 bi-weekly problem set, 2 midterms, final\n"
        },
        {
            "course_name": "Introduction to Economic Reasoning",
            "review_date": "August 19, 2011",
            "review_content": "\nDON'T TAKE THIS CLASS! Professor Emara fails to explain concepts clearly, has difficulty speaking the english language, makes typos ALL the time, does calculations on slides making it very messy and confusing, and contradicts herself when you ask her a doubt. If you are taking an economics class for the first time, I strongly suggest not to take this class. You will want to give up economics as a subject after taking this disastrous class! Worst class I've taken in Barnard/Columbia..\nWorkload:\n5 bi-weekly assignments\n2 midterm\n1 non-cumulative final\n\n"
        },
        {
            "course_name": "Introduction to Economic Reasoning",
            "review_date": "June 08, 2011",
            "review_content": "\nBasically I think that the course is fine. It was written as a well balance syllabus that covered a bunch of interesting topics. The Hubbard/O'Brien textbook is easy to follow and uses iPods constantly as an example (because it's so hip).\nThe main reason I'm writing this review is to warn people about Professor Emara. I would have said she was a nice person but one of my classmates claimed that she blackberry'd throughout an office hours meeting. On top of this, she was terrible at explaining economic concepts, managing to make them simultaneously boring and confusing. She never used examples from the real world in class but expected us to be able to analyze them during exams. To make matters worse, she constantly made mistakes, typos, and miscalculations during lecture. Her accent and struggles with the english language, which normally I wouldn't like to comment on, were sort of the straws that broke the camel's back. Lecture was intolerable. \nHer officer hours were on fridays, which was really inconvenient because assignments were always due on thursday in class and the next assignment would be posted thursday night or friday, which meant that there was never time to look over the assignment a decide whether you needed help. The T.A.'s office hours and recitation section were similarly planned on thursday evening. She also didn't bother to plan recitation section for a time when most people could show up. I was only able to go once because I usually had class at that time. T.A. seemed perfectly competent. The assignments themselves weren't very hard. \nThe worst thing about this class by far was the way that Professor Emara paced it. We spent about a four weeks going over really basic supply and demand, which was very clearly explained in the text book. This resulted in our second exam covering 4 chapters which we went over in the two weeks immediately following spring break. And we also went over all the Macro in about two weeks. In conclusion, Professor Emara is the worst Professor I've had at Columbia/Barnard. I struggle to think of a single redeeming quality.   \nWorkload:\nSort answer problem sets every other week\ntwo midterms\none non-cumulative final\ntwo painful lectures a week\n"
        }
    ]
}