{
    "prof_info": [
        {
            "prof_name": "Michael Seidel",
            "prof_id": 365,
            "total_reviews": 25
        }
    ],
    "reviews": [
        {
            "course_name": "James Joyce",
            "review_date": "December 27, 2006",
            "review_content": "\nGreat man, warm and very approachable, though it is true what the other reviews say here that taking a class with him is really more like taking a class in Seidel Studies. He has his own personal lens through which he would like the works interpreted and as long as you remember that and remember that new ideas are appreciated but only if they don't stray too far from the approved of reading done in class, you should be fine. He is a generous grader, the classes are a pleasure to attend, the work is very manageable and he does do his best to make the material as interesting as possible.\nHe genuinely cares if you understand the reading and he is not the type to demand impossible feats of memorization or in-depth textual analysis. \nHowever, again to emphasize, he doesn't structure the course very well, so you will end up with highlights of Joyce, passages he finds interesting in some way, but you won't necessarily know why they are important to Joyce or why Joyce wrote the way he did, so definitely a mixed bag if you are really looking to get something out of the class.\nNot a GPA killer, not a change-your-life type of class, but somewhere in between. Seidel can be very funny and his anecdotes are always great. \n\nWorkload:\nTwo sets of three journal entries (1 pp. each) and a midterm (Dubliners, Portrait of the Artist as a Young Man) and final (Ulysses).\n"
        },
        {
            "course_name": "Joyce",
            "review_date": "December 20, 2006",
            "review_content": "\nI'm extremely mixed about this class. Seidel is a great lecturer and clearly has a lot of enthusiasm for the subject. His class was very enjoyable, though he jumped around a lot in various texts and spoiled a lot of things for the class; by the end of the semester he was just pointing out passages that he liked and not bothering to engage with the class except for one or two favored students. However, he did manage to keep me awake, which is a feat unto itself. \nWhen it came down to assignments and exams, this class was like a retread of middle school English. I haven't had assignments like his (find a moment in the text that stuns you and why, convince the smartest person you know to read something by Joyce, etc.) since I was 13. He asked for a double-spaced page each, except for one that was 3-4 pages - how much depth can one bring to a single page, especially on a topic that's incredibly vague? A sample paper would have been nice, since he didn't really explain what he wanted and the topics and length only lend themselves to basic surface analysis - for which he will downgrade you massively. You can get a high A on the midterm and final if you have a passing familiarity with the points that he consistently touches on in class (translation: pay a minimum of attention and read Sparknotes); it doesn't require much engagement with the texts at all.\nAs a 3000-level English class, I was expecting a serious discussion and analysis of Joyce, and what I got was a professor who has tenure and knows it, or who doesn't expect his students to be able to handle analyzing Joyce in a formal essay. The class itself is fun and I loved the works we read, but the written work felt almost insulting to my or any other college student's intelligence. \nWorkload:\nAround 150-200 pages a week, 2 sets of b.s. journal entries (2 sets of 3 one-page papers and a 3-4 page paper due with the second set), laughably easy 20-question reading quizzes for the midterm and final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 20, 2005",
            "review_content": "\nin my opinion, a wonderful, knowledgeable professor and person.\nthe positive - seidel was a great professor who brought up so many salient points in each work during class. discussions mostly revolved around his speaking (this is good for you sleepers), with some student contribution. if you want to contribute to the discussion, you are always welcome; if not, he will continue to provide the class with ideas and keep the discussion going. he's a humorous man, and made the class a fun 2 hours. he also gives you a 5 minute break (!!) which is totally needed for such a long class. i personally was inspired by seidel to read more literature. as a science major, i never thought these classics could be so fascinating and also applicable to today's world. \nthe negative - weird when it comes to grading. structure is greatly accentuated, while content is just an extra. his writing prompts are extemely vague and open - just a sentence at times. some people like this, while others do not. he does not really encourage you to think of new ideas - they'll often be shot down with a low grade. however, if you regurgitate ideas discussed in class, you're looking at an A as long as you write well. you have to pray that he likes your style - if you use the words, \"however\" \"therefore\" or \"thus\" you're starting out at an A-. i often sat in front of my computer minutes before an essay was due trying to find things to change. \noverall, a great man and a wonderful professor. sad that he's not going to be here next semester, but maybe it's always good to have a change. \nif you get him for lit hum, keep him - get a valuable perspective on these masterpieces.\nWorkload:\nnot bad at all - 6 papers (each one having one more page then the previous). simple midterm consisting of IDs, usual lit hum final. just a moody grader.\n"
        },
        {
            "course_name": "Modern Fiction",
            "review_date": "December 08, 2005",
            "review_content": "\nA lovely man, but not the most inspiring of teachers. Prof. \nSeidel has seemingly limitless enthusiasm for his syllabus (as he pointed out, nearly all English syllabi are more or less books the professor loves), which is certainly important. The problem with that approach, unfortunately, is that class time basically devolved into pointing out why each book was so awesome. This works for really great novels like Pale Fire or Between the Acts, but when the class wasn't into the book for the week the two hours became torturous. I still haven't figured out how I feel about the class - our discussions were a bit scattered and superficial, but on the other hand it's nice to have at least one non-stressful class. In the end I found the class pleasant enough (and occasionally agonizing) and pretty easy. You can zone out most of the time and Seidel will never notice, but if you want to really engage substantively with the texts prepare to be disappointed. \nDiscussions often brought up great points, but I never left the class feeling as though I had gotten a comprehensive view into each novel, which was disappointing but not annoying. Take it for what it is - a mostly great syllabus, an ok class, and, hopefully, a benefit to your GPA.\nWorkload:\nA hit-or-miss syllabus (usually hit), consisting of Mann, Gide, Kafka, Beckett, Woolf, Robbe-Grillet, Rhys, and Nabokov. One page response papers due every class (you can miss two), two of which get expanded at the end of the semester to a total of 8 pgs. Pretty easy, and Seidel is a very generous grader.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 16, 2005",
            "review_content": "\nAll I can say is, boy -- Professor Seidel seems like a love-\nhim-or-hate-him kinda guy.\nI, however, thoroughly enjoyed my first semester of LitHum and am incredibly sad to see him go.  The entire class dynamic was wonderful and Seidel was an engaging, passionate, inventive professor.  I think this was the only class I truly looked forward to all semester.  As is to be expected of an informal, round-table-esque setting, the atmosphere was pleasantly informal.  Once the students got to know each other and Professor Seidel well enough, we'd spend class joking and throwing ideas back and forth.  However, Seidel -- unlike some Professors here that I've had -- understands that we're _freshmen_, and therefore comparatively stupid.  No sad attempts to drag stunning revelations out of us that just may not be there.  He guides our conversation when we do have things to say, and takes over when we don't.  \nSpectacular class.  I plan on taking his James Joyce class next fall.\nWorkload:\nA paper every 2 weeks: the first is half a page long, the second a full page, and each after that increases by a page.  Reading responses for each class.  Very light midterm and course-wide final.  Pretty heavy reading load, but not many people read _everything_.  Pretty manageable, fair grading.\n"
        },
        {
            "course_name": "James Joyce",
            "review_date": "June 27, 2005",
            "review_content": "\nMr. Seidel possesses a weak imagination that tends to think in categories.  Among the English faculty (a faculty not noted by my taste for their imagination or liberty), Seidel does not strike me as particularly bad, but neither does he overcome the limitations so many professors here constantly display.  His readings of Dubliners, A Portrait of the Artist as a Young Man, Exiles, and Ulysses all focus on concepts of Joyce's, Seidel's, or other critics' creations.  Once he has named and defined these thematic concepts, the rest of the course falls into place: a mechanical playing out and representing of these ideas in Joyce's works.  Three main concepts, simony, paralysis, gnomon, which Joyce names on the first page of Dubliners will be the filtration units that Seidel uses to interpret that work, along with Portrait and Exiles.  This reading subsides upon reaching Ulysses, only to be replaced by concepts like the epic hero, replete with passages read as language as the epic hero; water as the epic hero; common man as the epic hero; and so on.  Or there's the biographical interpretation that links Joyce's father to Simon Dedalus and Nora Barnacle to Molly Bloom.  This would be fine, if Seidel ever explained what Nora Barnacle or Simon Dedalus were like beyond the usual, uneducated lively girl from Galway or roisterer, general roustabout gentleman that can be gleaned from the most general introductions to Joyce.  Some of the readings do become a little more humane, and more interested in aesthetics and language, but this humane treatment still lacks what I would call a critical assesment of Joyce's work.  Quotes arise and are frequently read out loud, and then passed on, for another quote, and then another, without any real treatment of what he's quoting, unless its an instance of paralysis et al.  Seidel's purported worship for Joyce is immense, but that worship is as empty as a vapid evangelical's purported worship for God.  Seidel declines to discuss Joyce in relation to earlier writers or examine any of Joyce's intentions and their results in his works.  Walter Pater and Gustav Flaubert are mentioned, but never thoroughly treated.  Seidel never discusses Shakespeare's decided influence and prominence in Ulysses either.  He constantly mentions Joyce as saying he wanted to write in a mean style.  \"Mean\" can mean everything from dull, contemptuous, abhorrent, excellent, humble, and base.  There is something excellent about Joyce's style: it has precision, economy, and a condensed fusion of meaning, sound, and beauty, so that the sound of words relates closely to their use, and the character who uses them.  But Joyce is unceasing in his portrayal, until the two Blooms of Ulysses, of base, self-abnegated, powerless, and unimaginative characters, that is, characters who lack imaginations and the passions to realize them.  All of this examination is lost in a categorical consideration of art, that manages to constantly praise Joyce as a mechanical showman.  Seidel also mentions Joyce as saying that in Ulysses Joyce wanted to stick close to facts, an interesting and provoking comment from an author of fiction, that is books that trope upon lies.  He neglects extrapolating anything from his comment.  Seidel and others like him seem to be the professors for whom Joyce, possibly ironically, claimed he was writing Ulysses, men who will use magnifying glasses to look for minutiae, so vex themselves, that they think this was learning, while missing the people whom we read.  Nor does Seidel even ponder Joyce's affect on Foucault and New Historicism.  No writer so explicitly benefits from a reading of his contemporary newspapers and assorted dross like Joyce does (for those who haven't read Ulysses, some of the book is about those newspapers, and references to real life Dublin of 1904 abound).  To add to the banality, every class begins with a slideshow.  These forays into powerpoint presentations do nothing to enrich your experience besides acquainting you with what baby Jim looked like.  If this review sounds particularly harsh, it is only so because I feel much of Joyce, his invention, his humanity, and his minor ability among so many previous giants of literature is lost on Professor Seidel.  If you'd like a sound interpretation of Ulysses, read Hugh Kenner's commentary Ulysses (1987 edition) for a similarly mechanical but more erudite and engaging treatment of Joyce's first masterpiece.  Or, for something more aesthetic, try Harold Bloom's essay on Joyce in The Western Canon.  Had this review been written a month ago, it would have been even more condemning.\nWorkload:\nLight, well paced reading assignments, 7 journal entries, midterm, and final.  \n"
        },
        {
            "course_name": "Joyce",
            "review_date": "May 17, 2005",
            "review_content": "\nThis class is really wonderful.  You read all of Joyce (except Finnegans Wake), and Professor Seidel lectures on the work and the author and makes Ulysses painless and enjoyable.  His lectures are interesting, he is very approachable, and clearly has a passion for the subject.  The course is easy to do well in IF you read everything thoughtfully and review pretty intensely before the reading quizzes.  Though the class is large, Professor Seidel always reads your essays himself and provides thoughtful comments. . . the class is definitely worth taking if you want to better understand Joyce.\n"
        },
        {
            "course_name": "James Joyce",
            "review_date": "May 08, 2005",
            "review_content": "\nDoes nobody at this school understand the difference between a nice person and a good professor?  Seidel is a really sweet guy and after every lecture you're going to want to give him a big hug, but I'm not sure that he really says anything that interesting about any of the books on the reading list.  He is very excited about the texts, I'll give him that, and listening to the excitement in his voice during lectures will make you want to get excited about Joyce too, but when you actually listen to what he's saying, you'll find it hard to actually come up with a reason to be excited about Joyce.  His lectures are based EXTREMELY closely on the texts - so much that he spends the majority of the 2 hour class jumping from one passage to the next, without really discussing why they're interesting.  The deepest he really gets in passage analysis is talking about how \"cool\" the cute play on words and onomatopeia stuff is.  But after you take a brief moment to appreciate Joyce's modern style of writing/word-play, you will find yourself asking: to what end is he doing this for and what does it really accomplish other than being a cute play on words?  And now that the class is over, I'm still asking that.  Seidel doesn't really delve into the deep issues of the texts.  Now given that the texts (esp Ulysses) are written in code, it is nice that he helps clear up some confusion with understanding plot, etc.  However, a Joyce class at Columbia should not only consist of being able to successfully understand what's going on in these books, but of what they're trying to say and why they're so interesting outside of their modernist style.  If these are the things that you are interested in taking away from a Joyce class, then don't take this one, because you'll spend the majority of the semester flipping around in your book looking at quotes that mean nothing to you and show no relevance to the overarching themes of these novels.  Don't get me wrong, Seidel is a really sweet person, but just an ok professor.\nWorkload:\na couple of books: dubliners, portrait of the artist as a young man, exiles (play) and Ulysses.  seems like not that much, but they're HARD to get through - plan on spending  a good amount of time trying to decipher ulysses.  2 sets of journal entries, midterm and final (both pretty easy if you've kept up with the reading).\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 05, 2005",
            "review_content": "\nIf you are assigned to this Lit. Hum., switch out immediately. I do not understand how there are so many positive reviews of this man. He was the worst professor I have ever had. If you are expecting professors to listen to your ideas in a literature class, this man will suck all hope out of you. He condemned anyone who wanted to stray from the most arbitrary and simplistic analysis of the works or simply disagreed with him. That probably won't be a problem though because there is so little room for discussion and he really only wants to hear a few select group of students' opinions. The problem with Seidel is his complete egotism. He is absolutely a very intelligent and well educated academic, but he is not a teacher. He wants to lecture so that students can use his ideas in every aspect of the course, from the limitied discussion to the writing assignments. \nIn terms of grading, he can be generous, but very arbitrary. He focuses on details of writing style and not the content of analysis. The grade he gives has no correlation to the comments on the paper and the best strategy is to strategically reiterate his lectures.\nHe can also be cruel in his comments. One girl in our class who had switched was told that she would have done better if she had been with us all semester and learned the kind of writing that he expected. To quote him, \"You should read every sentence out loud over and over until there is no possibility of mistake.\" Any typo, slight mishap in grammar, or any interpretation not run past him or previously said in class could send your grade down quickly. \nIn short, brilliant man, awful teacher. If you are interested in learning factual information and the common consensus of interpretations, this is the class for you. If you wish to develop your own analyzing skills or your own understanding of literature of western society, run. \nWorkload:\nReading journal due every class. 5-6 writing assignment ranging from a sentence to 5 pages. Easy midterm, only passage ID's, but second semester grading on them was very harsh. Very easy on grading the final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 20, 2005",
            "review_content": "\nProfessor Seidel is incredible. He is enthusiastic and excited about all the books we read and he offers a great depth of information. He lectures more than other Lit Hum professors but he is engaging and interesting. An easy midterm, a few papers ranging from one paragraph to five pages, and daily reading journals. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 11, 2005",
            "review_content": "\nProf. Seidel is an amazing lecturer and a brilliant man, but a totally random grader. While he makes tons of comments on your weekly journal entries, your papers are given arbitrary grades with little elaboration. I loved the class itself and really learned a lot, but the lack of discussion and the stressing over papers put a damper on the class fo me. \n"
        },
        {
            "course_name": "Joyce",
            "review_date": "September 07, 2004",
            "review_content": "\nBefore I start my review of Seidel, let me just say that I loved Joyce before this class and having (re)read more of his work, I love him even more. But I wouldn't accredit this to the brilliance of Seidel.  I appreciate that he is definetly passionate about the work and once you approach him privately, he is very eager to help. However, my main complaint is that I think he forgets that most of the students have not already read Ulysses several times. Like other reviewers, I feel he gets too caught up in minutae rather than investigating Joyce's larger themes and metaphors. Also, it is encredibly irratating the way he skips forwards with information, letting you know to pay attention to page 8 because on page 91 this same character says the same words in a different way (he then has the class flip to page 91 even tho the reading has been only up to page 30). Part of the challenge and the fun is finding it for yourself and I think Seidel has forgotten this. \nWorkload:\n2 sets of 3 journal entries a midterm and final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "June 25, 2004",
            "review_content": "\nProf. Seidel was, without a doubt, the highlight of my first year at Columbia. My first week at school, while talking to a few upperclassmen, I mentioned his name in connection with Lit Hum and they started raving about how great he is - and I wasn't let down.\nThe workload was relatively light, with a journal entry due at the beginning of every class and periodic papers. Anything you wrote for the class was returned with comments that showed the time Seidel devoted to reading the work. I always felt that my thoughts were being taken into careful consideration.\nDiscussion in the class was left up to you. Left to his own devices, Seidel could easily lecture for two straight hours - and would be more than happy to. He's a brilliant man and really knows his stuff about all the material; I rarely found myself bored in class and was almost never tempted to skip. However, he does like to lecture, so it's up to you to speak up if you have something to say.\nFinally, I definitely recommend going to his office hours at least once a semester. I visited him on several different occasions and he was always more than happy to sit down and talk. He helped me to choose my second semester English classes, and I've already talked to him about taking his Joyce class in the future. I got nothing but great experiences out of this class. If you're lucky enough to be assigned to Seidel's ONLY lit hum section, enjoy every minute of it and maximize your opportunity. \n(and in case you're wondering, I'm a Red Sox fan, and Seidel is a HUGE Yankees supporter. That should show that this is NOT a biased review - he's just that good.)\nWorkload:\nFirst semester: Midterm (IDs, doesn't take the full exam time), Final, 5 papers ranging from 1 to 5 pages. Second Semester: 5 papers ranging from 1 to 5 pages, Final (he chose to drop the midterm)\n"
        },
        {
            "course_name": "Joyce",
            "review_date": "May 19, 2004",
            "review_content": "\nSeidel's Joyce class deserves another review for being such an excellent course. The lectures on Dubliners and Portrait do a good job of situating the major themes of Joyce's career which get played out in Exiles and Ulysses. Seidel really humanizes Joyce's genius so that you can see a lot of yourself in him (and also a lot of his eccentricities that you hope not to see in yourself). The lectures on Ulysses are really the highlight of the course as they make one of the hardest books ever written seem unbelievably manageable. Seidel is an able guide who even teaches other teaches how to teach Ulysses. Seidel rarely gets lost in minute details, and if he does, it is usually because Joyce got lost in them too and they show you how his mind works. For having taught this course so many times, however, Seidel didn't time it well, and the last few lectures were unfortunately rushed and  the course was left without a sense of closure. Seidel also sometimes focuses too much on Joyce the man and writer, and less on Joyce the thinker, and so rarely are the grand philosophical themes in Joyce discussed. But, for an intro class, maybe this is all the better.\nWorkload:\nFun and interesting journal entries. Annoying, but fair, ID midterm and final. Usually one or two IDs seem to come out of nowhere, but rest are easy if you go to lecture. Usually about 100pgs of reading/week. Fair grader.\n"
        },
        {
            "course_name": "Joyce",
            "review_date": "May 13, 2004",
            "review_content": "\nI really hated this class. Joyce has three books and one crappy play to his name, so after 30 years of studying him, Seidel is more interested in trivia than the substance of the material. He spends way too much time on biographical information, and hearing him jump from quote to quote in his nasal voice is unbearable. No one doubts that Seidel loves the man. The problem is he loves him too much. His obsession is uncritical, with him being fascinated by the most meaningless crap. I also didn't get the impression that Seidel was a particularly nice guy. He hardly takes any questions, aside from the occasional brown nosing (\"could it also mean this, professor?\" \"yes, yes it could\"), and he's unfriendly when approached after class. I really just got the impression that he had been teaching the material too long. I wanted an introduction, but instead I glimpse into the cult of Joyce. Very dissapointing.\nWorkload:\n2 paper assignments, which are in the form of journal entries. The questions are fairly stupid: talk about a moment that stunned you, etc.  There are also 2 short id tests in which he names a character or phrase and you have to place it. These are kinda hard, cause you basically either know it or you don't. Still, they're painless as tests go.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 11, 2004",
            "review_content": "\nIÂ’ll be honest.  Initially, I did not like Professor Seidel.  While it isnÂ’t hard to get on his good side, he is not a warm and fuzzy guy.  I always felt awkward with him.  I tried to go to office hours to get a feel for what he thought of me, but it was always uncomfortable.\nIÂ’ll get the rest of the bad stuff out of the way.  LitHum is about discussion, and there was none in my classÂ– the only way to speak was to interrupt Seidel mid-sentence.  I, for one, never thought that anything I had to say was particularly important, so I kept my mouth shut.  Not a good discussion class for a quiet student (or an intimidated one).  So if you want negatives, heÂ’s not an IÂ’m-going-to-form-a-wonderful-friendship-with-you type of guy, and the discussion is almost nonexistent.\nHowever, Professor Seidel quickly transformed into one of the greatest teachers I have ever had.  The amount of knowledge he possesses is extraordinary.  I thought that after we finished the first semester ancient Greek works he would fizzle out, but that was not the caseÂ—his knowledge of the second semester works was equally impressive.  He initially seems strict and even pretentious, but he is more easygoing than he lets on, as long as you donÂ’t come late or fall asleep in class.  His humor is implicitly hilarious, and the amount of work he must put into the class stuns meÂ–he reads everyoneÂ’s journals and responds in detail for every class session and has papers back with extensive comments by the class after they are due.  Professor Seidel will make you a better writer whether you like it or notÂ– heÂ’ll even refuse to read your papers if they arenÂ’t up to his format standards.  ItÂ’s frustrating at first, but worth it in the end.\nSo in closing, even though my LitHum class was unconventional, I would gladly do it over again. Professor Seidel made me truly love and care about books that I would never have read on my own.  He made me spend hours on papers that were just one page long.  And he made me love LitHum to the point that I frighten myself.\nWorkload:\n5 papers per semester (one 1 page, one 2 page, one 3 page, one 4 page, one 5 page), reading journal entries do every class, possible midterm (we had one the first semester but not the second), and course-wide final\n"
        },
        {
            "course_name": "Joyce",
            "review_date": "May 11, 2004",
            "review_content": "\nI'm somewhat puzzled by all the positive reviews here.  I've just finished his much-heralded Joyce class, and I can unequivocally say that it was one of the worst English classes I've taken at Columbia.  And I've taken some seriously bad classes.  I found myself dreading this class before each and every meeting.  Seidel is boring, and bizarrely fixated on a very few analytic tropes.  For instance, you could either attend the first month and a half of the class, or else simply sit in your room repeating, \"Paralysis, gnomon, simony,\" to yourself over and over.  This is a class of buzzwords, and very few of them will help you in the least when it comes to understanding Joyce.  This simply makes his lectures a bore - what makes his lectures worse than a bore is his insistence that the only way to get at the meaning of Joyce's books is to know his biography.  \"Biography\" is probably putting it too generously, actually.  What he thinks one ought to know is, say, that Buck Mulligan from Ulysses was probably based on this particular friend of Joyce's (a connection Seidel makes by displaying a Power--\nPoint image of the friend).  This is his approach to all of Joyce.  Want to understand Simon Dedalus?  Go no further than Joyce's father.  Molly Bloom?  Simply look at a picture of Nora Barnacle.  For Seidel, literary analysis means little more than mapping characters and places in novels onto their real-life correlatives.  If this sounds misguided to you, then this class will drive you nuts.  Seidel seems perfectly good-natured, and his lecturing style is fluent (smoothed by years of repetition, I'd imagine).  I took the class because I wanted to \"get\" Joyce before leaving Columbia, and I honestly don't feel any closer.  I'd advise you to pick up the books on your own - preferably annotated editions - and to dive right in.  Taking this class runs the risk of turning you off to Joyce for life.\nWorkload:\nReasonable, although the midterm and final are both tedious.  They are long reading quizzes, which says something about the depth of Seidel's interest in what students have to say.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "November 24, 2003",
            "review_content": "\nI had Prof. Seidel the first and last time he taught this class, and it was about as good as CC can be, considering the reading list is what it is.  He basically came into the class saying that he had never taught this stuff before and we had never learned it so we were all going to be in this together.  It was a very reassuring thing to hear at the beginning and he carried it through.  Very intelligent and very funny but also maintains a casual air in the class.  When we were discussing Aquinas, he basically came into class and told us he didn't understand what the hell was being said so if we didn't either, it'd be cool and we could just ramble off some ideas that we had.  He rewards students he gets partial to, but it's very easy to get on his good side.  Great professor and a great guy  \nWorkload:\nTypical CC load, midterm, final, 5 papers\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "September 23, 2002",
            "review_content": "\nPeople kept telling me I was so lucky to have a full professor for LitHum - with Seidel as the prof I'm not so sure... he does know a lot and often brings up interesting points in class but there is virtually NO DISCUSSION and he is an insanely arbitrary grader. He also seems to care far more about style than content in papers, so watch out and make sure you write the way he wants you to, but he's not at all helpful with reading drafts or office hours. Blech.\nWorkload:\nNot bad at all, but again, be careful about those papers or you'll get screwed.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "August 06, 2002",
            "review_content": "\nWhat can I say, the guy is an amazing lecturer! He knows so much details about the core books and makes them so interesting, that you will leave his class anxious to read the next 6 books of the Aeneid or kicking yourself for skimming the 200 assigned pages in Don Quixote instead of carefully reading each page. He makes you want to read the books no matter how boring they are because he makes them so interesting. Aside from books, having such a respectable position at Columbia and plenty of life experience, Seidel many times has many interesting stories to tell and good advice to give. But before you run off to switch into his lit hum section, you need to know that there is also quite a downside to him. First of all, he leaves no room for class discussions. Although he is breathtaking to listen to (unless you got no sleep the night before and are snorring away in your chair), a discussion class like Lit Hum needs to have...well...a discussion. And for the exception of the few bold students interrupting his lecture to state their own opinion or to ask a question, Seidel is usually the only one talking. The other BIG downside to Seidel is his grading of papers. Although many people believe him to be an easy grader, his grading is very arbitrary. He doesn't put any comments (except for grammatical corrections) on the paper and therefore you can never figure out why you got an A on one paper and a B on another, seemingly the same paper. \nWorkload:\n5 papers ranging from one page to 5 pages and a final. Reading is pretty slow.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 24, 2002",
            "review_content": "\nMay seem like an easy teacher at first with papers starting off at one paragraph in length, and no midterm. But I got nothing out of this course. There is never a lot of opportunity to discuss among the students. Seidel just keeps talking and talking and talking. Don't worry about falling asleep and being called on, you could sleep through to the break (and maybe past that) and he would still be talking. He can be funny what with his occasional going off on a tangent and talking about his beloved James Joyce. And he takes things at an easy pace, but then students make up for that by cramming the last long books into 2 weeks.\nWorkload:\nbi-weekly reading questions, short papers, the generic final\n"
        },
        {
            "course_name": "Joyce",
            "review_date": "April 08, 2002",
            "review_content": "\nCould this man be the most overrated professor in the department? Given his rambling lectures and mildly condescending style, I'd have to say yes. Most people need a guide to get through Joyce's work, and Seidel does provide assistance, but he's not all that his reputation suggests. Watch out for the lifelong learners, who cling to this class as though the seats were made of geritol. They talk about their health to any one who will listen.\nWorkload:\nLots of reading, short journal entries, and lists of IDs for midterm and final.\n"
        },
        {
            "course_name": "Joyce",
            "review_date": "December 31, 1999",
            "review_content": "\nIf you're going to teach a class on Joyce, you'd better be passionate about the Irish behemoth, and Seidel damned well is. The first half of the semester focusses on Dubliners, Portrait of the Artist, and Exiles; Seidel does a wonderful job balancing close reading and more general thematic analysis. In the second half, which is devoted to Ulysses, Seidel seems to lose a bit of focus, spending too much time on minutiae and never really getting his teeth around the work as a whole. But hey, it's not an easy book, y'know? The lectures are animated and filled with a plethora of biographical and historical information. Seidel isn't a particularly funny guy, but the capacity crowd is augmented by a generous smattering of those doddering old fools better known as life-long-learners, who find Seidel's jokes immensely amusing and who are found, in turn, to be immensely amusing by the rest of the class. Highly recommended.\nWorkload:\nA couple well-assigned and short response papers, midterm and final. Grading can be tough; Seidel expects as much enthusiasm from his students as he himself possesses.\n"
        },
        {
            "course_name": "Joyce",
            "review_date": "December 31, 1999",
            "review_content": "\nIf you're going to teach a class on Joyce, you'd better be passionate about the Irish behemoth, and Seidel damned well is. The first half of the semester focusses on Dubliners, Portrait of the Artist, and Exiles; Seidel does a wonderful job balancing close reading and more general thematic analysis. In the second half, which is devoted to Ulysses, Seidel seems to lose a bit of focus, spending too much time on minutiae and never really getting his teeth around the work as a whole. But hey, it's not an easy book, y'know? The lectures are animated and filled with a plethora of biographical and historical information. Seidel isn't a particularly funny guy, but the capacity crowd is augmented by a generous smattering of those doddering old fools better known as life-long-learners, who find Seidel's jokes immensely amusing and who are found, in turn, to be immensely amusing by the rest of the class. Highly recommended.\nWorkload:\nA couple well-assigned and short response papers, midterm and final. Grading can be tough; Seidel expects as much enthusiasm from his students as he himself possesses.\n"
        },
        {
            "course_name": "Restoration Literature from 1660-1740",
            "review_date": "December 31, 1999",
            "review_content": "\nDon't ask how come I or anyone else bothered to take this class. You couldn't pick a duller time in British history--nothing happened. Really. People were happy with the monarchy and didn't do much. Speaking of not doing much, neither did Seidel. Except for his brief display of adoration for Daniel Dafoe, the class was pretty darn boring (which may explain why it is no longer offered). Majority of the reading involved the heroic couplets of Alexander Pope (snooze). The rest included a couple of short plays, as well as two novels. Grading was a joke, since nearly everyone received A's and reading was relatively unnecessary. Take Seidel in the spring semester. He's an avid Yankee buff (wrote a book on them, too) and usually zones out whenever they enter the fall classic--which, as of late, is virtually guaranteed.\nWorkload:\nmidterm (total joke), journal entries (write freely) and final (also pretty damn easy). You should slap yourself if you don't get an A from Seidel.\n"
        }
    ]
}