{
    "prof_info": [
        {
            "prof_name": "Ichiro Takayoshi",
            "prof_id": 1916,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "January 11, 2005",
            "review_content": "\nIchiro is a nice guy, but not such a great University Writing teacher. Although he is available for extra help and conferences almost all the time [since he is a grad student and his schedule is pretty flexible], he doesn't make many things clear about assignments. So after you spend much time on your first draft, he is usually still not satisfied, and expects you to change around your entire essay if you want to get at least a B. \nWith that said, I cannot deny that I learned a lot about writing in this class. I learned that editing does not just mean simply grammatical corrections and revisions to sentence structure. It is far more complicated than that. I learned that stating an argument is not enough. You must really make one by providing heavy support and details in order to convince your reader of what you are trying to say. \nSo if you end up with Ichiro as your teacher, don't be too worried. He will teach you, but you really have to work with him, and must willing to change an entire essay around  that you were pleased with in order to make him happy, so that you can get a good grade. \nWorkload:\nDaily close readings. Read them carefully because Ichiro likes details in class discussions and constantly asks for you to support your statements with examples from the text. Daily exercises, about 300-500 words each, which are not graded but still must be handed in. These exercises are practices for the actual essays, which you have 4 of ranging from 1000 to 3000 words. There are always at least one draft before the final essay is submitted. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 19, 2004",
            "review_content": "\nIchiro is the shit. Greatest guy, he's nice, tries hard to be funny, and always wears suit and tie to class (with a really great selection of ties, including a sunflower yellow one). He really enjoys the material, and gets students interested. The best thing about this class is that he opens up the class to debates and arguments, and really gets the class embroiled in conversation. Plus, you'll leave this class a better writer than you were when you came in - even if you come in as a really good writer. This class is invaluable, and this teacher is awesome!\nWorkload:\nIt can be as much or as little as you make of it. I put in at least fifteen hours of work on each of three papers, plus about two hours a week early in the semester\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "November 11, 2004",
            "review_content": "\nIchiro is my favorite professor at Columbia so far, he's awesome.  While a lot of freshman don't like UW, Ichiro made class awesome.  We had educated debates throughout class about relevant issues, and he really listens to and considers students' opinions.  He leaves very helpful feedback on drafts as well as final papers, and his grading system is fair.  He really knows his stuff and will make you a better writer if you listen to what he has to say.  Usually you can't request a University Writing professor, so feel very lucky if you do get Ichiro. Seriously, this guy is awesome, and class was actually the best I took first semester.\nWorkload:\n4 essays: 2 1500-2000 word essays, 1 2500 word essay, 1 reflective 1200 word essay, brief nightly writings\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 28, 2004",
            "review_content": "\nAt first I was skeptical about Ichiro due to his thick Japanese accent and the fact that he had a hard time understanding us. He got over the language barrier though, and was a great teacher.  He really cared a lot about the class and was always really prepared. He probably worked harder than we did (and we worked pretty freaking hard).  He's a great guy, and class was always a lot of fun.\nWorkload:\n4 essays - 2 1500 words, 1 2500 word research paper, reflective essay at the end, small writings throughout the semester.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 03, 2004",
            "review_content": "\nIchiro Takayoshi is by far the most amazing writing teacher I have ever had.  He puts a massive amount of effort into the class.  His teaching style is quite effective (he weaves tips on writing into discussions of texts), and I feel that, after having succesfully completed the class, I'm a much better writer than when I started.  All comments on the drafts were comprehensive and useful.  Overall, a truly great instructor.\nWorkload:\n4 Essays, 1 of which is 2500-3000 words, 2 are 1500-2000 words, and the last is 1200-1500\n"
        }
    ]
}