{
    "prof_info": [
        {
            "prof_name": "Neferti Tadiar",
            "prof_id": 3374,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "Critical Approaches",
            "review_date": "February 25, 2015",
            "review_content": "\nNeferti Tadiar is an amazing teacher and lecturer. She is not afraid share her opinions in class and is an overall awesome professor who texts Angela Davis because they are friends. Even though this is a women's studies class, I feel like I read so many seminal words related to gender, race, identity, colonialism, and globalization. The concepts I learned from reading Marx, Althusser, Fanon, etc. I was able to apply in a number of different classes. This class should not be a lecture, because there is almost no discussion on really provocative topics, the large number of people mean that the grading isn't too bad. Just make sure you meet with the TAs about paper topics (you can literally write about anything -- I wrote a paper on racist sororities).\nWorkload:\nOne take home midterm, one open book final. Two papers. \n"
        },
        {
            "course_name": "Critical Approaches",
            "review_date": "November 24, 2014",
            "review_content": "\nI have mixed reviews about this class. Professor Tadiar is without a doubt fantastic - she's super sweet, incredibly knowledgable, a great lecturer and really knows her stuff. This class is also great in that it teaches you to think differently about things. That being said, though, please be warned that this class is hard. The readings are extremely long, dense, and they are difficult concepts. She goes through them the best she can in class but she can't get to all of them and even though she talks about them they can be incredibly confusing. If you slack off in this class you will be sorry. If you want to work really hard and come out with new \"critical perspectives\" and actually learn something, this class is for you. If you don't like doing really long, dense readings and writing difficult papers I wouldn't recommend this class. It can be really daunting at times. \nWorkload:\nA lot. Weekly readings of at least 100 pgs that you have to put a lot of effort into. 2 reading response papers (first is 4 to 5 pages, second is 5 to 7 pages) that connect concepts across the readings and relate them to a contemporary example. The midterm is what others have said - 8 pages give or take that answer three questions (about two pages per question). The final is a bit daunting - 3 hours and she doesn't give you the questions beforehand and there are a bunch of essays, but at least its open book. \n"
        },
        {
            "course_name": "Critical Approaches",
            "review_date": "December 17, 2013",
            "review_content": "\nThis is by far one of the best classes I have ever taken. Professor Tadiar is absolutely brilliant and unbelievably sweet and understanding. Every assigned reading is relevant to the course in some way and there are so many connections between them that you will have no trouble writing papers or preparing for exams so long as you go to class (which boosts your grade by the way) and do at least some of the readings (though I really recommend that you try to do all of them - I regret that I didn't for reasons that have nothing to do with my grade). This semester the class was pretty big so there wasn't much opportunity for discussion in our weekly meetings (that happened in the bi-weekly discussion sections), so the class is structured like a lecture pretty much although Professor Tadiar does open the floor up to questions and comments. She really cares a lot about the way that we can make connections between the theories we read about and our own lived experiences (that is basically what we are asked to do when writing papers), and I personally got a lot out of the class because I now have new lenses through which I can understand sexism, racism, capitalism, cissexism, etc. The workload is pretty tough. She estimates on the syllabus that we should expect to read 100-120 pages per week... on some weeks it is much more while on others it is a lot less (and keep in mind that this is 100+ pages of densely written theory). However, you can definitely get away with going to class without having done the readings...but really, do the readings. Class participation (ie, just going to class and handing in a few responses to assigned readings) is 15% of your grade and the TAs graded really, REALLY nicely in my experience this semester. I strongly encourage you to take this course regardless of your major if you have any interest in politics, social justice, race/gender/class/sexuality/identity politics in general. You will get a lot out of it as long as you put at least a little bit of effort into it.\nWorkload:\nAs I mentioned, the readings are long and very easy to put off doing so it's best to be proactive and read them on time or else you WILL be cramming and/or handing in assignments late. 15% participation, 30% for two response papers (15% each - one is 3-5 pages long and the other is 6-8 pages long with the topics being extremely open-ended), a take-home midterm (25%) and a final (30%). You can easily get an A in this class if you just do the readings and put original thought into your work by relating the readings to your lived experiences instead of just summarizing them.\n"
        },
        {
            "course_name": "Critical Approaches",
            "review_date": "January 26, 2013",
            "review_content": "\nProfessor Tadiar is a goddess. This class completely changed the way I approach learning and thinking. I cannot emphasize enough how important it is to do the readings. Whether or not you understand them, you will benefit from at least knowing what each one talks about. Now, that's a tall order. It's a very reading-heavy course. But Professor Tadiar has organized the syllabus in such an interesting and interconnected way that at the end of the semester, you'll still find new connections between texts.\nClass can be very intimidating. As in many Barnard classes, there is a handful of confident, vocal students who will comment the most. It took me a little while to feel comfortable raising my hand, especially because Tadiar has no reservations about questioning your logic. To succeed in this course, I highly recommend seeing her during office hours, particularly before an essay is due. She is immensely helpful in argument-structuring, and will point you in a more focused direction. She also will learn your name this way, and it somehow makes class more comfortable. \nThis was maybe one of the most challenging classes I've taken thus far, but the payoff was so worth it. I love Tadiar, I loved this class, and I'm all the better for having taken it.\nWorkload:\nThere are a TON of readings. And they are incredibly long. There are two \"response papers\" (3-5pg essays connecting concepts to contemporary examples), one 8pg(ish) midterm essay (where you answer 3 different questions), and one final exam (very broad topics for one large question and one short question).  Again, I urge you to keep up with the readings if you want an A.\n"
        },
        {
            "course_name": "Critical Approaches",
            "review_date": "December 16, 2012",
            "review_content": "\nI feel like this class really changed my perspective to how I approach Women's Studies, social justice, and other topics in human rights.\nProfessor Tadiar does a great job at making a 50 person lecture class feel like an intimate discussion more commonly found in a seminar class of 15 people. She gave students the opportunity to teach a lesson to the class related to the readings and current events--most people who took this opportunity were very well informed about their chosen topics, so it was interesting to hear so many perspectives.\nThe lectures were engaging and interesting. However, they were very easy to get lost in if you hadn't done the readings. Many of the readings were also very confusing and hard to get through (especially in the first half of the term, when they were about abstract ideas as opposed to concrete topics) until hearing the lecture on the topic. If a reading confused you, try rereading it after discussing it in class.\nWorkload:\nWeekly readings that total to 75-200 pages per week. Mandatory attendance (15% of grade). Two response papers (30% of grade). One take home midterm (25% of grade). One open book and note essay final (30% of grade).\n"
        },
        {
            "course_name": "Introduction to Women's and Gender Studies",
            "review_date": "January 12, 2009",
            "review_content": "\nI disagree with the other review of Fall 2008's Intro to Women and Gender Studies. Perhaps because I did agree with many of the topics, I never felt pushed to adhere to a particular opinion. I felt that Professor Tadiar, Professor Kessler-Harris and the many TAs brought very different perspectives to the class. Both of these Professors are incredibly experienced in this field and offer great insight from very different background: Kessler-Harris from the history of the movement, and Tadiar about the more recent, international movement of Feminism. Despite their accomplishments, I found the lecture somewhat boring at times, but it was enhanced when I did the readings on time. My discussion section could be incredibly frustrating at times, but also enlightening because we did have a lot of debate. My TA (Minnie Chiu) was unbelievably available outside of class, and she talked me through my large essays. She also wrote back two pages typed responding to one of my essays. Although we did hop around to various topics, an Intro class on such a broad topic probably necessitates that. This class truly changed the way I see everything, and sparked a deep interest for me in Women's Studies and Feminism. \nWorkload:\nHeavy: 80-120 pages a week of reading, three 5-7 page essays and a take home final. \n"
        },
        {
            "course_name": "Postcolonial Feminist Theory; Gender Globalization and Empire",
            "review_date": "April 16, 2008",
            "review_content": "\nProfessor Tadiar is by far one of the best professors I've had at Columbia. She really knows her stuff, is sharp and very articulate. She is also very good at moderating class discussions in a manner that I think is beneficial to everyone. If you have a chance to take any of her classes, I highly recommend it. \n"
        },
        {
            "course_name": "Intro to Women's and Gender Studies",
            "review_date": "February 24, 2008",
            "review_content": "\nProfessor Tadiar co-taught this course with Professor Alice Kessler-Harris and two TA's, but she was by far the most interesting, engaging, and articulate lecturer of the four. She has a knack for presenting complicated material in a very clear, succinct, and yet nuanced way. She is also a very nice and very approachable person outside of class, if you can get over your initial awe at her brilliance. She is easily one of my favorite professors at Columbia.\nWorkload:\nLots of reading, but it's not necessary to do them all and still get an A. Weekly Courseworks postings, a paper, a media file presentation, and a final exam.\n"
        },
        {
            "course_name": "Intro to Women's and Gender Studies",
            "review_date": "January 16, 2008",
            "review_content": "\nProf. Tadiar is easily one of the most intelligent and articulate professors at Columbia. She knows her material inside out, but she is good at letting students explain what they think about the material, and engage with each other. Possibly my favorite class at Columbia and I am a senior. I would recommend any class with her. She is an extremely fair grader. She co-taught Women's and Gender Studies with Prof. Kessler-Harris and she definitely outshone Prof. K-H, which is no easy task because she is also quite good. This isn't necessarily an easy class but if you work hard, she will notice.\nWorkload:\nWeekly postings on Courseworks in response to the readings, a life analysis paper on an autobiography (5-7 pgs), a media file, and a ten page take home final. Very fair grading.\n"
        }
    ]
}