{
    "prof_info": [
        {
            "prof_name": "Selby Schwartz",
            "prof_id": 12360,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "March 04, 2014",
            "review_content": "\nMicromanagement at its finest. University Writing as a class typically features a closely monitored discussion group and peer work, but Selby's intense grip over the classroom dynamic is something that you'll either come to love or hate. If you're a dazed, independent or wise-assed student, don't join this section-- you WILL behave and adhere to the style of conduct or she WILL, cloyingly, call you out on it right in the middle of class. You will love her class if you are particularly alert, grade-grubby or masochistic in loving  to worry about your essays and having every bit of them torn to pieces. She will indulge every bit of your stress. If you are your own kinda guy, too proud and snooty over your own writing, do not bother. If you are also too proud to fully bow down to parameters of prompts (in style, content, and length), again, do not bother. Following parameters and conformity to the assignment is where she will truly hammer you in terms of her grading. \nSelby doesn't seem to appreciate any kind of side-talking or jokes, because her class is planned to the very minute: because of how meticulous it is, she might tire you out by the end of each section. She hears all and sees all-- don't even consider looking at your phone or someone else, let alone let the classroom discussion topic get even a little off-point. During pair and  group discussions, she will circulate the room and actively listen and give feedback to any input you are heard giving in a private conversation. The many, many writing exercises and multi-step approaches to said exercises take away from peer editing time and answering of useful questions, but some people like the incredibly thorough teaching style. \nA plus: this woman will know your writing like the back of her hand, and it's not BS. She knows you and what you can put into your work, whether you like it or not. If she overhears a peer editor say something to you across the room, she can specifically attest to whether or not she agrees or disagrees with it. \nShe is a quality instructor, but this doesn't mean that she benefits everybody. You'll come out stronger in one way or another from this course. If you need to learn how to kiss professor's writing standards, this is a REALLY good way to start to get your butt in gear. If you need micromanagement and want your writing perfected to common standards, Selby is your instructor. \n...but if you are a rebellious little bird or have a less-traditional writing background, avoid this class like the plague! \nWorkload:\nFairly heavy, if you take every little writing exercise seriously. It's really not that bad, but she puts real pressure on coming on time and has little to no flexibility/sympathy for typical student laziness. You've got the vast majority of students running to class breathless with piping-hot papers in their hand, usually about 30 seconds late. You can choose not to do the writing exercises that are due every class, but she will hate your guts for it. You can never, ever miss this class due to her deliberate planning of exercises. If you miss, she will be sure to acknowledge that your lack of attendance for the day was a burdensome, searing hole that messed everything up for you and the class. \nWriting exercises tend to be a part of daily activities that involve partners and sharing aloud, so you'd better come up with something for every class to avoid embarrassment. Otherwise, ultimately four essays make up the grade. Weighted larger as you progress through the course. No, that's not as good as you think it is. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 12, 2014",
            "review_content": "\nI think most people that have taken Uwriting with Selby will agree that taking this class is like being in an extended love hate relationship. Selby is a fantastic teacher. She is sweet, accommodating, and has no problems about answer your questions early in the morning or during office hours. That being said, because she is a fantastic teacher she knows exactly where all your weaknesses and lazy tendencies as a writer are and will not let you get away with any of them. The trick to doing well in this class (and more importantly learning to write well) is to do all of her writing exercises WELL. Selby provides a lot of feedback, which is important when you start revising for your final paper. Essentially the better the work you submit the better feedback you'll get and the better paper you'll end up writing.Take her \"radical revision\" philosophy very seriously along with her \"says does charts\". As much as you'll hate to admit, they are really helpful for when you get into writers blocks or just want to get as much progress done in as little time as possible. \nThis class is by all means manageable (this is coming from an engineering student who had a very full course load) and you shouldn't have too much difficultly navigating through this class if you put in a fair effort. However, if you really want to change your writing for the better inject yourself into this class and you will come out a better writer. \nWorkload:\nLarger than other Uwriting sections but manageable. A writing exercise due every class, but according to Selby, \"you are an adult and you can decide whether you want to do them or not (paraphrase).\" If you really want to become a better writer this writing exercises will be your key to improvement. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 18, 2013",
            "review_content": "\nSelby is a sweet, helpful teacher who knows the strengths and weaknesses of each of her students personally. She assigns a lot of work but gives extensive feedback on all assignments that are handed in. During the drafting process for each essay, Selby splits the class up into groups (different groups for each of four progressions/essays) that give each other feedback, and the result is that you have plenty of material to work with while putting together your final draft. The content of the gender studies course itself is mainly centred on discussion of how and why gender is not an inherently binary construct, and about how the way we perceive gender is based on our social environment. Selby grades strictly but not ridiculously so, and gives typed comments on each of the essays when she returns them. The main drawback of this course is that the large volume of work assigned makes it difficult to put as much effort into every writing exercise as you might otherwise want to, but if you want to see your writing skills improve, I would definitely recommend taking the class.\nWorkload:\nHeavy.\nReadings\nWriting assignments due almost every class\nFour essays for which formal, final and sometimes exploratory drafts have to be turned in.\n"
        },
        {
            "course_name": "university writing",
            "review_date": "May 05, 2013",
            "review_content": "\nI would like to echo the sentiments of the previous reviewer for Selby's F1010 section (UW section for General Studies students only). \nHaving compared notes with many classmates, students registered for Selby's UW section need to be prepared to do a substantial amount of \"Writing Exercise\" (WE) work, much more so than the average UW course load. Selby assigns WEs for almost every class; they are meticulously outlined/instructed and usually comprise of several parts. The average WE will ask students to produce ~500 words. On occasion, a 500 word WE is manageable but when you are assigned WEs every class, they will become tedious. However, it should be noted that Selby does not assign her signature WEs for the sake of burdening students with excessive written work. Her WEs are thoughtfully crafted and serve direct purpose to the essay progression at hand. \nAs the previous reviewer mentioned, if you have a passion for written comprehension/English & Comparative Lit, Selby is a well qualified UW instructor and you will learn from her. Conversely, if you just want to get through this core class and not feel like you are dedicating a disproportionate amount of time striving for an A, try and avoid taking UW with Selby.\nAdditionally, future UW students should take note that Selby has an artistic/dance-related background, and she does have an inkling towards artistically charged lecturing style and reading material. If the performing arts is not your thing, again, my suggestion will be to register for another UW section. \nLastly, while this should not in anyway detract from the integrity of Selby's instruction and qualification as a UW teacher, she at times dresses in a manner that may not be well appreciated. Within the classroom setting, and as a more conservative student/person, I was at times quite bothered by her choice of classroom wear. \nIn sum, if you are the kind of student looking for a challenge or has a general appreciation/interest for the written language, you will appreciate Selby's dedication. Otherwise, in the critical interest of maintaining a reasonable course load/work schedule, try and avoid taking Selby's UW section.\n\nWorkload:\nStandard 4 progression essays, BUT, a great deal more written exercise work than compared to other sections. \n\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 01, 2013",
            "review_content": "\nShe does grade somewhat harshly...but the fact that she gives you a radical review (if I remember the name correctly) basically makes up for it. The radical reviews allow you to resubmit your first two papers for a new (and almost definitely) better grade. With this, you can experiment and pick up on what she wants. By the time you hit your 3rd paper, you should have improved. The last paper is quite easy since it's an op-ed. As long as you don't write nonsense, it's quite subjective and easy. \nThis is coming from someone who got a B on the first paper and ended up with an A in the class. \nAnother tip is to visit her at office hours or email her about your paper. She responds very fast and is approachable. I think asking her for help as I wrote my essays definitely improved my grades and helped me develop into a much more mature writer. (I literally emailed her my theses again and again, changing it each time till she gave me the ok. I also sent her whole paragraphs - with SPECIFIC questions, she really values this - to read.) Plus, you pick up on what she wants. \nThe one thing I do agree though is that it is a lot of work; I'm not sure how it compares to other sections. You do have to put in the work/ not blow this class off. But you also improve as a writer. \nWorkload:\nPretty heavy. But she sets the pace well compared to other sections so that your last progression isn't completely rushed. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "April 16, 2013",
            "review_content": "\nIf you have Selby, get ready for the hammer.  She comes off as a chill lady, but she grades really, really, really hard.  Most of my friends said their teachers graded their first papers hard to make a point and then soften up, but not Selby.  Not only did she make an unbearable class harder than it needed to be, she piled the readings and exercises.  On a positive note, she's really nice and she knows what she's talking about.  If you want to just get through UWriting with a good grade and don't really care, do not take her class. If you really care about gender studies and truly care about how much you learn and do not mind taking a GPA hit, then take her class.\nWorkload:\n4 papers that make up your grade, daily reading (mostly articles of various lengths) and exercises due every class. \n"
        }
    ]
}