{
    "prof_info": [
        {
            "prof_name": "Myrtle Jones",
            "prof_id": 10121,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "African History 1700-Present",
            "review_date": "April 19, 2010",
            "review_content": "\nMyrtle is by far the WORST TA I'VE EVER HAD. And we've all had bad ones; they tend to grade a million times harder than the actual professors, and often know nothing. Myrtle is a perfect example of one of these TAs.\nShe is by no means unintelligent (though at times I wonder); on the contrary, it's clear that she has a vibrant mind. Her problem stems from the fact that she has absolutely no organization ability whatsoever. Her sections are a complete waste of time. More often than not, we don't talk about readings, we very rarely discuss lectures, and instead the group sits and listens as she regales us with stories of her past. She spent 20 minutes of one section talking about the fact that she was a victim of identity theft, and what that did to her for years. She also likes to name drop the famous African history people she knows/has met. As I know little about African history (and in all honesty couldn't give a shit), this means nothing to me. I'm unimpressed Myrtle- you're only proving further that you're naught but a waste of space.\nShe doesn't actually hand back any of our assignments, whether they're papers, or quizzes, NOTHING! In a history class, seeing a grade for a paper posted online does nothing for a student. As a history major myself, I hope TO LEARN in my classes; more importantly, I WANT TO LEARN FROM MY MISTAKES. When she did finally give the first paper back, she made very few comments and didn't even give the customary blurb at the end. What the hell? Did she just hold the paper to her head and say, \"hmm, feels like a B. Nope, this one smells like an A.\"\nIf you see her name on a roster, or if you happen to take a class in which she is TAing, DO EVERYTHING IN YOUR POWER TO AVOID HER SECTION. YOU DO NOT WANT THIS WOMAN HAVING ANY CONTROL OVER YOUR GRADE. Quite frankly, if I had it my way, I would ban her from academia altogether.\nAnd that includes nursery school.\nWorkload:\nShe doesn't have the attention span to assign work\n"
        }
    ]
}