{
    "prof_info": [
        {
            "prof_name": "Irving Herman",
            "prof_id": 1105,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Quantum Mechanics",
            "review_date": "May 14, 2012",
            "review_content": "\nI had a pretty small/nonexistent background in Quantum Mechanics coming into this class, but I think Prof. Herman did a very good job teaching this course. The first day he gave us a survey, and I think he was slightly disappointed at the general lack of background among the class, but nonetheless adjusted his syllabus accordingly.  He always appeared enthusiastic about the material and imparted much of this enthusiasm into his daily lectures (sometimes interjecting \"this is fun!\", much the the chagrin of the class who were no doubt still attempting to wrap their minds around his latest hastily scratched down derivation.) He certainly moved quickly, unless he got caught up in something especially tricky, or couldn't read his own handwriting on his notes. At the end of the day though, he managed to squeeze everything he needed into the lectures to make sure you could do the weekly problem sets (perhaps with a bit of inspiration, and a bit of help from the excellent TA.)  Make no mistake about it, the problem sets were long and difficult, as you might expect for a 3000-level course in QM, and he began writing them himself to discourage use of the answer key for the book. In effect though, this actually made the problem sets easier since he could teach directly to what would be on the problem sets. \nHerman frequently criticized the book for being too elegant. Perhaps. I thought the book, both chapters and problems were quite well-written and insightful, allowing me to gain a more complete understanding of QM and filling in gaps of stuff I didn't quite understand in the lectures. Griffiths is a great author (both in E&M; and in Quantum.) Nonetheless, the book problems were often extremely difficult to complete without the answer key. The problems Herman wrote himself were more manageable. The main legitimate criticism and difficulty was that the book often relegated key pieces of information to the problems themselves, requiring insights that I was not capable of producing with any sort of frequency (perhaps some higher physics talents might be able to do so.) Herman tried to supplement the book by going over certain concepts in more detail, and I think he did so effectively.\nThe test were very manageable, albeit a bit long. The distribution for these was highly bimodal though, with half the class scoring above 70 and the other half scoring below 50. What the tests did well is test your conceptual understanding of QM, and not if you could evaluate random tricky integrals and make unusual or tricky connections. It seemed to me that if you kept up with the work, the curve was quite forgiving, but if you didn't you were crushed. \nOverall I was pleasantly surprised with Prof. Herman. He is no doubt an intelligent and capable professor. I had him for Physics of the Human Body as well, and I often had difficulty following him in that class (given I was a freshman.) If you like physics or QM at all, you will enjoy this class. It was my favorite class this semester, and I actually wished we had forayed a bit further into the material (the first time I've ever felt that in a class- we only covered chapters 1-4 in Griffiths, about the first ~250 pages), but I suppose that's what next semester is for. My main remaining gripe with him is that he is not very approachable. The TA, Austin, made up for that almost entirely though. \nWorkload:\n13 (!) problem sets, all lengthy, especially if they're the book problems. However, they're worth 30% so the effort is worth it. 1 Midterm (relatively easy if you did the problem sets in an \"honest way\", as the Prof. put it.) and 1 Final, a little more difficult than the midterm since it is cumulative. \n"
        },
        {
            "course_name": "Introduction to Quantum Mechanics",
            "review_date": "May 07, 2012",
            "review_content": "\nHe told us on the first day that it was the first time he had taught this course and used this text. Boy did it show. Herman is a great administrator, okay scientist (check out the number of citations he has using Google Scholar; pretty low for a Columbia professor; not to say that I have any myself) but worst of all, a mediocre professor. I learned absolutely nothing in this class.\nHerman's lectures are all over the board. Literally. He will go on and on about something that is in the text, Griffith's \"Introduction to Quantum Mechanics,\" or attempt to do relatively simple derivation but do nothing except confuse you. If you want the low down read the book. Going to lecture did absolutely nothing for me in this class and I hardly missed one.\nThe homeworks are difficult, usually encompassing something we haven't covered or done. Most students in the class have seen QM before; I had not. I was far behind the entire time. Just as an example of divide in the class, on the midterm, 4 people essentially failed, 6 got \"Bs\" (50t fall into the habit of using the solutions manual.\nWorkload:\n13 problem sets worth 30% of your grade. A midterm worth 25% and a final worth 40%.\nA note on the problem sets: Actual calculations will be relatively simple but extremely difficult to decipher/figure out. Even the best students in the course were known to take 4-6 hours per problem set. If you don't know your stuff, plan on spending 10 hours per week just doing problem sets; this does not include time for reading. Big time commitment.\n"
        },
        {
            "course_name": "Introduction to Quantum Mechanics",
            "review_date": "May 07, 2012",
            "review_content": "\nI thought Herman was a good professor.  He moves quickly in lecture but is thorough and answers all questions thrown his way.  Goes through proofs extensively but doesn't do a whole lot of problem solving in class, making the problem sets more difficult.  He doesn't like the textbook we used and I tend to agree, it skips a lot of material and leaves it to the homework problems.  The problem sets are hard and time consuming, and there is one every week no exceptions.  He wouldn't give out a practice/past midterm or final, making the type of questions on them kind of a mystery.  But they really aren't as bad as the problem sets and lectures would lead you to expect.  Pretty much the basic concepts in short problems. Overall a challenging class, not worth taking as a tech elective (whoops) but a good class.\nWorkload:\nWeekly problem set (~5 hours or more) worth 30%, 1 midterm worth 20% and a final.\n"
        },
        {
            "course_name": "Quantum Physics of Matter ",
            "review_date": "January 01, 2008",
            "review_content": "\nI WOULD NOT RECOMMEND TAKING THIS COURSE AS A JUNIOR!!! HEED THIS WARNING!!!\nEverything about this class seems wrong, and yet they allow it to be taught in the department. For starters, Quantum I and Quantum II topics are mashed into one semester. He requires attendance, but he FLYs through material, proofs, and derivations leaving nothing to be learned. The book is ponderous to say the least; it could bore a rock. I would suggest high taking this course as a graduate student, unless you are in Applied Physics in which case you should take this your senior year coupled with A LOT of easier 3000 level classes, or some less demanding 4000 level classes.\nWorkload:\nWeekly HARD TIME CONSUMING problem sets consisting of ~5 problems (start the problem set immediately when you get it) 25%, 1 (suprisingly) moderate midterm 30%, 1 slightly harder final 45%.\n"
        },
        {
            "course_name": "Quantum Physics of Matter ",
            "review_date": "December 15, 2006",
            "review_content": "\nThis professor goes through thirteen out of sixteen chapters in the textbook...tell me, which professor goes through nearly an ENTIRE textbook in QUANTUM PHYSICS? By the end, there is so much material, it is impossible for undergraduates to master everything. To give you an idea of how much time he probably would have wanted you to devote to this class: half the problems in the homework sets are \"extra\" problems that undergrads don't do (and graduate students should do because this class is almost catered to them) that USED to be required but Herman made them optional because people were complaining about the insanity of the length of the homeworks. It probably wouldn't be as bad if he actually tried to make us understand the material, which he does but unsuccessfully. So you be the judge: poor pedagogy, biblical amounts of work, and it's quantum physics. \nWorkload:\nif you're very diligent, and start early/work nonstop, or if you're a grad student, it can work out.\n"
        },
        {
            "course_name": "Physics of the Human Body",
            "review_date": "April 14, 2006",
            "review_content": "\nI haven't finished this class but I felt like I should write a review before people picked their classes for next semester because the other reviews seemed a bit misleading to me. The fact that he gives open-book tests, along with the fact that his lectures are straight from the book (Even down to the anecdotes, no joke, even the stories he tells are straight from the book) make it seem like the class will be relatively easy. The problem is, while Herman is a very smart guy, he is terrible at explaining things which is reflected in his lectures as well as the book he wrote, currently a work-in-progress that is full of parenthetical notes-to-self. Honestly the material he presents is not overly difficult, but it's nearly impossible to sift through the dense lectures and books to figure out exactly what he is asking you or teaching you. The book is 750 pages long full of long paragraphs with examples embedded in the text which very often make very little sense as he will introduce obscure variables in one chapter and then reference them again in equations with no explanation several chapters later. The organization of the book makes it difficult to find anything and a huge process to figure out what he's saying. Herman has done his research and constructed a lot of interesting mechanical models for the processes of the human body, but I can't help feeling that he could benefit hugely from a co-author to make his book even remotely readable and/\nor comprehensible. I wouldn't take this class unless you're hugely interested in the subject matter and willing to spend a lot of frustrating time decoding his book. One thing I will say is that the TA is excellent and truly understands the plight of students trying to understand what Herman is getting at. \nWorkload:\nproblem sets every 2 weeks or so, not overly difficult but hugely  confusing and watch out for units, they're not consistent at all but this fact is not immediately obvious.  One midterm test and a Final, both open book, watch the time, because he expects very complete answers to his essays despite a huge time crunch. \n"
        },
        {
            "course_name": "Physics of the Human Body",
            "review_date": "May 17, 2004",
            "review_content": "\nProf. Herman is certainly a nice guy. And yes, he is funny in a corny kind of way. But that doesn't make him a particularly good teacher. There is way too much material in the \"textbook\" (his typed up notes), and the HWs don't always follow directly from the notes. The tests aren't very enjoyable either, despite being open book. The classes consist of Prof Herman basically going word for word through the notes, interspersed with corny jokes and anecdotes. I did get the impression that he expected you to know things before taking the class, which isn't exactly fair, given that it's an intro class. He also seemed somewhat difficult to get a hold of outside of class; he didn't even have scheduled office hours. Oh, and regardless of how pointless it may seem to go to lectures, don't skip classes: he counts that against your grade. The material itself can be fairly interesting; it's just not presented in the best way. If you really like physics, and don't mind trying to teach yourself things, I guess you'd probably love this class.\nWorkload:\n7 HWs, midterm and final, both open book. Missing class affects your grade.\n"
        },
        {
            "course_name": "Quantum Physics of Matter ",
            "review_date": "September 15, 2003",
            "review_content": "\nThere is no doubt that Herman is incredibly intelligent.  Unfortunately, he possesses none of the qualities a good professor has.  He is not approachable in that he expects you to understand certain things before taking his class.  He will make you feel stupid, not on purpose, but rather because he thinks what you're saying IS stupid.  He also thinks that Quantum is the only course his students take during a semester, and that they should devote all their time to the class.  The amount of background studying required for this class is far beyond what any undergrad with more than 12 credits can handle.  Finally, he lectures for himself and for the grad students.   He does not concern himself with the stragglers (undergrads) in the class, and races through the material to maximize material covered rather than maximize understanding.  DO NOT TAKE THIS COURSE AS AN UNDERGRAD!\nWorkload:\nweekly PSETs, midterm, final\n"
        },
        {
            "course_name": "Physics of the Human Body",
            "review_date": "May 15, 2003",
            "review_content": "\nProf. Herman is a really good teacher.  Even if you don't think you learned a lot in his class, you'll still end up applying the things you learned in class to what happens to you in real life.  The workload is pretty easy, except you should expect to get confused when trying to figure out which units to use for problem sets.  The midterm and final are open book and notes.  He is a funny guy, and his lectures are for the most part engaging.\nWorkload:\n7 or 8 problem sets, open book midterm and final\n"
        },
        {
            "course_name": "Physics of the Human Body",
            "review_date": "May 12, 2002",
            "review_content": "\nThis guys is awesome. The book is useless, but he types out class notes and hands them out for every chapter before going over it. It is still a must to go to class however, because it can be very hard to understand the notes without seeing the lecture. Lectures can be hillarious when herman tells stories. You'll end up thinking about material from the class in everyday life, which is cool. The problem sets vary from difficult to moderately easy, and are due every other week.\nWorkload:\n1 midterm; a final, and 7 problem sets due every other week.\n"
        }
    ]
}