{
    "prof_info": [
        {
            "prof_name": "Autumn Womack",
            "prof_id": 9587,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Literary Texts, Critical Methods (Seminar)",
            "review_date": "May 21, 2012",
            "review_content": "\nComing out of Autumn's litcrit seminar I have pretty mixed feelings. First, the class was on Thursday evenings from 6:10-8 which definitely didn't help at all. Second, the seminar itself does not need to be two hours long. It dragged on and on and on every week, though I find this to be partially a flaw of the course itself. \nIt is clear that Autumn is intelligent and can analyze literature. But to me, I only felt that she knew how to teach her specific field of focus, African American literature, which was demonstrated when we read the final text, Autobiography of an Ex-Colored Man. For the other texts (poetry/Hamlet/Pride and Prejudice) I felt that she did not facilitate the discussion well at all--there was often a lull in the conversation and she would sometimes ask questions that didn't make entire sense or just that no one knew how to answer. On the other hand, we had one of the other seminar leaders as a sub for one week and she asked very easy questions simply to get people to talk, and I'm not sure which was worse.\nAlso, it was evident that Autumn was wrapped up in her dissertation which she's currently in the middle of/in the process of finishing soon. So I didn't find she was really prepared for the seminars. And I didn't feel that I got a whole lot out of the seminars, although usually the first hour was alright and some of the students in my class made some good points. She was pretty disorganized and routinely misplaced/lost papers we handed in or missed emails we sent her, and she would always say she was handing back a paper on X day and then actually hand it back two weeks after said day.\nDespite my misgivings about her class, I will say that she's very good one on one. I felt that I learned a lot going to office hours. She made really good comments when we spoke about my essays and my ideas for essays. She does some good analysis and can really help you understand your own thoughts better.\nAlong that note, she was bad at leaving comments on essays that were short. For the class there were three short ungraded essays, two short graded essays, and then three longer papers. She left basically no comments on the first two and only made comments on the longer papers (and even then, not a lot) so I never felt like I knew how to improve. \nFor grading, she strangely gave out number grades instead of letters and I never understood what the difference between a 89 and a 90 or a 93 and a 94 are to her when it comes to writing. It all just seemed very arbitrary, and she never explained it.\nOverall, she was nice and I feel like the seminar would have felt a bit slow and a bit worthless regardless of who I had or when it was. The lectures itself (with Erik Gray) were the gem of the course.\nWorkload:\n20% participation (including one discussion post per week for the latter half of the semester)\n3 ungraded short poetry papers (to ease you in)\n2 5% short poetry papers\n1 20% longer poetry paper\n1 25% longer drama paper (Hamlet)\n1 25% longer novel paper (Pride and Prejudice and/or separate text chosen by seminar leader, Autobiography in this case)\nReading every week for lecture and sometimes seminar\nAutumn gave us an extra credit paper which I thought was especially nice of her since I didn't hear of any other leader doing so\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "May 18, 2011",
            "review_content": "\nI had Autumn Womack as my UW teacher this semester and thought that her class was calm, collected, and focused heavily on class discussion, which was great. I wish some of my other classes were more like that!\nDue to the fact that writing academic papers requires a fair amount of academic reading practice, there were two or three assigned essays each week that we needed to familiarize ourselves with. We would be expected to come to class and discuss what we read and how to incorporate that within the context of academic writing.\nShe was very skilled at interpreting academic papers and student essays in a way that made sense and would actually benefit a student rather than confuse them further. Overall, I feel my writing skills improved and I gained a perspective of critical thinking that I didn't have before.\nWorkload:\nThe syllabus was much more intimidating than the class actually turned out to be. She expects a student to actually spend time with the assigned essays and not just gloss over them. In class, participation will be required of everyone and there will be a fair amount of group work.\nThere were not as many writing assignments as I had expected. She primarily tended to focus on the main writing assignments and, of course, the readings.\n"
        }
    ]
}