{
    "prof_info": [
        {
            "prof_name": "Naomi Dershowitz",
            "prof_id": 13608,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Philosophy",
            "review_date": "June 19, 2019",
            "review_content": "\nI hope she's not teaching anytime soon. Not only she has a weird way of explaining things (she uses philosophical terms no one understood and just moves on) but also she's never clear about what she wants from you. we asked her about the form of the final exam and she literally said \"you will see when you will take the exam\". wtf?? just avoid the class, not worth it\nWorkload:\nmidterm exam (which is basically during the first weeks pf class)\ninterview with one non-philosophy student and presenting it in front of the class (no idea what she wanted to see with this)\none essay (she will give you the topic; one of the most difficult authors)\nfinal exam (last day of class)\n"
        },
        {
            "course_name": "Introduction to Philosophy",
            "review_date": "November 11, 2018",
            "review_content": "\nI loved taking Intro to Philosophy with Professor Dershowitz this year.  She makes class really fun and engaging by encouraging class discussions and answering lots and lots of questions.  If you're the type of person that likes organized, textbook learning then you probably won't like this class.  But if you love discussing different opinions, going on some interesting tangents, and just generally talking in class, you'll love this class.  I learned a lot about the philosophy of the mind, personal identity, and knowledge claims.  This is a great class if you think you might be interested in philosophy but don't want to dive headfirst into thick, heavy readings.  The workload was minimal and the exams were challenging but not too difficult.  10/10 would recommend this class to my friends!\nWorkload:\nA ten minute presentation, two exams, and essay, readings for homework\n"
        }
    ]
}