{
    "prof_info": [
        {
            "prof_name": "Najam Haider",
            "prof_id": 10466,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "V2630 Islam",
            "review_date": "January 17, 2017",
            "review_content": "\nI won't rehash all the things that have been said about Professor Haider in much detail. There is a lot of work, and sometimes the readings can be repetitive. Every week you have to write a blog post, and he grades them on a scale of quarter points up to 10.0, but in reality you will likely never get above a 9.5. My average over the semester was probably between and 9.0 and a 9.25, and I got an A. So don't worry too much because he will curve it. \nHe is very exacting, sometimes almost to a fault. He can seem to be blind to the fact that his own criticisms are not ironclad. Absolutely make sure you meet with him early in the semester during his office hours. He appreciates getting to know his students. \nAs has been said, he's very old school. He is intimidating in his comments, exacting in his standards, and demanding in his expectations for independent thought. \nTips: try to tie in outside sources that relate in an unexpected but thoughtful way. Prepare for a lot of reading, and be judicious in what you read and how closely. Don't be afraid to challenge his views, but know how to back it up and anticipate his criticisms so you can address them on the fly. He truly is a quality over quantity person; he's not just saying that. \nOverall, I would highly recommend him to someone that can devote the time and energy he requires of you. \nWorkload:\nWeekly blog response, one short assignment (two pages double spaced), final paper. \n"
        },
        {
            "course_name": "V2630 Islam",
            "review_date": "December 08, 2016",
            "review_content": "\nI loved this course. Professor Haider is an incredibly engaging professor, encourages students to think critically, and is very passionate about this subject. Some students think he's mean, but his tough style is what makes him a great professor that keeps class interesting and encourages students to always participate. If you answer a question in class, he will push back and challenge you - be prepared and articulate. The workload is worth it though if you are really interested in learning this subject and just about the world in general. DEFINITELY RECOMMEND THIS COURSE \nWorkload:\nIt's a lot of work but worth it. Weekly response papers/blogs (you can skip 2 weeks), one short paper, and one final paper. No midterm or final because he doesn't believe in tests. \n"
        },
        {
            "course_name": "The Qur'an",
            "review_date": "May 20, 2012",
            "review_content": "\nUtter disappointment. As an upperclassman who has had the privilege of taking some wonderful professors (and some not  so wonderful ones), I consistently left Haider's classroom angry and frustrated. I am not one to shy away from demanding classes, and some of my favorite lectures have been ones for which I have spent hours every week reading, researching and writing. Professor Haider prides himself on- indeed at times it seems above all else - the amount of work he gives. He does not seem to understand that the homework was usually pointless, and by the end of the semester, over 100 hours of a largely wasted time. \nHaider was more interested in us \"thinking\" than \"getting the right answer\" in our homeworks. Now this is a nice idea in high school, or perhaps for an occasional assignment in college, but not for the amount of time we were expected to sacrifice from other classes in order to complete his homework. He constantly ridiculed many secondary sources on Islamic texts, and therefore urged us to draw our own conclusions based on our readings of the text. Again, that is a nice idea once in a while, but not for almost an entire semester in an institution of higher learning that prides itself on building and questioning previous academic experts, historians and theologians, who have spent far greater time looking at the Qur'an than we had. \nThe structure of the class was terrible. It began with a 1/2 hour presentation by students on the homework we had completed, which was either repetitive or as Haider would later go on to show, wrong. Presentations occasionally are okay, but not every day. The rest of the class was spent going over the homework, in which Haider would present his idea of what the real answer to the questions were. This was completely backwards - if only Haider had presented material first in class, then he could have given us questions to answer at home that allowed us to use the knowledge he had imparted on us. Additionally, asking an obscene number of questions for every homework precluded the students from answering each one insightfully.  \nI came into the class excited to learn about the Qur'an. I left the class having read a large part of the Qura'n, and with some general insight into its formation. Beyond that, nothing.\nWorkload:\nsee above\n"
        },
        {
            "course_name": "The Qur'an",
            "review_date": "April 30, 2012",
            "review_content": "\nProf. Haider should be commended for being an old school professor; he's intimidating, demanding, and uncompromising in his expectations, which are high. He expects constant improvement, and effort is less relevant than results in your work. His demeanor in class is endearing, and his way of presenting material is both down-to-earth and incredibly knowledgeable, but he can be quite harsh so that you're constantly trying to impress him, or, rather, stay afloat, because he usually shuts you down.\nThe work that he assigned this semester was incredible in its scope and consistency. For each class we had to complete somewhat of a problem set on a collection of verses of or readings on the Qur'an, and they were graded on a scale of 1-10. Analysis is expected for every question, and while I regularly turned in three to four pages (single-spaced!) I received a few 9.5s, but mostly 9s.\nYou will get a lot out of this class, but take it only if you are ready to commit to a semester's worth of not much else beside this class. He expects 100% participation and preparation at all times, and usually more than you expect until you realize that's the case, and if you're not prepared for it, you can get railroaded pretty quickly.\nWorkload:\nAssignments due each Monday and Wednesday that are expected to take 2-3 hours, but usually take 4 or 5. You are exempt from two, and then in place of two you turn in papers. Two thirty-minute presentations on the material are also expected.\n"
        },
        {
            "course_name": "Islam in the Post Colonial World",
            "review_date": "January 17, 2012",
            "review_content": "\nProfessor Haider was without a doubt the best Professor I had last semester, and his class was my favorite by far despite the fact that it was my most work intensive course.  He managed to infuse even the most boring subject with information that captivated and made the subject come alive.  His main goal is not for class to be an hour of lecturing, but rather interaction between the students and himself.  He cares an incredible amount about their success and is very encouraging.  His primary concern is that you actually take something from class and learn, and as such, in each class he did call upon two people whom he would ask questions about the readings.  But they were general concepts, and as long as one read and comprehended, they were fine.  Don't be intimidated.  If you actually do the work, you will do well.\nIn essence, his dedication to the material and his excellence in transmitting the information with hilarity while making it fascinating made EVERY class one I was unwilling to miss for any reason.  \nWorkload:\nWeekly blog posts responding to his prompt, reflections on one current event involving some part of the Islamic/Muslim world, and two comments on the media posts of classmates.\nA TON of reading every week.  \nProphecy Assignment- Put yourself in the shoes of a prophet and describe how you would react to hearing a voice inside your head.  (Page limit? \"As long as it takes...\")\nEvolution Fatwa- You are given a side, either pro or against evolution.  You had to defend it in tradition Islamic Fatwa style with sources from the Qur'an, Hadith, and Sunna (if applicable).  Again... \"as long as it takes...\"\nFinal Paper Assignment- Respond to the prompt, 7-9 pages.  \n\n"
        },
        {
            "course_name": "Exploring the Sharia: Islamic Law ",
            "review_date": "December 23, 2011",
            "review_content": "\nProfessor Haider is one of the best professors I've had at Columbia.  He truly cares about his students and does his best to make his classes both engaging, funny, and pertinent to assignments.  He is passionate about the material he teaches and that truly radiates to his students.  Although the workload included a lot of reading, he focuses more on whether or not students are understanding the core concepts of the curriculum instead of minute details.  Not to mention, Professor Haider always makes himself available to his students during office hours.  \nWorkload:\nHeavy reading, but good reads \n"
        }
    ]
}