{
    "prof_info": [
        {
            "prof_name": "David Sable",
            "prof_id": 10698,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Entrepreneurship in Biotechnology",
            "review_date": "January 08, 2014",
            "review_content": "\nThis class was great. The material was very informative, and ranged from the business side (balance sheets, income statements, etc) to the sciences (obviously) to career advice and other interesting areas like patent creations, elevator pitches, etc. \nThis class is also not like any traditional classes, and homework assignments are graded off of completion, while the majority of the final grade relies on the final exam. The final exam was extremely easy, however, and I think Sable gives guaranteed B+ as long as you complete everything, which is definitely nice and takes pressure off of the learning process. Overall, I learned a lot of interesting and random facts without the pressure associated with other classes at Columbia, and I'm really glad that I took the class. \nWorkload:\nVery light! One online assignment about once every 2 weeks graded solely off of completion; a final exam that took less than 1.5 hours and is relatively easy to prepare for.\n"
        },
        {
            "course_name": "Entrepreneurship in Biotechnology",
            "review_date": "October 29, 2011",
            "review_content": "\n\"Entrepreneurship in Biotechnology\" is the most informative, engaging, and downright fun class I've taken at Columbia, and Prof. Sable is incredibly knowledgeable and helpful.  The course introduces scientists and engineers to business principles by studying the biotech industry.  Not only is it fascinating to study the dynamics of growing businesses, but also once you start having job interviews, this class will help you confidently answer questions employers might ask.    \nQuick!  What's the difference between debt and equity?   If you're not sure, take this class!  One of my favorite aspects of the course was getting to ask any and every business- or biotech-related question I had during office hours, whether my questions were extremely basic or more involved.  Prof. Sable has extensive experience with both the scientific and financial concepts covered in the class, and he will give you friendly and insightful explanations for any question you have related to class material.  \nLectures range from discussing trends in the global economy to constructing an elevator pitch and a business plan, and I really enjoyed that the class covered a wide range of topics.  Prof. Sable also brought in several guest speakers to talk during the second half of many classes.  Hearing their thoughts was highly informative, and we had plenty of opportunities to ask the guests questions.  I learned more about different careers and how different aspects of industry interact from hearing them speak than from most specifically job-related events or books.   \nIf you think studying how companies operate sounds mysterious, dry, or irrelevant, Prof. Sable will convince you otherwise.  His easily-accessible lectures on topics from the funding cycle to financial statements prove that business principles are actually pretty straightforward and rewarding to understand.   Prof. Sable chose interesting case studies to illustrate the challenges faced by nascent biotech firms in transforming their scientific ideas into marketable products.  Finally, fundamental business principles are among the most useful subjects you can study during your time at Columbia.  No matter what your primary academic focus is, \"Entrepreneurship in Biotechnology\" will give you a valuable big-picture understanding of how science-based businesses fit into the economy as a whole.\nTwo quick notes about class format: \n(1) Don't worry about prerequisites. No particular scientific knowledge of biotechnology is required for this class; I can especially attest to this because I haven't taken a biology-related class since freshman year of high school.   However, the field of emerging biotech is quite exciting, and you'll know a lot about current breakthroughs (and failed almost-breakthroughs) by the end of the semester.  And if you want to know more, Prof. Sable can answer your scientific questions or point you in the direction of more reading.       \n(2) The class lecture is two hours long, and they will be the most enjoyable two class hours of your week.  Prof. Sable tends to discuss different topics in the first and the second hour, and because the class covers real-world concepts (vs. formulas or proofs), the two hours go by quickly.  \n\nWorkload:\nCompletely manageable, and the homework is enjoyable.  Many of the assignments are reading articles, or looking up business terms and concepts for the following week's discussion.  Probably the most fun assignment was writing a 60-second elevator pitch for an imaginary company of your choice.   The final exam was the only formal test.\n"
        }
    ]
}