{
    "prof_info": [
        {
            "prof_name": "Mark Taylor",
            "prof_id": 1878,
            "total_reviews": 17
        }
    ],
    "reviews": [
        {
            "course_name": "RAMW",
            "review_date": "February 11, 2006",
            "review_content": "\nVery easy. Avoid if you can. Wait. Want to learn about the class? Get the reading list and do it on your own time if your that gung ho. This guy is pound for pound the worst prof at Columbia. The only class I recived below a B+ in in all my years at Columbia-and it was way below. Think about what you came to Columbia for as others have asked you to do. You came here because you are amoung the brightest in the nation and you want to do the best at what you do. You want to go to law school , med school, grad school, or land that big fancy job. The shity grade you will recive in his class will in no way help you. Wait till someone else teachs it if you can or pick a diff major. Dont belive the hype.  If you value your education or your GPA stay as far from this class as possible.\nWorkload:\nYou will not be able to do it and will fail because of it. \n"
        },
        {
            "course_name": "Religion and Postmodernism,  Religion and the Modern World",
            "review_date": "January 08, 2006",
            "review_content": "\nCULPA reviews for Mark Taylor seem to gravitate towards two poles:  The Mark-Taylor-is-god camp and the Mark-Taylor-is-a-total-fraud camp.  I have had a lot of contact with Professor Taylor.  I was in his first class as a sophomore and I just finished a second (required) class with him as a senior, I've frequented his office hours, and I think I'm as qualified as an undergraduate will be to present a fair critique of him. This man has been an integral part of my academic experience.  But, unfortunately I have moved over the course of those two years from being entrenched in the former camp to being firmly in the latter. \nFirst lets get some basic commonalities of all Taylor classes out of the way.  First of all, the readings for his classes are invariably excellent.  The Religion and Postmodernism syllabus in particular is stuff that you really won't read in almost any other class (De Certau, Jabes, Kristeva, Blanchot).  However, the reading lists are also always absurdly, truly absurdly, long.        If someone wanted to concentrate solely on this class, it would probably be plenty of work for an entire courseload.  Taylor says this is because syllabuses are required to have 200+ pages of reading per week or something, but, strangely, no other classes that I've been in have had this requirement.  In any case, he does not give any hint  on which 30 pages (which would be plenty) to concentrate on, and you will inevitably get very far behind on the reading, to the point where you may have to abandon entire authors.\nBut these readings are awesome, and very inspiring.\nThe second most salient aspect of Mark Taylor's classes are that they are never, or rarely, boring.  He has this bigtime cowboy thing going on, kind of an intellectual Burt Reynolds or something, always wearing black cowboy boots  sometimes taking it all the way with black jeans and shirt.  He struts around and stomps his foot to accentuate points or when he asks a question;  he beckons at you like Neo; he puts his foot up on a desk and flexes and preens, or takes a chair and sits like A.C. Slater.  He shouts a lot, and he always emphasizes how important the material is, saying things like, after Kierkegaard, if you're not frightened right now, you're not really alive or something like that.\nAnd students seem to love Mark Taylor for this.  They love him because he opens their eyes to this new world where school, and philosophy, matter, and he makes them feel important.  That's how he made me feel when I took Rel & PoMo as a sophomore.  I hadn't really ever read any philosophy after Kant, and the way he talked about this stuff made it seem like the coolest, most important stuff in the world.  So that class came to dominate my life, as it did to the other 13 unsuspecting undergraduates.  We would run into each other on campus, bleary-eyed, and shake our heads in futility together, but kinda smiling, before we went back to reading more PoMo at the glacial rate of about 4 pages an hour, for about 100 pages per class.  Not that it necessarily bothered me.  Hell, I loved it.  Right up until the time when I actually had to do some thinking of my own.  The takehome midterm for the class, 2 five page essays, befuddled me to the point of tears, until I finally turned in something I was totally ashamed of about two weeks late.  I just chalked it up to my own failure to deal with pressure, even when the same thing happened for the final paper, and then I moved on, my GPA and confidence a little worse for wear, but with pride at having stuck with course.\nThen I took some real philosophy classes, read some more, learned how to think, and came back for Religion and the Modern World eager to show that I could handle whatever he had to throw at me.  And that's when I realized, with great disillusionment, that Mark Taylor does not teach philosophy, but rather a dangerous, fetishized doppelganger of it. \nMark Taylor claims that you really don't need any philosohical background for his classes, that he'll tell you all you need to know, that he'll prepare you to think on your own.      Unfortunately, this is a complete lie. Mark Taylor actually prevents critical and creative thinking in his class.  He jumps around, stomping this way and that giving his interpretations, whittling down these incredibly complex thinkers into digestable chunks.  That's not bad, of course.  That's what you have to do at this level.  But Mark Taylor doesn't stop there.  He whittles these thinkers down into three-word sound bytes, dichotomies and keywords.  And he gets you to understand it by every so often asking a question about what he's just said.  The problem with Mark Taylor is that he will only accept the exact three-word turn of phrase that he's been using the entire semester.  If you deviate it from this at all, perhaps to maybe put it in your own words, or try to go over the logic--you know, to actually understand it--he will just cut you off and move on to the next person who can give him the exact answer, word-for-word, that he is looking for.  When that person parrots back that phrase, the implication is that they have done well, that they have done philosophy.  Of course, when he asks a question out of nowhere, usually one that would require a multiple-disseration lenght answer (trace the concept of the world as a work of art from Kant to Scleiermacher to Schelling to Hegel to Marx. Go), everyone is left stuttering, but that must be because this material is just really hard, right?  Yeah sort of, but mostly its just because Taylor has gotten everyone into the mode that philosophy is just the evolution of three-word phrases over time, so no one is really able to think creatively.  Even the people who have actually had some of this stuff in other philosophy classes can't really answer because they have to get in his mode of thinking in order to follow his frantic lecturing.  \nSomewhere in the middle of this class I looked back and rethough my PoMo experience.  I thought I sucked in that class.  I would have said that the primary reason I thought I sucked was because I couldn't answer his questions, whether they were expecting one or two words or tomes (there's really no in between).  I wondered what was wrong with me when I couldn't do these papers at a level that was at all satisfactory to me, especially since Mark Taylor had made such an impact on me.  But now, looking back on it, I  think I did great in that class.  My level of thinking from reading (and living and dying with) those books grew tremendously.  But back then, I woudl have said I did terribly.  And the reason I thought I did poorly was a direct result of the incredibly skewed implication of what philosophy is in Mark Taylor's teaching: not critical, creative, and disciplined thinking, but a shiny set of three-word answers. And I'm sure part of why I screwed up those papers was performance anxiety, but a greater part was that Mark Taylor had not prepared me to think on my own about these people, about what broader implications their ideas could have.  You can't write real papers with glitzy catchphrases.\nPeople who haven't had a lot of philosophy classes will be very impressed by Mark Taylor. He will make a significant, and not unimportant, impact on them, and inspire them to read further.  However, he will also instill some dangerous philosophical tendencies, like a violent reductionism, pedagogical utilitarianism (quick, how can we fit this book into the greater narrative???), and style over substance, and these tendencies will only be overcome through a lot more philosophy and critical self-reflection, which they will never get if they only take classes with Mark Taylor.  \nPeople who have had a decent background in philosophy will find his teaching of Relgion and the Modern World (I can't really speak for PoMo, b/c i didn't know any philosophy then) infuriating.  First of all, he never directly answers pointed questions.  You fit an ungodly amount into the semester in this class;  obviously a lot of important, relevant stuff is gonna be left out when you do Hegel in only two days.  But when you ask him a real, important philosophical question, he'll do one of two things:  He'll either nod and say good, then say, lets hold that or we'll come back to it, or we'll do it when we get to Derrida.  Sorry to burst your bubble, but 95% of the time, he ain't coming back to it.   Or he'll get real excited and flustered, outthink himself for a few seconds, then start in on something totally unrelated (cheese, the Cleveland Indians) and try to tangentially relate it to your question.\nIn fact, Taylor spends at least half of the class time on these tangents.  Now very often  these are pretty relevant tangents.  For instance in a class on Hegel he'll spend ten minutes talking about Pat Robertson and fundamentalism, 20 minutes talking about Schelling and Kant, some time talking about nominalism, and maybe 40 minutes talking about Hegel.  These meanderings aren't bad in themselves;  i'd love to hear them most of the time, and they're usually pretty interesting, though he does repeat himself a ton if you go to his office hours or take a second class with him.  But when you're covering an incredible difficult thinker in two periods or less, there's just not enough time to go off on as many sidetracks as Taylor does.\nLastly, Taylor's readings of these people are actually not that interesting, and in some cases they're actually pretty bad.  I actually don't find his readings particularly creative.  He makes them interesting by his classroom delivery and by the gravitas he always lends them (they've got plenty already).  Sometimes this is becausy he goes around so much that its impossible to retrieve a coherent explanation from it all.\nOther times, I think he just didn't explain them all that well.  Some authors are covered in both classes (Hegel, Kierkegaard, Nietzsche), and in looking back at my notes, I felt that he taught them much better and more thoroughly in the Postmodernism class.  My suspicion is that he tried to dumb them down a bit for the RMW class, which is a lower level, and in doing so, removed some concepts that were absolutely essential to understadning them.   I've also heard from friends who took RMW last year and then sat in on a few of this year's classes that his teaching slipped a bit.\nTaylor tries to present himself as hip, as in touch with students and the modern world and promoting creative thinking, and I am sure he has absolutely the best intentions.  But he just doesn't do this at all.  People assume that he's in touch with the modern world because he talks about it, but he's actually totally removed from it.  He's blocked by his precious philosophers.  Taylor doesn't really look at the modern world.  He looks at the modern world to see how we (actually just he himself) can use it to talk about Kant or Baudrillard, and to confirm them.  He never really observes the world in itself. If he did, you might hear him actually critique someone (to this day, I really don't know of a philsopher that Taylor doesn't like). He only observes what he wants:  Hegel in the world, Derrida in the world.  Never the world itself, the observation of which itself is philsophy.  And since truly creative thinking  only comes from this naked observation of the world, it's no surprise that Taylor doesn't really value creative thinking.  He says, \"All I really want is for you to take this stuff where I can't,\"  which is a total crock of shit.  What he really should have said is \"AllI really want is for you to take this stuff where I WOULD,\"  i.e. applying his specific dichotomies and rigid formulas to a tiny little corner of a room he hasn't quite finished exploring.\nI think Mark Taylor would respond to a lot of this criticism by saying, as he has a few times, that Religion and the Modern World, and probably Religion and PoMO, are not survey courses, meant to broadly educate on a specific topic.  Rather they are courses meant to advance a specific argument of his about religion, that it's a complex system of adaptive networks......But no set of undergraduates is astute enough to understand the difference between an argument and a survey while taking a course of this difficulty.  Taylor ignores the responsibility he has to provide undergradutates who probably have not had much exposure to this material with a fair reading of them, and, much more importantly, to develop in them the ability to think critically about these authors for themselves, in which, in my opnion, he fails decidedly.\nYes it will be entertaining, and to some degree informative, possibly even inspiring.  But anyone who's new to the material will be overwhelmed by him, and anyone who's not will be extremely frustrated by his lack of philsophical etiquette.  If Mark Taylor, were teaching an upper level course, and you had a solid philosophical background, it might be worht it.  I'd bet his teaching would improve.  But his mindbogglingly reductive attitude toward philosophy would remain.  If you want to take his classes for his reading lists, fine.  But don't let him make you doubt your own critical thinking ability.  A respect for critical thinking might cause you to do poorly in this class, but that's the reason you shouldn't worry if you do poorly, not because Mark Taylor is some indicipherable, seduce-and-destroy type philosopher.\nWorkload:\nAs others have stated, insane reading load. RMW just had a midterm paper (topic of our choosing, 10 pages), and a final, although the previous year there was another paper.\nRel and PoMo had a midterm take home, a final paper, and a final.  All of these are panic inducing, for reasons listed above.  The one constant will be the final, for what could be a better measure of a philosophy class than writing as much as you can on incredible malleable topics as quickly as possible?  \n"
        },
        {
            "course_name": "Religions and the Modern World",
            "review_date": "December 28, 2005",
            "review_content": "\nI highly recommend this class !\nI think the negative reviews are a reflection of frustration and not terribly fair to what prof. taylor is trying to accomplish. If you read his book \"Hiding\" it is essentially in a nutshell what the class is about - new ways of looking and thinking about meaning that is hiding in multiple ways.\nI read the CULPA reviews before taking the class and reluctantly signed up since it was a requirement for religion majors. After a month I considered dropping the class because the reading was voluminous for a 3 point class and the existentialist lectures over my head.\nMy pride would not let me quit, and I am the better for it. When the light went off and I finally got it, it was awesome ! Orgasmic bliss.\nWhen I finally undertood Hegel, it all came together and made sense. Prof. Taylor forced me to go beyond the limits I imposed on myself, and stretch my mind way out there.\nthat is what the college experience should be, and to top it all I ended up with a very nice grade.\nWorkload:\nOne mid term paper and a fianl exam.\nThe reading is obscene for a 3 pt. class though.\n"
        },
        {
            "course_name": "Religions and the Modern World",
            "review_date": "December 07, 2005",
            "review_content": "\nForget every other review. Take this class. If you are worried about your grade, take it pass/fail. You will learn. PERIOD. Mark C Taylor might be an \"imposter\" or a \"fake philosopher\" or a \"capitalist intellectual\" or whatever else you want to call him. But he knows his shit. He will lead you through 200 years of european philosophy. From Schelling to Derrida (including Kant, Hegel, Kierkegaard, Nietzsche, Freud, Durkheim, Darwin, Smith, and many more). Seriously, for your sake: TAKE THIS CLASS.\nWorkload:\nRidiculous. This a three point class. He had to but 8 books (we read them all), as well as an 800 page coursepack (the majority of pages, are double). Be expected to spend 4-6 hours reading per class. 10 page midterm essay, and a final (which i've heard is absolutely impossible).\n"
        },
        {
            "course_name": "Religions and the Modern World",
            "review_date": "December 01, 2005",
            "review_content": "\nWelcome to the world of philosophy, arrogence, stupidity and c's if you are very lucky. If this is what you expect of your Columbia experiance I highly reccomend Mark Taylor. He does not seem to\nwant to teach you anything. He seems as if he would much rather be writing another book to add to his twenty others. Think about it. If the guy is spending\nthat much time writing, how much time can he have\nto prep for class?\nyou want to study religion take this class with someone else or take it last because afterwards, if you take it first, it will be the last religion class you take. And that be a shame becausethe department is loaded with scholers\nwho actually are brilliant lecturers, whose intrest is\nnot in murdering your GPA, but getting you to learn as much in how to think and infromation as possible.  \nAnd FYI, I am a grad student. I took the class for R credit. My opinion is based much more on papers of the undergrad students I saw, and the final , which I took for fun . It was inpossible. I felt horrible for the class. Aviod this class at all costs.\n\nWorkload:\ntwo insanely difficult papers. And a final that most people fail.\n"
        },
        {
            "course_name": "Religions and the Modern World",
            "review_date": "August 30, 2005",
            "review_content": "\nMark Taylor has been given a national teaching award. This does not mean that teaching awards know everything, but it might suggest that Taylor has been helpful to his students. To say that he was helpful to me would be an understatement.\nTaylor is a cowboy and a nerd and most fundamentally, a passionate person who does not find answers to his own questions and yet continues to ask his questions nonetheless. He is inspiring as a teacher and as a middle-aged human being because he is so rife with enthusiasm that his body jerks when he talks, as if it cannot contain the existential energy arising within it.\nYou will likely not get an A in his class. Get over it and figure out what's really important.\n\nWorkload:\nA great deal of reading which will subvert everything that you've ever thought was true and simple. Prepare for an existential revolution inside yourself.\n"
        },
        {
            "course_name": "Religion/Mod world",
            "review_date": "April 12, 2005",
            "review_content": "\nThis is the worst professor i have ever had. I am a senior philosophy and religion double major and I found his class to be both intensely difficult and a total waste of time. He likes the socratic method, but dare you raise your hand and ask a question he will gladly tell you the answer to every other question on the planet but the one you ask. That is unless he knows the answer-which is seldom. This man is a total waste of Columbia's budget...Williams College can keep him. Maybe he is mad that he has a Phd from Harvard and cant get tenure at Columbia and wants to take it out on his poor unsuspcting students. I recived a B in the class and that is only because I know philosophy since its my major.  i feel sorry for the poor kids who are religion majors or just took the class to learn about religion. \nWorkload:\nInsane,impossible, and totally worthless unless you want to become a religion philosopher. Even the your better off taking someone else\n"
        },
        {
            "course_name": "Religions and the Modern World",
            "review_date": "January 04, 2005",
            "review_content": "\nBefore taking this class, or any other with Prof. Taylor, ask yourself this question: Why are you here at Columbia?  Are you here to get a truly amazing education that will challenge all of your pre-\nconceived notions and force you to challenge everything to come,, or are you here to get your 3.97 and coast through to get your MBA, MD, etc.\nIf you answered the former, then you will love this course.  It was by far the most challenging course I have ever taken, but every class was enlightening and challenging.  The readings were challenging, and Prof. Taylor held us to a very high standard in every class, expecting us to be fully prepared with the readings.\nBut the bottom line is that this class was incredible, and it was the only class that I've never cut.\nGranted, Prof Taylor can be a little bit arrogant at times, and he definitely uses the biggest words possible whenever he can, in order to impress himself mostly.  But as far as I can tell (from googling him, etc) he is very very well respected in his field, and while this is not an excuse for his arrogance, it is a \"reason.\"\nAll in all though, as long as you kept up with the readings, and showed Prof Taylor that you were putting forth a good deal of effort, you will be rewarded appropriately.\nI know that this review is kind of full of hyperboles, but Prof Taylor is an absolutely incredible and amazing professor.  Sorry for the lack of objectivity, I know that some people hated the course as much as I loved it.  But if you truly have a passion for learning, and not just getting good grades and breezing through college, then this is the course and the professor you've been looking for.\nWorkload:\n1 midterm paper, 4-6 pages.   1 final paper, approximately 10 pages.  a final, which has three questions that he described as \"impossible, unmasterable, and there is no way you can completely answer them in 3 hours.\"  He basically wanted to see our thought process more than our actual answers--that's his style!\n"
        },
        {
            "course_name": "Religions and the Modern World",
            "review_date": "January 02, 2005",
            "review_content": "\nBest Prof ever!\nWorkload:\n1 5-7p paper, 1 8-10 p paper, Final\n"
        },
        {
            "course_name": "Religions and the Modern World",
            "review_date": "December 22, 2004",
            "review_content": "\nAs a result of Mark Taylor and the thread of religion he pulled out of Kant, Hegel, Marx, Heidegger, and Derrida--among many brilliant others--my life is forever changed. Though his lectures may seem scatterbrained on the surface (my dear friend called this class \"edjacutainment\" for Taylor's ejaculatory teaching style), they are, in fact, brilliant, focused, and thorough. He is a secular intellectual, so you won't find any real reverence for organized religions, but over the course of the semester you will see his humility in the face of the unknown, which, for a scholar like Taylor, is simply a placeholder for God. I wrestled with my own faith in this class and came to find peace with it through postmodern readings and Taylor's own apparent comfort with that sacred unknown that allows us to know what we know.\nWorkload:\nHeavy, but worth it. Maybe 100 pages of reading per week, one midterm paper, one final paper, and a crazy final exam. Also, weekly discussion section.\n"
        },
        {
            "course_name": "Religion and Postmodernism",
            "review_date": "May 31, 2004",
            "review_content": "\nAt first glance of the the uber-long review given below, I thought to myself, what is this person talking about?  But after mulling it over for a bit, I feel the need to clarify and add a few thoughts of my own.  Besides, half the class has already reviewed Taylor, so here's my take:\nI disagree that Taylor is a mercenary; He is truly engaged in and excited about his work.  Whatever success he has enjoyed he has earned, and I don't think that there's a mercenary or dishonest bone in his body.  On the other hand, as the other reviewer has pointed out, he has constructed a certain image of himself that is somewhat disingenuous.  (I'm not sure how to describe it other than that it involves wearing cowboy boots and throwing around words like \"preontological\"; whatever that means.) \nI think Taylor once made the distinction between being a scholar and a \"thinker.\"  I have no doubt that Taylor thinks of himself as a thinker and expects his students to operate as thinkers as well, but he does so at the expense of scholarship.  He provides no real critique or historical perspective for much of the syllabus.  There is little or no forum for challenging the validity of the arguments of many of the writers (esp. certain of his favorites) or of the claims of postmodernism in general.  He is truly the \"insider\" of postmodernism, and if you plan on challenging his assertions be prepared for a long, drawn out debate that you will lose.\nAs far as his teaching abilities, Taylor structures the class as a dialogue between the thinkers we have read, which would be fruitful except that very few of us understood the readings to begin with.  A class that deals with postmodernism at the undergrad level really needs to be much more straightforward, at least at first, before we can all enter the illustrious \"thinker\" stage.  \nDespite all this, I am glad I took this class, because I can honestly say that I learned a lot both from the readings, my classmates and Taylor  (in that order).  What doesn't kill you makes you stronger.  Do not take this class if you value your GPA.\nWorkload:\nInsane for a 3 point class.  Tons of reading, which you must do, because he will call on you and if you don't have at least something relevant to say, woe unto you. 10 page take home midterm, required weekly discussion section, 10 page final paper, final.\n"
        },
        {
            "course_name": "Religion and Postmodernism",
            "review_date": "May 29, 2004",
            "review_content": "\nThe below review (starting w/ the Seneca quote) was fantastic and, in my opinion, almost completely right on. \nThe only thing I disagree with is that it's just fine to sit through Taylors class without calling him on his teaching. First of all, as undergrads 99% of us don't really know enough to call out a professor and there's no need to do that sort of thing (I I don't buy the positive feedback argument) because it makes for an uncomfortable class experience for ALL the students. Just sit through the class like I did (and like the reviewer did) - you'll learn a hell of a lot and you'll learn extra because by disagreeing with Taylor you'll help shape your own opinions.\nWorkload:\nAn absolutely INSANE amount of work. Completely friggin' ridiculous!! I'm a senior (well, now graduated) and have never had to do so much work for a class. Good reading list though.\n"
        },
        {
            "course_name": "Religion and Postmodernism",
            "review_date": "May 19, 2004",
            "review_content": "\nseneca once wrote, 'i think there is no one who has rendered worse service to the human race than those who have learned philosophy as a mercenary trade.' a merceneary trade is a rather apt of describing how mark c. taylor teaches philosophy. for taylor, philosophy is a battleground of abstract concepts and the victor is he who can master those concepts and use them as weapons of uselessness. as his student, you will be expected to do the same. taylor's attempts to make this philosophy accountable to everyday life are laughable. to think of taylor as opening your mind to new philosophical ideas is to buy into his fractured system where what you think doesn't matter at all to who you are. taylor is the personification of the hopelessly abstract academic philosopher who snatches on to new vogue ideas in order to write about them and market them as a mercenary, not as a human being. (note the fashionable trajectory of his career and his entrepeneurial pursuits in the world of making education into a marketable business.)  taylor's vision of philosophy learns nothing from the texts he supposedly knows so much about. as the other reviewer noted, asking what derrida means means that you haven't really read derrida on his own terms. it means you never learned how to teach; it means that philosophy means nothing to you except as a way to get famous. so don't take taylor's class because he is so smart or because he has such great readings of texts. he cannot be a great philosopher because he does not understand philosophy as a way of life, not just a system of abstractions. if you decide to study with him because the syllabus is just too attractive to pass up or because your intrigued by the hype, by all means resist. refuse to buy into the poverty of philosophy that taylor so well represents. grill him as he grills you in class. as much as i dislike the man's views on philosophy, he will respect you for sticking up for yourself and arguing your position. the fact that i have spent so much energy ranting about him does show he can excite energy. but be braver than i was. don't just vent in a culpa review. even if you don't know as much about the texts, hopefully you know more about being human, and hopefully you can make this class a more pleasant enviorenment than it was for most of us in fall 2003.\n"
        },
        {
            "course_name": "Religion and Postmodernism",
            "review_date": "April 20, 2004",
            "review_content": "\nI've never written a review before, but I felt the need to comment on the other reviews of Prof Taylor. His class was hands down one of the best courses I have taken at Columbia.  Yeah, it was also the hardest and somebody should remind the man that it's a three point class, but it was worth it.  I did experience the love-hate relationship with the class that the other reviewer mentions, but in the end I am really glad I took the course.  It is intense, but it's rewarding.  Also, I found Taylor to care more about his students than any other professor at Columbia, maybe because he's used to teaching at a smaller school.  Take ANYTHING with Taylor, you'll be glad you did.\nWorkload:\nintense. the reading is hard and you are expected to have done it well. hard work will be rewarded\n"
        },
        {
            "course_name": "Religion and Postmodernism",
            "review_date": "March 29, 2004",
            "review_content": "\nI guess I'm in between the other two reviews. Taylor is really smart & probably worth taking a class with, but he is definitely way too intense to make this class enjoyable. I came into the class in love with French Theory and left it slightly disillusioned at how it was being canonized and taught in a way antithetical to its spirit. (What does Derrida mean is such a bizarre question in context, e.g....) Anyway, introduces you to fascinating readings and interpretations, but will probably not be something you look forward to. Decide if it works for you.\nWorkload:\nSome dense reading, some great reading (esp. Bataille & Jabes). \nOtherwise as described in other reviews\n"
        },
        {
            "course_name": "Religion and Postmodernism",
            "review_date": "January 08, 2004",
            "review_content": "\nThe above review is pretty much right-on describing Taylor's character, but I still have to reccomend this class.  You're just not going to find material like this from anyone else at Columbia, except in a few Art History grad seminars.  And, whatever you want to say about Taylor, he really knows his stuff and he does everything he can not only to transmit that knowledge but also to get students as excited about it as he is.  He may be resistant to other interpretations, but you're not going to get ahead of him without spending 20 years immersed in these texts.\nI reccomend this class to people who A) don't mind getting in over their heads intellectually and B) don't care about their GPAs.  Taylor would probably say the same thing.\nWorkload:\n8 page midterm, 12 page final, plus in-class final exam.  very dense reading (Lacan, Heidegger).  WAY too much for a 3 pointer.\n"
        },
        {
            "course_name": "Religion and Postmodernism",
            "review_date": "December 20, 2003",
            "review_content": "\nYou get a lot out of Taylor's class, but ultimately it takes more out of you. By reputation, Taylor has more moments of arrogance than of brilliance, though both occur frequently. The teaching style can get annoying quickly and classes are often frought with tension. He picks out passages or asks general thematic questions and calls on students to elucidate them, which can be exruciatingly difficult with heidegger, derrida, and the like. Moreover, a lot of interesting discussions that could occur around these texts are subsumed into Taylor's lecture agenda. In class time, Taylor's not necessarily resistent to contrary opinions to his own, he just doesn't care about them. (In your writings it's best to stick to his literal interpretations - he's stubborn.) Most people in the class seem to have a sort of love-hate relationship to it. You learn a lot of interesting things with a man who's an expert on just about everything that happens in Western thought after Hegel, but his resistances, pretentions, over-intensity (control freak, as he readily admits) and faux niceness start to wear on you. He's teaching in the fall here every year for the next five years, but, in the end, I think if you want to learn something from this man you're better off reading his books.  \nWorkload:\n10 pg. take home midterm, 10-12 page paper, final. fair amount of dense reading. great syllabus. serious grader.\n"
        }
    ]
}