{
    "prof_info": [
        {
            "prof_name": "Maria Chudnovsky",
            "prof_id": 4996,
            "total_reviews": 9
        }
    ],
    "reviews": [
        {
            "course_name": "Mathematical Programming",
            "review_date": "December 22, 2011",
            "review_content": "\nMathematical Programming is conceptually easy, but the graders and TA's will take off a lot of points for mistakes.  I actually enjoyed going to lectures except when we did proofs that were never seen again for the whole hour, which you can just read and understand on your own.  Grades seem to be too subjective in the sense there are several ways to approach a problem so TA's are likely to give back points for regrade.  The first average of the midterm was an 80, the second was a 90, and then final was an 80.  Obviously the material is not difficult, but you have to work to keep up with the average.\nCurve was nice:\nfinal grade >= 96  ---> A+\n90A\n84.5A-\n80B+\n75.5B\n69B-\n65C\nfinal gradeC-\n\nWorkload:\n10 Problem Sets (20%) - Most easy and helpful\nMidterm I (20%) - A little tricky\nMidterm II (20%) - Very straightforward \nFinal (40%) - Cumulative, but focused more on LP formulation and second part of the semester's algorithms \n\n"
        },
        {
            "course_name": "Mathematical Programming",
            "review_date": "January 09, 2011",
            "review_content": "\nProfessor Chudnovsky was a good professor. Not terribly exciting (she also taught this class at 9 AM), but in terms of transferring what she knew to your head, she was excellent. Her lectures were very organized, and had plenty of examples. Just make sure to get all of the general steps of each algorithm. Her midterms were ridiculously early though: the first one was after four lectures. She also doesn't appear to be the most approachable person.\nWorkload:\n11 Problem Sets (10 required, 1 optional), no dropping lowest\n2 midterms: 1st was very easy, 2nd covered more material but was still very manageable. Both in first half of class\nCumulative final, very manageable.\n"
        },
        {
            "course_name": "Intro to Math Programming",
            "review_date": "December 16, 2010",
            "review_content": "\nChudnovsky was not as bad as I thought she was going to be. Granted her lectures were only mildly useful (she's not very good at teaching and she usually makes mistakes), the course itself is very easy and if you take the time to understand it, you will do well. The best thing to do is to do the homework every week and become well-acquainted with the techniques. The textbook is just as useless as Chudnovsky is by the way so your success in the class basically depends the quality of your TAs. We had one really great TA so those of us who went to her office hours every week did fine.\nThis was the end curve:\nX>97 A+\n90t need to study much in the end.\n2. DO NOT MAKE SILLY MISTAKES ON THE EXAMS. The exam averages are usually pretty high and a lot of people score in the 90s. If you make a silly mistake, its probably going to cost you 15 points. Ridiculous.\n3. Go to office hours.\nWorkload:\n10 - 11 homeworks, only 4 or 5 problems each, very simple and a good representation of the basic concepts you need to know\n2 midterms, fair\nfinal, fair / mildly challenging\n"
        },
        {
            "course_name": "Graph Theory: A Combinatorial View",
            "review_date": "May 17, 2010",
            "review_content": "\nThe class was definitely a math class, though I happen to know that the curriculum of the other graph theory class is equally un-applied (it is much easier though). If you are interested in Graph Theory specifically, you should definitely take it. Maria Chudnovsky is one of the rising stars of the field.\nAs a teacher, she's decent. Her lectures are solid and she takes time to go over things twice if they're difficult. Unfortunately, the sheer volume of information sometimes means that problems on the homework call for answers that came from peripheral facts in class. In addition, the most difficult theorems she proves in class are almost impossible to wrap your head around the first time hearing them - they take up multiple blackboards and take some deep thinking to grasp. \nHomeworks are proof-based and reviewed upon handing in with students giving the solutions. These review sessions were semi-helpful, and Maria elucidated the worse-written proofs. Still, I sometimes slept through this part a little.\nThe class when I took it was over a third PhD and masters students, so as an undergrad I was pretty intimidated. I had the impression that Maria and her TA would have given a lot of help if I had sought it more aggressively, but I didn't end up doing so.\nOverall: A very solid course, with a nice and helpful teacher. If you don't mind the math orientation and fairly high level of difficulty, you should definitely take it.\nWorkload:\nHomeworks: Ostensibly weekly, which were assigned annoyingly often with just 5 days to complete. However, they often ended up being two-week assignments instead, which was much easier to deal with. Content was tough, but half-proofs and almost-right proofs were given generous partial credit, especially on the final. Rigor is not demanded unreasonably in the proofs, in keeping with it being a class open to non-math majors. Not all problems will be doable - There were some that almost nobody in the class was confident enough to present their answer for. Maria intends and accepts that this is occasionally the case, so don't worry when you can't get 90%. Normally below the level of the difficult lectures also.\nExam: One hellish take-home. An experience I hope not to repeat. Graded very leniently though, with lots of partial credit. Know the lecture content.\n"
        },
        {
            "course_name": "Graph Theory: A Combinatorial View",
            "review_date": "May 13, 2010",
            "review_content": "\nThis course started off with really basic things but moved along very quickly, covering a broad range of material at quite a deep level. Seemed that we were getting definitions in one class, and moving on to prove some famous/important theorem the next. \nWe got homework every 1.5 weeks or so on average, and the professor would get students to volunteer to share their answers with the class on the board, which was quite an interesting exercise.\nProf Chudnovsky is brilliant and really knows her stuff. This comes across in her lucid explanations, and her live critiques of students' proofs. (Though it was sometimes cringe inducing to see a poor soul's proof being shredded to bits in front of the whole class, I can understand that it was good training  for graph theorist wanabbes.) She's also very approachable and willing to explain really basic stuff if asked.\nIts not an easy course to get an A in, especially if you don't have some previous experience with mathematical proofs (speaking from experience here). But I'd recommend it if you're looking to learn something interesting and be intellectually inspired.    \nWorkload:\nPretty heavy. Assignments take a fair amount of time, which can either be really enjoyable or painful-depending on whether or not you like staring at a blank sheet of paper and thinking.\n"
        },
        {
            "course_name": "Graph Theory: A Combinatorial View",
            "review_date": "May 08, 2010",
            "review_content": "\nMaterial: \nDon't be mislead by the cross-listing as CSOR, this is a MATH class all the way, taught by a math person. You won't learn how to solve any real world problems using graph theory by taking this class. By \"application\" Prof. Chudnovsky means proving a theorem using another theorem instead of proving it only from first principles, she doesn't mean applications in real world problems. \nI even had an interview where having seen this course on my resume, I was asked a very reasonable (for someone who has taken a CSOR graph theory class) applied question which of course I couldn't answer properly as we totally skipped that in the class, and what was an otherwise decent interview got spoilt. Needless to say I wasn't picked for the next round and I have now actually knocked the course off of my resume. \nSo, unless you are a math major or theoretical computer science Ph.D. student or some equivalent thereof in another department, this course is just going to be a wasted effort in terms of time and money. Probably the CS version of the class is a better option if you are a CS student or have spare electives left in OR.\nGrading: \nWe were told in class that \"75 is a good score in this class\" and also that \"you shouldn't worry too much about your grades, I know it's an advanced course, so I won't be doing averages and curves, [although it's not officially on the grading rubric] participation will count\". \nAssuming that 75 was indeed an A-, if you end up a point or 2 short at the end of the day, don't expect to be bumped up even if you have a 100% attendance (there were only 16 students and Prof. Chudnovsky handed back homeworks in class, so she definitely knew who is who and how regularly they came to class). In summary, appearances are deceptive, Prof. Chudnovsky has a very sugary sweet personality, but when time to assign grades comes along she can be cold hearted and mean.   \nWorkload:\n1 week take home exam due on the last lecture counting 50% of the grade, and is graded by the professor. \nHomeworks (we ultimately managed to have 9 of them) count for the other 50%, and are graded by the TA. The homeworks are generally on a assigned on Thursday, due to the following Tuesday cycle, but adjustments were made when we didn't get through enough material in lectures. \nThey are all proofs, so it's hard work. If there were 4 or fewer problems (generally the case) 4 days was enough time to do them provided you don't have more that 2 other classes. There were a couple of homeworks with 5 or more problems and these are ones you are likely to bomb a problem and a half because there just isn't enough time, especially when you have exams/projects due in other classes. With the no mercy if you end up on the borderline final grading policy, this can end up making the difference.\n"
        },
        {
            "course_name": "Graph Theory",
            "review_date": "May 01, 2010",
            "review_content": "\nI was terrified of Maria after reading the two reviews about her on CULPA. In my experience, she is nothing like that. She is not only an amazing mathematician, but a charismatic, compassionate, and funny person. I was scared to take the class because I was the youngest student in the class, and she was very kind and helped me work through issues that were probably rudimentary. She probably realized that I wanted to work to do well in the course, and that is why she supported me. \nIf you get a chance to take a class with her, I would highly recommend that you do so. She is currently one of the most illustrious individuals in her field, and can elucidate the beauty hidden within graph theory.\nWorkload:\nApproximately one homework assignment per week. These start off easy, but get progressively difficult--not impossible though. 4-5 problems, all proofs (I think we had maybe 2 problems all semester that were just applying an algorithm, but the rest were all proofs). The grade is 50% homework assignments and 50% final take-home exam (cumulative, 7 problems).\n"
        },
        {
            "course_name": "Mathematical Programming",
            "review_date": "April 21, 2009",
            "review_content": "\nI completely agree with the above review.\nThe class as a whole is curved, and so even if you don't have those random points taken off here and there you still are not guaranteed a good grade. The average on the first midterm, two standard deviations above the average on the second midterm, and one standard deviation above the average on the final still resulted in a B- for the class.\nConsider yourself warned.\n"
        },
        {
            "course_name": "Intro to Math Programming",
            "review_date": "January 20, 2009",
            "review_content": "\nI'm going to cut right to the chase, and tell you that this is not so much a review as a warning.\nMaria is not good person. In fact, I felt myself becoming religious for the wrong reasons: I wanted her to rot in hell and suffer an eternity of some kind of torment. \nHere's the thing. Her exams are extremely easy if you study the material at all. However, the course is curved around something, so you expect that something fishy is going to happen. Something very fishy happens. Her TA's begin taking points of for extremely silly things. Oh, did you not detail every tiny step you took to get to the answer? 5 points off. Oh, you didn't name the method you are using to answer the question, even though it's bloody obvious what you're doing? Take 5 more.\nSee my point? The class is curved around how good you are at predicting what random thing they are going to take points off for next. If you are reading this review before taking her class, then you are lucky. You can simply avoid this non-sense by writing down every tiny detail, just to be on the safe side. \nIf you do talk to her, as I've heard many people have done, you will not get the slightest sympathy. Not that I expect any, since I understand she cares nothing about what I think. But there's something cold about the way she talks and looks at you, that reminds me particularly of a venomous snake. Anyway, I digress. Just don't bother talking to her or her TA. He's this snooty French guy, who despises you stupid Americans.\n\n"
        }
    ]
}