{
    "prof_info": [
        {
            "prof_name": "Peter Bower",
            "prof_id": 427,
            "total_reviews": 54
        }
    ],
    "reviews": [
        {
            "course_name": "BC1001 Environmental Science",
            "review_date": "November 11, 2014",
            "review_content": "\nAs the other reviewer said: EVS 101 with Bower is a decent way to fufil the lab requirement if you're not a strong science person. Overall, I have enjoyed having class with him, although his tests are relatively difficult(though not impossible). I would say the test(there are three equally weighted tests) average is about 75-85%. There are no curvebals on the tests, and he will not put anything on the tests that he hasn't actually gone over in class. Answers emails very quickly, although is very difficult to get a hold of after class and doesn't really have office hours. \nAlso, Professor Terryanne Maenza Gmelch was my lab instructor, and she is lovely and very helpful. \nWorkload:\n3 equally weighted tests and \"lecture responses\" for each class, which is basically an in-class easy worksheet you fill out to prove you attended class. If you're also taking the lab, your lab grade is 30% of your final grade. Trip to the Met and trip to the American Natural History Museum. \n"
        },
        {
            "course_name": "BC1001 Environmental Science",
            "review_date": "May 18, 2013",
            "review_content": "\nThis class is a reasonable way to fulfill the Barnard science requirement.  However, I would not say it is an easy A.  There is quite a bit of chemistry involved and lots of memorization required for the exams.  Lab is fairly easy, but A LOT of busy work.  Lab reports are not difficult, but very time consuming.  Sometimes you do fun things like boat on the Hudson or walk through the park.  Sometimes you do not so fun things like concave maps for four weeks.  At times the class seems to lack cohesion as there are so many components: several books (Never Cry Wolf, Silent Spring, etc), nuclear power, the Hudson River, art history, groundwater, etc.  Even though I didn't enjoy this class at times (especially second semester), I do leave it feeling pretty well versed in many aspects of environmental science.  Bower is pretty funny in class (perhaps more so when he's not trying to be) and is perfectly nice when you go to him with questions.  I can't give this class a rave review, but it's not so bad either.\nWorkload:\n2 exams and non-cumulative final (20% each)\nLecture Responses (10%)\nLab (30%)\n"
        },
        {
            "course_name": "BC1001 Environmental Science",
            "review_date": "May 07, 2012",
            "review_content": "\nnone of the reviews on here really helped me much when I was trying to decide if I wanted to take this class, so I decided I would try my hand at it, and include more details about what the class is actually like and what you will be doing.\nComing in, I had yet to fulfill the science requirement, really really didn't want to do it with psych (not just bc people think it's a cop-out, but bc I fell asleep in the pysch class I would have otherwise taken.) So for someone like me, who wants to actually learn some science but blanks out when expected to do more than one problem with numbers in it- this is the class to take.\nWhat the course actually is:\nFirst semester: The Hudson River. you learn about what an estuary is and what lives in it, lifecycles of organisms, and the whole ecosystem. For example, how a particular fish reproduces and travels out to sea, when it returns to freshwater, and monarch butterflies. Learn the map of the Hudson and where all the towns are. how to test for suspended matter and contaminants in the water.\nSecond semester: Brownfields (aka polluted sites and what to do about them), contaminants (chemical and nuclear/radioactive) and how they leak and pollute the environment. environmental law (via a court case about a factory that dumped chemicals and kids in a nearby town that got leukemia). a little basic chemistry, good review. Groundwater, soil, and river systems (which sounds dull but I liked that part). in lab, you do a simulated ESA (environmental site assessment) with an online program Professor Bower designed. you act like a real environmental team and go to a site, check it for pollutants, make recommendations for cleanup. A former student got a job because she impressed the interviewer by knowing exactly how to do an ESA- a fact that Prof Bower will mention every other class. hey, he's allowed to be proud.\nPros and cons:\nPro: definitely the trip on the Sea Wolf, sailing on the Hudson river- a highlight of the course. the trips around Morningside heights, getting to know our neighborhood in new ways and exploring corners of it I'd never been to. planting flowers in riverside park. When I travel on the subway I understand why the subway goes aboveground at 125th (has to do with the bedrock!) I never understood before that organic food is not just a fad, and what chemicals actually do to you.\nCon: the labs that aren't super cool are SUPER boring and pointless. painfully so. like, holding your eyelids open to pretend interest, while imagining ways you could push the hands of the clock forward without anyone noticing. and too many labs involved coloring on maps with colored pencils. I'm in college, not kindergarten, thanks. Still, you survive.\nalso hated the art history stuff- if I wanted an art history class I wouldve taken one. you have to learn about Hudson River school paintings and I never saw the point. And Prof Bower cannot talk about any kind of fish without mentioning a recipe at some point. Lab reports are tedious and frustrating.\nYes, the course can feel scattered and random sometimes, but as Prof Bower says, \"your education is what you remember after 6 weeks,\" and you will learn a lot and have experiences that will be much more memorable than the nitpicky exams and lab reports. I do feel that I know a lot more about the environment, both ecosystems and pollutants, than I did before this class, enough to make me feel that taking it was worthwhile.\nWorkload:\n2 midterms and a final each semester.\nThere are some readings, you can do them in pieces or all at once (Never cry wolf, a civil action, silent spring are the main ones.) You fill out the lecture responses as Prof Bower addresses each topic during lecture, and hand them in before you leave.\nThen you have the horrible lab reports which come up a few times a semester. Nitpicky horrible grading system and really tedious and time consuming, you can do them the night before but it is stressful. Not exactly busywork, as others below have called it, although yes its boring. But harder than just copying answers. Second semester its a little easier to figure out what the requirements are. I disagree with anyone who says its an easy A, not when you get 10 points off every other section because you mislabeled something stupid, even after working on it half the night. I really hated them. But definitely better than chem or bio.\n"
        },
        {
            "course_name": "BC1001 Environmental Science",
            "review_date": "January 26, 2012",
            "review_content": "\nI really enjoyed this course. I am not a science person and took it to fulfill the lab science nine ways of knowing for Barnard, and I am glad I did! I was actually surprised how much I ended up liking the course, and by how much I learned. Professor Bower is clearly very excited by his subject, which is refreshing. He can get a bit ridiculous at times (talking about how he was once colleagues with George Bush, regaling us with stories of his fancy boat, etc), but he is quite amusing. He also really seems to appreciate other facets of the science, such as incorporating art, music and literature into the course, which made the material more interesting.\nYou do have to go to every lecture because he gives out worksheets that you turn in at the end of the lecture with your name (his form of taking attendance), but hey, at least the lecture isn't at 9 am. The lectures aren't that boring because Bower is an engaging speaker, and when he isn't, you can just do readings for other classes. His tests are fairly easy, just be sure to study- he tells you exactly what to expect. He is a pretty reasonable guy.\nThe lab section was my favorite, you actually get to do pretty cool stuff (go on a boat on the Hudson, go to the AMNH, etc) and Terryanne is the coolest lab instructor ever.\nOverall, it's not a bad course to take if you want to get the science requirement out of the way. I wouldn't recommend it to someone who is passionate about Environmental Science, because it is a pretty easy course. However, like I said before, for those of us who aren't passionate about ES, you learn quite a bit about the basics.\nWorkload:\nAssignments for each lecture that you absolutely do not have to do (they aren't turned in, helpful however if you are confused on something), readings from time to time, two midterms, a final, and the book \"Never Cry Wolf\" (super easy read).\n"
        },
        {
            "course_name": "BC1001 Environmental Science",
            "review_date": "January 18, 2012",
            "review_content": "\nI just adore him. He is enthusiastic, has a great sense of humor, and made a dry subject interesting and works hard to make the topic applicable to life. It was a great and educational class. Ignore the reviews where people think that if the class is too fun or easy it must not be academic enough. The criticism I have is that the amount of busywork was too much and didn't contribute to the learning process. \nWorkload:\nToo much busywork versus critical thinking sole complaint. But if you do the work and engage you will get an A\n"
        },
        {
            "course_name": "BC1001 Environmental Science",
            "review_date": "December 13, 2011",
            "review_content": "\nProfessor Bower is a professor unlike any other I have met. He is clearly very excited by the subject matter, and demonstrates a serious passion for environmental science. However, Professor Bower is overall an ineffective teacher. He often went on unrelated tangents, breaking the rhythm of the lecture. I remember a lecture that was supposed to be about fish life cycles in which he talked about etiquette for ten to fifteen minutes. His teaching methods were often rudimentary and condescending...I felt as though completing handouts with every lecture was very much a high school tactic. It seemed as though Professor Bower had trouble engaging students with the material. The expectations he had of students at the beginning of the course were low, so students consequently put in only enough effort to pass. \nI would not recommend this course to a Barnard student. I certainly learned a lot of information about the Hudson River, but overall, I think the course sets low expectations for its students, and encourages a superficial understanding of the material. Most students (including myself) felt unmotivated to put in a serious effort because those efforts were not constructively evaluated (for example, getting 100 on every assignment simply because you completed it). This view was exacerbated by the fact that students were not required to take comprehensive notes; every lecture was accompanied by a handout with questions. I found myself (and most other students, after talking with them) listening to lecture only for the answers to the questions, as that would be the material we would be tested on. \nThe structure of the course is incredibly scattered. Although the objectives of the course were not those of a typical environmental science course, it felt difficult to keep up with what was expected of me, as much of the subject matter was scattered. I often felt like I was learning various facts without any cohesion or unity. It would have been much easier if the course was structured in chapters or units. The course was sometimes focused this way, but for the most part was not (for example, we learned about food webs at two different points in the course). I also felt like many of the topics covered were completely unrelated to the Hudson River, the primary subject matter of the course. I found little relevance in studying wolves in a course about the Hudson River. I also found it confusing to be writing an essay for a course that was forced to be interdisciplinary-I found myself wishing we did more hard science.\n\nWorkload:\nEasy, but all of it is busy work. 2 midterms, a final, handouts with every lecture. 12 lab assignments that include a few lab reports, worksheets, field-journals and self-guided tours, along with a final power point project on a topic relating to the Hudson of your choice.\n"
        },
        {
            "course_name": "BC1001 Environmental Science",
            "review_date": "January 05, 2011",
            "review_content": "\n  Great class for anyone who just wants to finish the science lab requirement. Easy easy easy. It is a 4.5 credit class; 50% of the final grade is lecture, 50% is lab. Bower is an incredibly random lecturer. He's hard to follow and kind of a wild card, but the material is SO basic. Lectures are very boring. If you do the readings, which are actually kind of interesting, you will get good grades on the tests. The last couple tests were take home and he gave us the answers!\n   Labs were actually interesting. Diane was my lab instructor and she is very enthusiastic, also an easy grader. I received 100% on almost all of my lab reports. Lab time, while very long, isn't terrible because we usually go off campus for field experiments.\n   Take this class if you want an easy A. \nWorkload:\nLecture: 8 tests worth 10% that are open book. 1 final worth 20% that is open book.\nLab: 3 lab reports, 1 final ppt presentation, in-class worksheets. Show up to lab and you will get an A/A+. \n"
        },
        {
            "course_name": "BC1001 Environmental Science",
            "review_date": "August 11, 2010",
            "review_content": "\nThis class is love or hate. I thought this clas was wonderful. We went on cool field trips, like learning about the geology of Morningside Heights, identifying flora and fauna in Riverside Park, and taking a boat out onto the Hudson River doing samples and collecting creatures. We did interesting lab work, although it was rather tedious -- but, really, do you expect anything else in a science lab? \nBower had a very interdisciplinary approach to the course, which is what I think attracts most people who may be intimidated by other science courses. Everything in the course related back, somehow, to New York City and/or the Hudson River. Art, for example, was an important aspect of the course. We were sent to museums (like the Met) to look at perceptions of nature from the Hudson River School painters. Yes, the scavenger hunts were very high-school-esque, but they made sure you saw the things he wanted you to see, and if you put a little effort in you would get a lot out of the trip.\nI actually liked doing the homework, partially because it was the directed busywork that it was. I had lots of difficult texts to read for other classes, and so I was grateful for the time I got to sit with a list of prepared questions and find the answers in the reading for environmental science. I was being productive while at the same time giving my mind a break.\nAnd just as the class is love or hate, you will either do really well or you will do terribly. And this class is NOT worth doing terribly in. If you do the (simple) readings and the worksheets you are asked to do (it's really not so much), you will get an A. Put a couple neurons of that smart brain of yours towards the class and you will succeed with flying colors.\nWorkload:\nSignificant, but nothing terrifically mentally challenging.\n"
        },
        {
            "course_name": "BC1001 Environmental Science",
            "review_date": "May 11, 2010",
            "review_content": "\nIf you go to Barnard and wanna fulfill that obnoxious sciencerequirement yet you SUCK at science, TAKE THIS CLASS! I am terrible at science yet still got an A both semesters. Yeah, there's a lot of busy work, but, um...ITS BUSY WORK. As in, reeeeally easy work. Bower is funny and weird so for that reason, his lectures are worth attending, but honestly, you don't even have to go to the lectures to get an A. Goodness, this was the easiest class ever. Also: DIANE ROCKS she is so sweet! The labs are kind of hard...but waaaay easier than any chem lab would ever be.\nWorkload:\na lotta busy work. all tests are OPEN NOTE/BOOK!!!!!!!!!!!!! including the final!!!!!\n"
        },
        {
            "course_name": "Alternative Energy Resources",
            "review_date": "April 14, 2010",
            "review_content": "\nHilarious class. This guy is a hilarious man. Really friendly and good-hearted. You will learn a lot by talking to him BUT this is not a real class. Seriously its not real at all. The prob sets are like HS chemistry and you read HS books. I knew pretty much everything he taught in the class and Im a poli sci major. Its just there to ease up your schedule and for an easy A. Honestly everyone who had half a brain in that class got an A and had fun doing it. The final he let us use a cheat sheet. It could not have been easier and more fun.\nHe doesnt even lecture really. once in a while he will just start being serious but its rare. He usually talks about his careers as MAYOR haha of Teaneck NJ or his son in the military...\nHE IS A REAL AMERICAN HERO.\nI like Dave Chappelle...\"Jokes and Jokes and JOKES!!!\"\nIf you want another joke take this class. \nWorkload:\nProb sets that we did the night before or 10 minutes before class. Bowers class is like christmas...saved my GPA last semester\n"
        },
        {
            "course_name": "BC1001 Environmental Science",
            "review_date": "April 13, 2010",
            "review_content": "\nThe review below sounds frustrated. Yes, it sucks sometimes, but it's so so sooo handleable. Lady below, did they not tell you studying is all about studying SMART and not just pushing your way through the impossible workload? My, my, I feel bad for people who haven't worked out the Format by now.\nLook, Ill put it plain and simple: If you care about your GPA and you just aren't a science person. TAKE. THIS. CLASS. Put some effort in, figure out the format (yes, there is a friggin' format- take notes and MAKE FRIENDS- trust me, cut the 'i don't want to help you' bullshit, you'll end up helping each other all the time), and you won't get anything lower than an A. I promise you this now. Well, unless, you're retarded like the lady below, who seems to be...a rare kind.\nOn the other hand, If you do care significantly about intellectual engagement and do have a knack with science- don't take this class. You'll be transferred right back into your high school classroom. By the way- Diane Dittrick (your lab instructor) is absolutely lovely. Ask her anything, I mean ANYTHING, even THE ANSWERS to your quiz, and she'll give them to you. She'll PRETEND for a second and get you to think for yourself, but she'll tell you -- she's the most wonderful, friendly, nice and frankly useless instructor I've ever met in my life. Absolutely amazing in terms of personality, quite laughable really.\nHonestly guys- once you've figured out how everything works, it'll be one of those classes that you just kind of shove on the side, and work on it for an hour before class, and smile secretly at the way too easy 4.0 GPA booster.\nWorkload:\nYes yes lots of work- mini quiz every other week in first half and mini quiz every week in second- HONESTLY, form an aliance, and work on it an hour before class every single week. Seriously. Who whines about an A+ in SCIENCE??? Busy work...SO BE IT!\n"
        },
        {
            "course_name": "BC1001 Environmental Science",
            "review_date": "March 08, 2010",
            "review_content": "\nI don't think I have ever hated a man more than I hate Peter Bower. This class and this man has not only made me reconsider my decision to come to Barnard, but has also made me ashamed that such a class could be taught at a college that regards itself as prestigious. Not only is Peter Bower's personality condescending, where he name-drops his friends such as George W. Bush, but the work of the class has absolutely no application to anything useful. All of the reviews that said this class was \"easy\" were clearly not taking the same class as me. Environmental Science I and II are without a doubt the worst classes. There is so much work that I want to kill myself. Yes, it's \"easy\" work, but there is SO much of it and it is work that you cannot get away with not doing because it's collected. In Environmental Science II, there are 12 tests not including the final exam plus three 10-15 page lab reports that are never well-explained so that you have no idea what to do when you write it. \nWorkload:\nSo much work. 12 tests plus a final, three 10-15 page lab reports. 1-2 take home tests per week to be due at the test. 1-3 chapters of reading and questions for every test. 1-2 take home assignments per lab. Quizzes during every lab that are usually not well-explained. Tedious assignments that may require you to walk around campus.\n"
        },
        {
            "course_name": "Intro to Environmental Science",
            "review_date": "December 29, 2009",
            "review_content": "\nI found this class to be a terribly boring waste of time. If youâ€™re in it for an easy fulfillment of the science requirement and you donâ€™t care about wasting your time with busywork, then perhaps itâ€™s for you. However, be warned: do not underestimate the annoyance and agony described in some other reviews. Many of my classmates, who would have been perfectly capable of acing his open-notes tests, decided to pass/fail the class because they were sick of wasting too much time on the busywork reading assignments (sometimes relevant, sometimes about good recipes for trout) and boring, irrelevant lab reports (one was a â€œfield journalâ€\u009d about our walk to look at and analyze the building composition of various structures in Morningside Heights- when we werenâ€™t even studying geology at all). Listening to lab instructor Diane Dittrickâ€™s voice for over two hours each week was enough to give me a headache for the rest of the day. This woman also consistently wasted our time and confused us each lab.  The lab topics, aside from the one memorable trip out on the Hudson in a research vessel, were almost always boring. Once we dissected owl pellets. Very sixth-grade science class. \nAs a humanities person who is interested in environmental topics, I thought this would be a great way to fulfill the lab requirement. However, I donâ€™t think I can bear to take another course in the environmental science department here, so I will have to content myself with reading books about environmental science and probably take two semesters of another science lab. I would rather pass/fail a difficult science course and learn something than headache my way through another semester of intro to environmental science. \n\nWorkload:\nBusy work. 8 open-note tests based on photocopied reading assignments. A few lab reports/ field journals, typically assigned well in advance but usually with conflicting details and disorganized data. \n"
        },
        {
            "course_name": "Field Methods in Environmental Science",
            "review_date": "November 30, 2009",
            "review_content": "\nThe best thing about this course (Field Methods) is the field trips.\nVery little content. Mostly about tree growth and deer-hunting. Don't go if you're queazy about seeing dead deer hung from a tree.\nThere must be a number of other field methods we could learn, but we'll never know from him. He doesn't respond to interested questions unless you happen to be  both pretty & sexy, then you have his entire attention.\nAlthough Bower unctions students to bring in drafts, he does not give them a second glance nor commentate on them. You're on your own there. He instead pairs you up with a much weaker student, and lets you carry the bulk of the load, and lends a deaf ear and ambiguous remarks to questions. \nDon't expect to learn all that much from this class. \nPretty much a hit & miss. \nGood Luck.\nWorkload:\nLight. one term paper - but don't let your weaker 'paper-mate' drag it to the last minute - will be a nightmare to do during exams - too much revision and back & forth needed then.\n"
        },
        {
            "course_name": "BC1001 Environmental Science",
            "review_date": "September 12, 2009",
            "review_content": "\nHow the heck can a prestigious college like Barnard have a professor who openly denies global warming's existence be in their environmental science department!? If you are looking for a class that is about what you might perceive Enviro to be about this is not the class you should take. You might imagine interesting lectures on how mass production is not environmentally sustainable, instead you will get mind numbingly retarded lectures on sailing in the Hudson and Bower's years at Yale with his good buddy George Bush. I honestly can't believe this guy has tenure. It blows my mind. You have to do hundreds of questions on the reading that are neither useful or tolerable, like \"Where was FDR buried?\" Do you know why Bower assigns \"literature\" and not text book reading? Because every Enviro text book talks about global warming and other things his politics disagree with. If you're still thinking about taking this class ask someone why he doesn't have office hours anymore and maybe that will persuade you. \nWorkload:\nBlow your brains out amount of busy work that will contribute nothing to your understanding of the environment but will take up all of your time so that you can't do work for other classes that actually matter. \n"
        },
        {
            "course_name": "BC1001 Environmental Science",
            "review_date": "January 09, 2009",
            "review_content": "\nHonestly?...The greatest class my first semester at Barnard. A lot of students like to bash him because he's a Republican, but don't judge a class (especially a science one) on the political leanings of the professor. The class has been amazing. You do learn a lot about a variety of subjects concerning the Hudson River. I think grading is pretty easy, and it's an amazing gpa booster. A lot of people complain the class is too easy. But, what? Do you want a class that grades harshly? You can learn a lot about the local ecosystem from this class, but it all depends on your committment to actually learn. The labs are enjoyable also. You rarely stay in the building.\nWorkload:\n8 Tests (most, if not all, open book, open note, open anything). But, it's all about preparation for the tests, which, to achieve the highest grades, can take hours and hours. One final exam. Open book, note also. Labs. Easy. Research Project. Easy again.\n"
        },
        {
            "course_name": "Environmental Bio",
            "review_date": "May 27, 2008",
            "review_content": "\nI highly recommend Professor Bower's Environmental Law class. While I can't speak for his other classes, judging from my experience here it looks like he would be a good professor to have in ANY class. He is no nonsense kind of guy. Many girls would ask ridiculous questions and he would respond with the answers phrased in such a way that was so simple it really made everyone realize just how idiotic some of their classmates are- This is done without outwardly showing his feelings of contempt. The class does move a little slowly, but we cover complicated intricate case law, so it makes sense to carry out the class the way he does. Professor Bower is not a hippie, but a rational man with respect for the environment. There is no other class I know of in which you will learn so much about how the U.S. legal system interacts with the environment.\nWorkload:\nModerate..definitely nothing a Columbia Student couldn't handle.\n"
        },
        {
            "course_name": "Environmental Science I",
            "review_date": "April 28, 2008",
            "review_content": "\nOk all these people bickering need to relax.  Bower's class is not bad at all. While there is a lot of busywork and often mind-numbing menial assignments, it is absolutely doable and an extremely easy way to complete your lab requirement as well as boost your GPA.  It is truly an easy A.  Some of the readings are actually quite interesting if you go into it with an open mind.  \nDon't take the class just for fun, because you reall will be wasting your time but if you're considering considering taking it to fulfill your lab requirement, DO NOT HESISTATE TO TAKE THIS CLASS. I rarely went to class and managed to do very well.  It is the easiest lab in the history of Barnard and Columbia.  In addition, sign-up for Terryanne as your lab instructor.  She is hilarious and the nicest person you will ever meet at Barnard.\nWorkload:\nfirst semester - 8 tests, open note. 4-5 field journals that are relatively short and fun.  second semester 12 tests open note.  two lab reports (10 pages & 4 pages).  ABSOLUTELY EASY!\n"
        },
        {
            "course_name": "Environmental Science",
            "review_date": "March 09, 2008",
            "review_content": "\nThe worst class in the history of mankind. You will literally feel as though you have been transported back to your fourth grade science class, complete with fieldtrips and mindnumbingly boring tasks that go on for so long you will feel your brain melting. There are weekly tests with take-home portions because that is the only way the Professor can get people to come to his god-awful class. Horrible. Absolutely horrendous.\nWorkload:\nendless amounts of busy work. not worth the pain.\n"
        },
        {
            "course_name": "Environmental Science",
            "review_date": "January 08, 2008",
            "review_content": "\nThis is a great class, and I highly recommend it! He moves at a great pace and has a fabulous teaching style.  The workload isn't terrible either- 8 open-book tests and a final, homework takes time, but is never terribly difficult if you put in the effort.\nWorkload:\nMedium amount of work- homework each week (takes an hour or two), plus 8 tests and a final.\n"
        },
        {
            "course_name": "Environmental Science",
            "review_date": "October 20, 2007",
            "review_content": "\nThis class is undoubtedly the WORST CLASS I HAVE EVER TAKEN.\nI registered for it, even after having read the terrible culpa reviews already written, thinking \"how bad can it be\" especially considering the fact that it said that the work was just lots of busy work and that lectures could be skipped. the work is indeed just busy work but you end up feeling completely degraded and like an idiot when you are asked to color in a map as homework, more importantly this homework is extremely time consuming. \nThe quizes are ridiculous and very furstrating. The lab part of the class isnt that bad, however be aware that you will have to get a bit dirtier than youd expect, digging up trees in riverside park, dissecting owl pellets to extract skeletons of little animals from the pellets to then stick them back together to recreate the animals skeleton.\nIn summary, you will have to take a quiz every other week (although it is open book it is still hard to get full marks, especially if you dont attend lectures), do ridiculous homeworks that are time consuming and utterly pointless, and you will not learn a thing about environmental science.\nNot to mention the professor, who is possibly the most obnoxious professor i have encountered here so far. Full of himself, he spends his time discussing church, George Bush (who he proudly went to college with), and hands out millions of handouts (sometimes not even double sides?!?!) which all seems contradictory for an ENVIRONMENTAL SCIENCE teacher. \nDO NOT TAKE THIS CLASS\nalso, you will be stuck with it for 2 semesters if youre trying to fulfill the science requirement, and you cant pass/fail it for it to fulfill the requirement.\nWorkload:\nlots of busy work that while being ridiculously stupid takes up a long time. an open book quiz every other week, lab reports and journals weekly, a final.\n"
        },
        {
            "course_name": "Environmental Science",
            "review_date": "October 20, 2007",
            "review_content": "\nThis class is undoubtedly the WORST CLASS I HAVE EVER TAKEN.\nI registered for it, even after having read the terrible culpa reviews already written, thinking \"how bad can it be\" especially considering the fact that it said that the work was just lots of busy work and that lectures could be skipped. the work is indeed just busy work but you end up feeling completely degraded and like an idiot when you are asked to color in a map as homework, more importantly this homework is extremely time consuming. \nThe quizes are ridiculous and very furstrating. The lab part of the class isnt that bad, however be aware that you will have to get a bit dirtier than youd expect, digging up trees in riverside park, dissecting owl pellets to extract skeletons of little animals from the pellets to then stick them back together to recreate the animals skeleton.\nIn summary, you will have to take a quiz every other week (although it is open book it is still hard to get full marks, especially if you dont attend lectures), do ridiculous homeworks that are time consuming and utterly pointless, and you will not learn a thing about environmental science.\nNot to mention the professor, who is possibly the most obnoxious professor i have encountered here so far. Full of himself, he spends his time discussing church, George Bush (who he proudly went to college with), and hands out millions of handouts (sometimes not even double sides?!?!) which all seems contradictory for an ENVIRONMENTAL SCIENCE teacher. \nDO NOT TAKE THIS CLASS\nalso, you will be stuck with it for 2 semesters if youre trying to fulfill the science requirement, and you cant pass/fail it for it to fulfill the requirement.\nWorkload:\nlots of busy work that while being ridiculously stupid takes up a long time. an open book quiz every other week, lab reports and journals weekly, a final.\n"
        },
        {
            "course_name": "Environmental Science",
            "review_date": "October 20, 2007",
            "review_content": "\nThis class is undoubtedly the WORST CLASS I HAVE EVER TAKEN.\nI registered for it, even after having read the terrible culpa reviews already written, thinking \"how bad can it be\" especially considering the fact that it said that the work was just lots of busy work and that lectures could be skipped. the work is indeed just busy work but you end up feeling completely degraded and like an idiot when you are asked to color in a map as homework, more importantly this homework is extremely time consuming. \nThe quizes are ridiculous and very furstrating. The lab part of the class isnt that bad, however be aware that you will have to get a bit dirtier than youd expect, digging up trees in riverside park, dissecting owl pellets to extract skeletons of little animals from the pellets to then stick them back together to recreate the animals skeleton.\nIn summary, you will have to take a quiz every other week (although it is open book it is still hard to get full marks, especially if you dont attend lectures), do ridiculous homeworks that are time consuming and utterly pointless, and you will not learn a thing about environmental science.\nNot to mention the professor, who is possibly the most obnoxious professor i have encountered here so far. Full of himself, he spends his time discussing church, George Bush (who he proudly went to college with), and hands out millions of handouts (sometimes not even double sides?!?!) which all seems contradictory for an ENVIRONMENTAL SCIENCE teacher. \nDO NOT TAKE THIS CLASS\nalso, you will be stuck with it for 2 semesters if youre trying to fulfill the science requirement, and you cant pass/fail it for it to fulfill the requirement.\nWorkload:\nlots of busy work that while being ridiculously stupid takes up a long time. an open book quiz every other week, lab reports and journals weekly, a final.\n"
        },
        {
            "course_name": "Earth & Environmental Science 1",
            "review_date": "December 20, 2006",
            "review_content": "\nI do not know where to start. First, I strongly advise you take this class to fill your science requirement. It is by far and away the easiest. I took this class to fill a science requirement, and I really thought I was going to shoot myself. Which brings me to my next point..I stopped attending class all together by the 2nd month. It was completely useless. His weekly quizzes become a joke, you are bored out of your mind during class, and the material is so unnecessarily repetative and nothing to do with the environment outside of NY. If you want to learn about the Hudson River, then this is for you. His teaching method is boring sheerly based off of the fact that he talks about irrelavent things & plays music all the time. \nYou will fall asleep. No doubt. Half the class ended up taking the class P/D/F because the work is so time consuming..NOT because it is hard..because it is ALL BUSY WORK ALL THE TIME. You get nothing done when you look back on your semester. For an environmental teacher, he handed out more packets of paper than ANY class I've EVER taken. So much for saving trees. His quizzes are condescending because they are literally out of the book, and the way that he teaches is ridiculous. Think 7th Grade science class with more work just so it can be considered college level. I could not understand the grading technique at all, even though he tries to map it out. He seems to care more about his research as a scientist then this ridiculous class...but the Hudson River Report is vital to your grade, that's about all I got out of this. He's nice though, have to give him that. Take the class. Don't go to lecture. The work is ridiculous. So...all in all, perfect for a requirement filler!\nWorkload:\nEasy. Weekly quizzes (questions about the reading are given to you AND it's OPEN BOOK), Hudson River Report (don't leave it til the last minute), and a final (just like a quiz but with an extra page)..and some map quizzes\n"
        },
        {
            "course_name": "Intro to Environmental Science",
            "review_date": "July 09, 2006",
            "review_content": "\nI took both semesters as my science/lab requirement, and both semesters this class was unbelievably frustrating. \nBowerÂ’s lectures have no focus and wander all over. \nEverything was covered very superficially, and I donÂ’t feel that I learned anything useful/or important Â– I just picked up useless pieces of trivia about the Hudson River. But even worse than the lectures are the labs. First semester the labs were just boring. Second semester we were supposed to investigate pollution in a virtual world. We had to have serious discussions about a made-up town and learned absolutely nothing. Lab (let alone lecture) was a complete and utter waste of three hours each week.\nWorkload:\nA tremendous amount of busywork. Fair of reading (mostly non-fiction books, not scientific texts); worksheets; weekly tests on reading (open note), a final project (easy but time-consuming), final (not hard)\n"
        },
        {
            "course_name": "Environmental Science, Shorelines and Streams, Environmental Law",
            "review_date": "January 17, 2006",
            "review_content": "\nUnfortunately, this course has received the reputation of being the P/D/F class to take to get rid of the science requirement.  Thus, when students take this course for an extra nap, they realize that yes, there is actually some work to be done.  The truth is, the class is interesting and the work is interesting -- if you want to learn things.  Yes, it is time consuming, but personally I would rather things be time consuming and easy than time consuming and hard.  No intro science course is a totally easy A, but this is as close as it comes.  If you like environmental science, then you will see that bower makes it as easy as possible to do well.  He repeats everything you need to know several times, and he says it exactly in the form you need to know it.  The reading is great, and not dense, and the questions he asks are straight out of the book. He specifically gives a lot of work so that each assignment has little value on its own and nothing screws you over.  There are many opportunities to do well. But, if you are looking for the class that is neither long nor time consuming, then perhaps consider high school. :)\n"
        },
        {
            "course_name": "Intro to Environmental Science",
            "review_date": "December 15, 2005",
            "review_content": "\n                   DONÂ’T TAKE THIS CLASS IT ISNT EVEN EASY.\nOk so if you read the twenty other horrible reviews but are still thinking about taking this class because its easyÂ…DONÂ’T.  While it is true that all you do is busy work and you wonÂ’t have to synthesis any information or even think, it takes A LOT OF TIME.  Every week I spent an ENORMOUS amount of time doing brainless work for this class.  You canÂ’t just make it up either because all the answers need to be verbatim from the reading.  This is not even including the 25 page lab report. NOT WORTH IT.  Additionally, I found the reading extremely offensive and chauvinistic, just like Bower.  All of our texts were written by backwards men from the 1960Â’s, and they arenÂ’t even environmentally accurate anymore.  Ok here is an example of a passage from Farley MohwatÂ’s Never Cry Wolf (this is about how a wolf in the artic yelped) Â“It was a high-pitched snarl of shock and outrage-not entirely unlike the sound I have heard an angry woman make when, in a crowded subway car, someone pinched her bottom.Â”(170)\nThe book is filled with lots more wonderful scientific observationÂ…\n\n"
        },
        {
            "course_name": "Environmental Science I",
            "review_date": "April 03, 2005",
            "review_content": "\nWell now that the second semester is winding down I can give an educated review....A lot of people taking this class, including myself, were in it for the Gen Ed. requirement, not for the science. In retrospect, Bio might have been a better choice. \nThe first semester was somewhat interesting. The labs were for the most part pointless, but learning about the Hudson River from many different aspects had its advantages. The excessive reading of \"The River\" was completely unnecessary: pure, unadulterated busy work. Also a little too much info about fish. I got an A first semester, so I really shouldn't complain too much. However, the class presents so many opportunities for students to be annoyed beyond belief that it's hard to be appreciative of the good grade. \nThe second semester has been rough. We are currently dealing with a fake town full of fake people, trying to determine if a fake factory polluted the fake ground. You tend to feel delusional when you realize you're having a serious discussion about a completely fictional scenario. (The people have names like D.S. Gruntl and Ivana Lede. It's pretty sad.) We are in the midst of this report about the whole fake town (it's too weird to explain to those who haven't experienced it firsthand), which has presented the opportunity for an entire weekend's (in my case) worth of busy work. In essence, we have to reword some of the 68794854 documents that we have been given and make our own \"official Environmental Site Assessment.\" We also have had a lot of reading, but it's been on A Civil Action, which is an amazing book. The subject material has been scattered as well. We go over chemistry, groundwater movement, reading comprehension (he needlessly summarizes A Civil Action) and whatever else pops into his head over the course of one class. The labs have been worse this semester as well. We have had to methodically draw and color our own maps, which takes basically all of lab time plus a lot of free time as well. And it's coloring, which is fun for about twenty minutes, not the 2 hours that's necessary to finish.  \nBower himself is not a great professor. He's intelligent enough, but he doesn't keep track of his lectures, apparently; he will repeat on Wednesday basically an entire lecture that he has given on Monday. It's a huge waste of students' time. I've had to fight back the urge to scream more than a few times. The class is a weird mix of people who love him/environmental science and people who hate them both. This leads to high tension within the class; people who are interested enough to ask questions are met with strong opposition by the people who just want the class to be over. I was somewhere in the middle; I found the subject matter at times interesting, but the manner in which it was taught could be vastly improved if we could apply our scientific knowledge to actual real life (and all of the current issues in environmental science) instead of a fake factory. Bower's habit of repetition is also rough, especially now that the semester is almost over. It's gotten old to the point of ignorance; he makes it really easy to not pay attention to him, because you know that you're not missing anything. He's also been really cranky this semester, I think because he got knee surgery. He won't let people walk in front of him (arrogant!) and has weird little routines, like officially starting the class by putting a flag in a pot. \nOn a side note- Diane is an excellent lab instructor. She tends to be a little unfocused, but she genuinely is happy to see everyone and her smile is welcome compared to Bower's surly mug. She truly appreciates the amount of effort that her students put into their work, and she is happy to help you with any questions. She also helped lighten our workload for this final report slightly; she delivers suggestions from the students to Bower and sometimes gets him to ease off on the assignments. \nI can't say how other science classes are, but if you need to fulfill your science requirement, then Environmental Science will make you frustrated, stressed out, pissed off, and in the end you'll be done. \nWorkload:\nWeekly quizzes (both semesters); 25 page report on the Hudson River (Fall) and 10-15 page report (Spring), which also includes many hand-drawn maps; Tons of reading, which you need to at least skim for the quizzes; LONG labs; and in general a weird variety of homework that might confuse you but isn't too difficult\n"
        },
        {
            "course_name": "EESC 3018: Weapons of Mass Destruction ",
            "review_date": "January 18, 2005",
            "review_content": "\n(Class co-taught with Paul Richards)\nAbout the profs:\nThis was a fantastic class.  Professor Bower gave great lectures and really engaged the class well.  It was interesting to hear about his experience as an environmental consultant, as well as his work/visits to various sites, like Chernobyl. I know people find him pompous in Intro classes, but this was not my experience in this class at all.\n Professor Richards was less engaging, and had a tendency to remain aloof, especially during classes when he was not instructing.  A few times he fell asleep during class or otherwise zoned out, so when students asked pertinent questions and Bower asked for Richards' input, Richards had no idea what the question was.  To cover up his embarassment, he just gabbed about something totally unrelated . . . it was infuriating.  I also found his lectures rather boring, although it was apparent that he was very interested in the subject and wanted the class to ask questions, etc.  I hear he's teaching the class himself now, so I will let you all know that he does have redeeming qualities, too. (All is not lost!) \nFirst, Richards is a brilliant scientist and works on cutting-edge seismology research.  I attended one of his lectures about his own research at the Earth Institute last semester which was fascinating.  Also, if you ask questions or talk to him, he really cares about what you say and remembers who you are-- he even sometimes brings articles to class for individual students relevant to their independent projects, etc.  So, I'd say he's a very kind and capable professor, just a bit uncomfortable at first, and not used to teaching. (Last semester, I believe, was his first time teaching in a long time, if not the first time ever).\nAbout the class:\nThis class was nearly entirely dedicated to nuclear weapons, proliferation, and policy.  We did discuss biological weapons and chemical weapons, but my memory was that this was only 1-2 classes during the whole semester.  That said, the class content is great-- it provides 1. a crash course in particle physics (atomic structure, particle decay, etc., basically no math/formulas); 2. a critical understanding of the nuclear fuel cycle; 3. historical context, e.g. Hiroshima, Chernobyl,terrorist risks to power plants, etc.; 4. policy angle- knowledge of political climate and proliferation; and 5. places the issue on the front burner-- good preparation for students pursuing further study or who plan to become involved in policy or leadership positions in the future.\nI went into this class with nothing more than curiosity (and high school envi sci and physics) and came away with a great appreciation for the severity of the current nuclear situation and the fragility of our existence.  I even declared a specialization in envi sci after taking this class.\nThe workload is lengthy at times, but entirely fair.  I would say it is an easy B+/A- and for conscientious students, you will earn a solid-- if not high-- A.  \nAttendance: Not taken. Also, FYI: I am one of those people who does not attend meetings of bad lecture classes. So it does mean something when I say I went to every one of these. \nWorkload:\nproblem sets, fair and from class notes. in-class mid term and final, also utterly fair and I think we were allowed to use notes or a cheat sheet on both; powerpoint presentation on nuclear topic; readings include Hersey's Hiroshima, and tons of interesting articles from the NY Times and other sources. Buy the Nuclides and Isotopes book-- it's cool and pretty to look at, and useful to have as an educated human being.\nTake this class. You will not regret it.\n"
        },
        {
            "course_name": "Environmental Science I",
            "review_date": "January 01, 2005",
            "review_content": "\na fairly easy class, not a lot of work, but not very interesting at all.  every lecture is on something random and has no relationship to the lecture the day before.  the grading is really picky, they take of points for details that weren't even asked for in the question.  he's also completely unavailable for questions or help.  beware of the hudson river report, he bumps up the length every semester, so far up to 25 pages long.\nWorkload:\nlots of short readings, weekly tests, severely long semester end report\n"
        },
        {
            "course_name": "Intro to Environmental Science",
            "review_date": "December 29, 2004",
            "review_content": "\nI cannot remember a time when I didn't fall asleep during class. The course was annoying and time consuming. All this course revolves around was tedious work. I don't care about the life cycles of the shad or the bass. If I wanted to know, I would look it up. I want to know more about actual environmental issues. Professor Bower himself is nice enough, but his course was so boring.  We got so many handouts, maps, and other paper materials that I feel like our class killed a whole forest during one semester.\nWorkload:\nTedious reading and copying of information from a printed source onto a worksheet.\n"
        },
        {
            "course_name": "Intro to Environmental Science",
            "review_date": "December 26, 2004",
            "review_content": "\nIt's really disheartening to see my fellow classmates writing such heinous reviews for this class.  This is an intro to ENVIRONMENTAL SCIENCE class, what do you EXPECT to learn?  How much depth can you really cover in such a science class- it is an intro (oh mind, the directly- previous 3-4 reviews were about 1st semester ONLY don't forget-- i am good friends w/one of the head T.A.'s who has taken the course both semesters last yr & was informed by her, that during the 2nd semester, you learn a lot more about environmental policy & environ. preservation details, etc. =  more interesting).  Contrary to other people's heated & fuming rants about how much of a waste this class was, I found myself learning A LOT about the wildlife (wolves~ so much info about them!), the ecosystems & the vital ecological cycles in our environment.  The salt and freshwater lectures even helped me to understand the science behind that movie- The Day After Tomorrow.  Don't expect to come out of the FIRST semester of this class with a boundless amount of newly-acquired scientific theories & facts; instead, expect to come out of it a bit peev'd at how much you've had to read, but also satisified with how much more you DO know about owls, wolves, caribou, wildlife, estuarines, salt/freshwater balance, phases of the moon, and the Hudson River.  All-in-all, this is a course about how interconnected everything is in the environment- if we harm one tiny part of our environment, it may have detrimental effects on a number of other organisms/environmental cycles.  Also, I really appreciated the MET visits & the American Museum of Natural History- those museums are incredible & priceless to our society at large.  \nWorkload:\nNot hard but expect to spend a few hrs a night or two before the small weekly-tests to simply read & mark down which pg the answer to each practice question is found on.  It's really simple guys, but because there is a lot to read, you DO learn.  You put  in the time (all you need is a bit of time), you'll definitely be able to do exceptionally well in that class.  \n"
        },
        {
            "course_name": "Environmental Science",
            "review_date": "December 16, 2004",
            "review_content": "\nThis class is quite frustrating. The work isn't difficult, but it's time-consuming; the problem is that it does not necessarily pay off on quizzes... you basically have to skim the packets he gives you, find the sentence he's looking for, and copy it down. This isn't hard, just irritating, esp when points are taken off for really minor things. Labs are irrelevant, I really don't know why we did half of the things we did. If you don't mind LOTS of busy work, it's an easy class\nWorkload:\neasy busy work that wastes time that could be spent on more productive classes--- weekly quizzes, one 25-page lab report due at the end\n"
        },
        {
            "course_name": "Intro to Environmental Science",
            "review_date": "December 11, 2004",
            "review_content": "\n    I second the review directly previous; this class is absolutely unequivocally terrible. I've never written a CULPA review before now, but I feel it'd be irresponsible not to after having taken this class. F**KING AWFUL. God how I loathe it with the fire of ten hundred thousand suns. .no, it really is that bad. A black hole of pedagogical suck, Bower is unfocused, indifferent, and rude, and yes--his lame attempts at wit really really grate. I'm so glad to know someone else actually finds him unfunny. 'Depressing beast,' as another reviewer described him, is just about perfect. His lecturing 'style' is disorganized and unproductive; his free-associative lectures feel more like an excuse to avoid preparing something to deliver to the class than 'threads' as he so artfully calls them. Instead of teaching, he serves up either a totally redundant rehearsal of the readings which adds nothing new to your understanding of them (not that there's much to get to begin with) or rattles off a bunch of vaguely related material in a manner which makes it all seem somehow even more totally irrelevant, with some anecdotes and fucking terrible jokes tossed in for piquancy . . The course requirements are as muddled as his lectures. I was delighted to learn two weeks before the end of the semester that the 'Hudson River Report' due at the last class was to be 25 pages long. .which is just a little outrageous for an intro class like this one--and he's been pretty cagey, when it comes down to it, about what exactly is supposed to be included in it. And then of course, there are all the annoying little quizzes and weekly tests that you can't make up without a pink slip from your dean, and the labs--one of which involved walking down to a playground and listening to our lab instructor read us a CHILDREN'S BOOK about a lighthouse. Oh no, I'm not kidding. Yeah the labs are pointless too. .reconstructing vole skeletons is pretty cool though. .and to her credit Diane is a really great lab instructor who did her best to represent on the students' behalf and whatnot, but evidently in vain since Bower doesn't seem to care about or listen to anyone but his own well-distended ego. . .but yeah, this class, if you dare take it, will just confound you with its shittiness, so don't do it unless you have to (god forbid). Really, it boggles the mind. Total waste of time and money, and totally inexcusable, really, as an offering at any accredited institution--and Bower is definitely the weak link here. The material is interesting, sure, but he kills it dead. HATE.\nWorkload:\nNothing difficult, but it's the sheer volume and the sheer inanity of it all. .About fifteen pounds of hand-out readings over the semester that you don't need to read, open-note weekly short tests that require you to copy the answer right from the text to get full credit, map work, stupid independent trip to the Met, stupid independent trip to the AMNH, laughable 25-page-'not including illustrations, maps, photos, and tables'-Hudson River Report, and a final which covers practically nothing discussed throughout the semester and which will apparently focus entirely on the book we've been reading for about a week now.\n"
        },
        {
            "course_name": "Environmental Science",
            "review_date": "November 28, 2004",
            "review_content": "\nThis is honestly the worst class i have ever taken. Bower is unorganized, rude, and quite fond of his not-at-all funny jokes. He demeans students when they ask questions and his lectures are a huge waste of time. The work includes reading a boring book about the hudson river and answering questions that you could have handled in fifth grade. the tests are then the exact same questions--and they're open-note tests. but beware--you will have to fight for every point because if your answer isn't worded exactly like the book, you'll lose points--bower wants you to plagarize. and don't get me started on the labs...or the hundreds of handouts you'll get throughout the semester. you'd think bower, as an environmentalist, would save paper. wrong. don't take this class!!!\nWorkload:\nweekly tests, but you just copy right from the handouts, one 25 page lab report, one open-notes final\n"
        },
        {
            "course_name": "Environmental Science I",
            "review_date": "November 17, 2004",
            "review_content": "\nProfessor Bower is one funny man -- that's all you need to know.  Because he has charisma, character, and a sense of humor, he made science interesting for me.  He knows his stuff about the Hudson, let me tell you!  He's a great guy, and he plays really great music at the beginning of every class.  Lots of reading, but I barely read the material -- he just ends up going through it again in class anyway.\nThe Lab sections are long and really boring, but try to get Diane, she's real nice.  \nWorkload:\nOne weekly test based on ONE chapter he gives the previous week, a power point presentation (and to make it easier for us,  instead of it as a requirement, he decided to make it optional), a final report based on the labs (12 total)\n"
        },
        {
            "course_name": "Intro. to Envi. Sci.",
            "review_date": "May 20, 2004",
            "review_content": "\nPeter Bower's idea of a useful class period is essentially read-aloud, from the chapters you already read for homework. Either that or he teaches about wildly unrelated subjects that are interesting on a whim, but add absolutely nothing to your general knowledge of science. He hands out too many handouts that you never use (funny, an envi. professor killing trees) and is also quite a hypocrite. This class is an excellent waste of time, especially if you don't feel like learning anything useful (except about music, which he talks at great length about). The class is awful.\nWorkload:\nNonexistent first semester, fairly intensive in the 2nd.\n"
        },
        {
            "course_name": "Environmental Science",
            "review_date": "May 02, 2004",
            "review_content": "\nIf you passed 3rd grade, you will do just fine in this class.  If you want a class that stimulates even one brain cell, then this is not the class for you.  I'm almost positive that I could have covered the material for both semesters of environmental science in one week.  He hands out a billion handouts, most of which he never talks about, and most of which are completely off-topic.  If you feel that you absolutely must take this class, then get ready to hear many side-tracked and often innapropriate comments, including how he went to yale and was best buds with \"dubya,\" who he claims was a \"classy guy,\" about all the crazy antics thant went on while the mayor of teaneck, and various stories about his disfunctional family and his wife (be prepared for a little too much information on that one).  This class is a joke and a waste of tuition money, and would be better if taught by rabid monkeys.\nWorkload:\nAre you kidding? I had more work in kindergarden. The tests and finals are all open note. You could take this class drunk and cracked out and still get an A.\n"
        },
        {
            "course_name": "BC3023 The Hudson River Environment",
            "review_date": "January 21, 2004",
            "review_content": "\nPeter Bower is a fantastic teacher. He has an amazing passion for everything he talks about, which rubs off on everyone in the class. Don't think you want to spend three classes talking about the blue crab? You will with Bower, and you'll be dissapointed when its over. I remember more of what I learned in this class than any other I took that semester. There is so much about Manhattan, and specifically Morningside Heights, that I never would have known without this course, and gave me such a better understanding of the area in which I live. Also, he takes the class on impormptu walking tours on nice days.\nI took the class to fill the category B Urban Studies requirement, but this class has single-handedly convinced me to concentrate in Environmental Sciences. That's how good Bower is.\nWorkload:\nThere's really no work at all. Some scattered quizzes (only one or two hard map quizzes), some easy assignments to read a packet and answer questions. One easy museum assignment that took a ridiculous 4 hours at the Met. One term project, which can basically be about whatever you want in whatever format you want, which he'll accept at the end of finals. Simple as hell midterm and final, mostly open notes.\n"
        },
        {
            "course_name": "BC3023 The Hudson River Environment",
            "review_date": "January 21, 2004",
            "review_content": "\nPeter Bower is a fantastic teacher. He has an amazing passion for everything he talks about, which rubs off on everyone in the class. Don't think you want to spend three classes talking about the blue crab? You will with Bower, and you'll be dissapointed when its over. I remember more of what I learned in this class than any other I took that semester. There is so much about Manhattan, and specifically Morningside Heights, that I never would have known without this course, and gave me such a better understanding of the area in which I live. Also, he takes the class on impormptu walking tours on nice days.\nI took the class to fill the category B Urban Studies requirement, but this class has single-handedly convinced me to concentrate in Environmental Sciences. That's how good Bower is.\nWorkload:\nThere's really no work at all. Some scattered quizzes (only one or two hard map quizzes), some easy assignments to read a packet and answer questions. One easy museum assignment that took a ridiculous 4 hours at the Met. One term project, which can basically be about whatever you want in whatever format you want, which he'll accept at the end of finals. Simple as hell midterm and final, mostly open notes.\n"
        },
        {
            "course_name": "Environmental Science",
            "review_date": "January 04, 2004",
            "review_content": "\nI took Env Sci + Lab to fulfill the lab requirement and was pleasantly surprised to find that i really enjoyed that class. Although we always bitched about having weekly tests during lecture and weekly quizzes during lab, Prof. Bower is really a fantastic lecturer despite his reputation! This class was the first time in college that i read a book cover to cover and found it truly interesting (and i'm one of those people who can't survive without sparknotes). This way was really the best way to fulfill the science requirement and i'm even considering majoring/minoring in env science. Bower is really interested in nuclear weapons/wastes and spends the last 2 weeks of the semester on it (it also makes up 1/2 of the final)\nWorkload:\nVery manageable, weekly tests and weekly quizzes, hudson river paper, final. I highly recommend this professor\n"
        },
        {
            "course_name": "Environmental Science",
            "review_date": "December 19, 2003",
            "review_content": "\nIn my opinion, Professor Bower is patronizing, obnoxious, and unfocused. He didn't hand out a syllabus at the beginning of the course and seemed to talk about whatever he wanted.  He handed out several pounds of handouts every class, most of which he never mentioned, much less taught the material. Assignments in lecture were ludicrous--two mandatory trips to the American Natural History Museum, where we spent 2-3 hours drawing pictures of red-backed voles and tracing maps of Alaska for no apparent reason. The end-of-term Hudson River lab report made kindergarten connect-the-dots look challenging. There is NO curriculum for this course. Labs included using colored pencils to color globes and food chains, dissecting owl pellets, and two trips to the river which consisted of walked to 125th Street and back. I would not recommend this class to anyone under any circumstances. I learned nothing, wasted six hours a week in lecture and lab, and have five inches worth of useless photocopies to show for it.\nWorkload:\nOne novel, weekly \"tests\" (open book; no material to test on), a final exam that includes drawing. Lab work generally completed within the period.\n"
        },
        {
            "course_name": "intro to environmental science I & II",
            "review_date": "August 08, 2003",
            "review_content": "\nhe's a nice guy. he means well. but can be a irritating at times. his class is relatively easy if you're looking to fufil a science requirement and aren't searching for a  psychotic quantum physics level. the math that's done is tolerablely easy enough (basic algebra) and yet math happens infrequently. formulas don't need to be memorized. but he's strangely weird about plagerism though. he accused the whole class of cheating and threatened to take action. but then never brought it up again. labs are pretty easy too. the lab prof's are fabulous. try to get diane ! she's extremely helpful and generous grade wise\nWorkload:\nbi-weekly quizzes for esI, less frequent quizzes for esII, museum trips w/ museum packets to do, midterm, final. \n"
        },
        {
            "course_name": "Intro to Environmental Science",
            "review_date": "April 21, 2003",
            "review_content": "\nGoing to this class is like crawling through the NYC sewers.  Every now and then you might learn something, or find something cool, but you mostly feel rancid and disgusted.  Whomever wrote the review proclaiming that \"Bower is power\" must be one of the students who got a little too friendly with this depressing beast of a professor (you may note that he no longer has office hours).  The lectures do sometimes cover interesting material, but are drained by Bower's mid-life-self-hatred and simultaneous/unremitting condescension.  By the way, the material is all based on divulging the myriad of ways in which we are going to die (chemical poisoning, pesticides, meteors, nukes, etc.) and on that consideration, I suppose Bower's lecture enthusiasm equals the optimism of the material.  I will concede, however, that students interested in psychology may find amusement in the psychoanalysis of Bower, which could very well be a case study, if not a class on its own.  The first semester of lab involves tracking groundwater contamination on a SimCity-esque computer game and plotting points on maps.  Second semester involves picking apart owl pellets, pasting mouse skeletons on construction paper, and yes, coloring a diagram to demonstrate your knowledge of the food chain.  If you passed the third grade, you will excell in these activities.  If you consider yourself even barely more intelligent than a fourth grader, you will want to be highly sedated before each lab section.  Overall, if you are looking for an easy class to complete your science requirement, then this class definitley offers that...that is, if you are willing to endure patronizing lectures and mind-numbing labs.  However, if you have a genuine desire to learn or be challenged, value your mental health and maybe even your parents' money, or simply prefer professors who can differentiate between daily life and a nightmare... take something else.\nWorkload:\nlight reading, periodic tests (often with notes/open book), labs sometimes require consciousness\n"
        },
        {
            "course_name": "Waste Management",
            "review_date": "December 10, 2002",
            "review_content": "\nProfessor Bower is a good professor. I really enjoyed this class. You do not need a background in environmental science to do well here. The class is 2/3 on why nuclear power is bad and 1/3 on why incinerating municipal solid waste is bad. You don't need to do very much reading. He basically spoonfeeds you everything you need to know in class. The tests are pretty easy if you went to class and took decent notes.\nWorkload:\nThree exams (the non-cumulative final is the last of these) and three problem sets (these are about 4 pages typed each - overall, these are fairly easy).\n"
        },
        {
            "course_name": "Field Methods in Environmental Science",
            "review_date": "December 06, 2002",
            "review_content": "\nHmm...In my experience, most professors are full of themselves--as are most students at this school, so Bower is really not such an anomaly in that respect. Where he does prove himself exceptional is in pedagogical technique and his philosophy about teaching. If you want a professor who will go as far as it takes to make sure that you know whats going on, produce quality work, and take something valuable away from a class, I cannot recommend Bower highly enough. He goes the extra mile--literally--by driving the class on numerous field trips (occuring about every other week) to the Black Rock Forest or elsewhere in the region. Who wouldn't seize this opportunity to get out of the city, into the woods, and learn what people in this field are really doing by doing it with them. Bower is at least humble enough to let numerous others take the wheel as guest lecturers (who were all great, incidentally). The class was extremely fun, and a refreshing departure from the drudgery we normally must endure. If Bower actually thought that grades were meaningful, I'd give this course an A+...as it is, I'll just say: You're missing out if you don't take this class. \nWorkload:\nRelatively light--one large scientific report, 2 smaller papers, negligible amount of reading. But be prepared to go to every class--you and the Prof. will make each other suffer if you're not committed to it. Bower gives you every opportunity to do well, as he expects to read and comment on multiple drafts of your report. If you're all caught up on grades, snap out of it--You won't get any of your final-draft work returned to you unless it sucks.\n"
        },
        {
            "course_name": "Intro to Environmental Science, Environmental Law",
            "review_date": "September 11, 2002",
            "review_content": "\nYes, he is full of himself, but he is generally approachable, unless you catch him on a bad day. His lectures are often very interesting, especially in intro. He organizes everything very carefully and tells you exactly what you have to know for every test. Going to museums to fill out packets can take FOREVER, but it's stil worth it. This is, by far, the easiest way to get through the science requirement, and you might even find yourself enjoying it. Lab is very easy first semester, almost everyone got an A. Second semester is a little tougher, but still very manageable. If you have any math ability at all then you will do fine in intro. As for the law class, there is a lot of tedious work which requires a long time in the law library and you won't really learn that much about the law, but it's not hard to get an A. Exams were relatively easy.\nWorkload:\nFor intro: very light, you don't even have to do all the reading (which isn't that much anyways.) For law: medium, more tedious than it is difficult. \n"
        },
        {
            "course_name": "Environmental Law and Intro to Environmental Science (1001 & 1002)",
            "review_date": "July 10, 2002",
            "review_content": "\nOk, I will agree with all of the above reviews that the man is full of himself. To show us what a subpoena looked like, he even brought in one that he got as mayor of \"a small town in New Jersey, \" which he mentioned every other second. But, bottom line, he is a really good teacher and is one of the most fair professors I have ever had. When preparing us for tests, he told us exactly what we needed to know, and there were never any surprises. We got to use \"cheat sheets\" frequently, which made things a lot less stressful. He clearly outlines what he expects from you, and you can even hand back tests and papers for reevaluation if you think there is a problem. Overall, although his ego is huge, he's a very nice guy and you will definitely do well, especially if he actually knows who you are (this is hard in intro, but the law class is smaller so he'll definitely know who you are!)!\nWorkload:\nIntro: a few tests (first semester we had small tests every week and a non-cumulative final, second semester we had 4 tests and the last one was a non-cumulative final). Lab is pretty much a joke, because in 1st semester you have one lab for the whole year that is really long but not hard at all. Second semester you have no lab reports but you have to spend your lifetime in the Museum of Natural History drawing taxidermied wolves. Law: midterm, non-cumulative final, and some \"exercises,\" which were basically short papers.\n"
        },
        {
            "course_name": "Intro to Environmental Science",
            "review_date": "May 04, 2002",
            "review_content": "\nBower IS power. As mayor of Teaneck he effectively controlled the decision-making processes of a major NJ town. As the father of seven children, he serves as powerful head of a large household. So it's no surprise that his students tend to worship him and fall under his spell. I know I did. When you go to office hours to learn more about groundwater penetration, you come out with a REALLY complete understanding of the complex processes of irrigation and fertilization that lead to project conception. I HIGHLY recommend this Professor, in all his classes (including Hudson River). A tip: be sure to get to know Bower through office hours and other extracurricular activities.\nWorkload:\nPlenty of busywork, but Peter always takes time out of his busy schedule to privately fill you in on anything you may have missed, and anything else you yearn to know about him or environmental science.\n"
        },
        {
            "course_name": "BC3016 Environmental Measurements",
            "review_date": "March 31, 2001",
            "review_content": "\nThe class is a bit unorganized but there are few chances to take courses that actually take you to the field to teach sampling methods\nWorkload:\nclass meets once a week and there are two papers\n"
        },
        {
            "course_name": "Waste Management",
            "review_date": "March 31, 2001",
            "review_content": "\nUnfortunately one of the only permenent lectures for this dept. He does rammble on a bit about being the mayor of teaneck, nj and he is very arragont. However, he does know this subject well and when he teaches it is interesting.\nWorkload:\na paper and two exams\n"
        },
        {
            "course_name": "BC1001 Environmental Science",
            "review_date": "December 31, 1999",
            "review_content": "\nThe professor is ridiculously full of himself...(\"did I mention that I used to be the mayor of a relatively large town in New Jersey?\" \"Since I used to be the mayor of a large town in New Jersey...\" \"My experience as the mayor of a large town in New Jersey...\" every class!) He brought a camera crew into class to tape his lecture, and repeated all of his old jokes again to get them on tape, never explaining why the cameras were there. Oh, and he is exceedingly proud of having graduated Yale '68, with one George W. Bush, having played on the same baseball team. If you can listen to him preen for three hours a week, you'll get through it.\nWorkload:\nNo textbook, so class notes dictate what will be on the exam...making attendance important. A thousand hand-outs to memorize, but not a hard class at all . Read two novels, pay attention to detail. Lab is a cakewalk. An easy way to get through the science requirement.\n"
        },
        {
            "course_name": "BC3023 The Hudson River Environment",
            "review_date": "December 31, 1999",
            "review_content": "\nIf you feel like a throw back into a high school style class, this one is key. Many many handouts, i mean, well, you could possibly start a recycling company after this class. Lectures are laid-back, the teacher is very knowledgeable about the subject. We walked around the Hudson and the Columbia neighbourhood, was cool. Likes talking about politics, but just as an interest. Sometimes politics or tangents take up a large portion of the class, not a problem. Interactive classes sometimes with microscope observations, film clip showing, fresh fish excavating, and fermaldahide soaked, talking blue crab activities. Nice class if you have a heavy workload but want to add another class into your schedule.\nWorkload:\nOne map quiz, uh huh, various random high school-style quizzes on readings, 1 mid-term (1 part in-class, wit a page of notes, and 1 part hand-in MET art assignment), final, and a 15 page paper on whatever you want to write about relating to the Hudson river in any way. Has a couple of walking tours of the area, and then a summary paper hand-in.\n"
        },
        {
            "course_name": "BC1001 Environmental Science",
            "review_date": "December 31, 1999",
            "review_content": "\nIncredibly irritating! He talks about being the mayor of Tenafly at least twice per class. All he does is think up sick scenarios for how we could all possibly die from radiation poisoning for example if HE \" just reached up and broke the exit sign, we'd all have to clear out of here for weeks or else we'd die from acute poisoning\". Has a different way we might die for every topic, how does the man leave the house everyday? the lab is the most torturous four hours of your week, especially if you get joe for lab. UGH! BUT, it's easy. you just have to ask yourself if it's worth it...\nWorkload:\ntiny=handouts to keep track of attendance, three tests all of equal value, dont study, one during exams-not cumulative, lab is lots of busywork w/a huge 20pg. paper\n"
        }
    ]
}