{
    "prof_info": [
        {
            "prof_name": "Jarod Roll",
            "prof_id": 13625,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Prosperity, Depression, and War: American History 1918-1945",
            "review_date": "December 04, 2018",
            "review_content": "\nI genuinely enjoyed his class. He is a lively, upbeat speaker, and he explains concepts well. He puts all the info on a powerpoint so you can follow along and take notes easily. However, paying attention and listening to him lecture helps you fill in the gaps in the slideshow bullet points, so you can understand the concepts better. I think that's a really good balance—if your mind wanders, you can look at the slides and keep perfect track, but filling in those gaps gives you an incentive to actually show up and pay attention.\nHowever, my biggest issue was that he did not explain concepts chronologically. Oh no. Instead, he explained them by theme. That's all well and good when it comes to understanding how the events pertaining to, for example, black nationalism, led to another and advanced the theme in history. However, that meant you had literally NO IDEA what was going on when. We'd be on 1938, then 1925, then 1940, then oh yeah flashback to 1917... etc. It was ridiculous, and impossible to follow. And then the next day we'd be on another theme, and do it all over again, and then you'd have no idea what WEB DuBois was doing while the world's last passenger pigeon was dying, or even if they were alive at anywhere near the same time.\nAnd then he actually got upset that we didn't know the dates of things, so he made dates and chronology be part of the final! Um, dude, if you have been stressing big ideas and themes this whole time to the point that I have no idea what things are happening when, then you can't suddenly change your philosophy on the necessity of dates just because you finally noticed that, guess what, I don't know the thing you failed to teach me.\nGenuinely, I enjoyed his class. I liked him and I learned a lot! I just thought his lack of teaching things in chronological order was a major flaw that detracted from his otherwise quite informative and helpful class.\nWorkload:\nCouple readings each class, some short like newspaper excerpts, others longer chapters of books. Two 5-page essays, both of which are very straightforward\n"
        }
    ]
}