{
    "prof_info": [
        {
            "prof_name": "Barbara Spinelli",
            "prof_id": 1882,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Intensive Elementary Italian",
            "review_date": "August 06, 2014",
            "review_content": "\nI took Barbara's class in spring 2014 and thought she was fantastic. Her project on multilingualism can get a little tedious at times, but all and all I learned A LOT more from this intensive elementary course than the intensive intermediate course I took over the summer. This woman knows her grammar and knows how to explain it. I found her to be fun and engaged. If you have a background in Italian or another romance language, you'll find this class very accessible. I don't recommend it for someone without a language background though. Despite some of the previous reviews, she returns homework, papers and tests back within a few days.\nWorkload:\nLots of work, but not too difficult.\n"
        },
        {
            "course_name": "Intensive Elementary Italian",
            "review_date": "November 15, 2012",
            "review_content": "\nLove this woman. She's funny, reasonable, very fair with work and deadlines, and really helped me review/learn everything to get me to where I needed to be (I took italian with awful teachers in high school). If you have any previous exposure to italian and just want to breeze through the elementary level so you feel you're ready for intermediate, take this class. Other students who came into this class with no exposure at all thought it was reasonable as well. \nWorkload:\nA decent amount, but not unreasonable by any means. Weekly quizzes, compositions (which she lets you revise), and workbook/lab manual exercises, but not too difficult. One midterm, one final, both in class.\n"
        },
        {
            "course_name": "Intensive Elementary Italian I",
            "review_date": "March 23, 2007",
            "review_content": "\nReading through these other reviews, I feel that I am living in an alternate universe.  I am very happy that others had a good experience with Barbara SpinelliÂ’s class, but I simply canÂ’t echo the sentiment.  Her teaching style (as well as her personality) is very concrete.  I found her classroom exercises mind-numbingly repetitive--sometimes she literally transcribed the textbook onto the blackboard--but I suppose repetition does help.  I was just hoping for repetition and expansion.\nThat said, it was obvious from day one that teaching this class was the least of her concerns.  I say this because I had a problem finding her during office hours and she did not respond to e-mails I sent to clarify assignments.  I found her to be the least accessible instructor I have had at Columbia.  We had barely any homework for a six-credit course, and most people simply copied the answer keys into the workbook to get an A.  The occasional short compositions were rarely handed back before the next one was due, and that was usually a full month later.  Again, obviously grading our extremely minimal homework seemed to be the least of her concerns. \nIf I were a person who wanted to speed up the language requirement, get six credits of pathetically easy A, and not learn much more than the book already told me, I would have loved this class.  However, I have a genuine interest in learning this language and understanding the diverse and fascinating culture that lies behind it, and I donÂ’t feel attending this class helped me towards that goal any more than reading the textbook on my own would have.\n\nWorkload:\nSelections from the workbook (which most people copied straight from the answer key) and a few paragraph-long compositions\n"
        },
        {
            "course_name": "Intensive Elementary Italian I",
            "review_date": "December 07, 2006",
            "review_content": "\nBarbara is an amazing professor. She is funny, helpful, and genuinely interested in her students. This was the first time I had ever taken an Italian class and I learned so much. She is a very generous grader and makes the material fun and enjoyable to learn. I couldn't ask for more in a foreign language professor. \nWorkload:\nweekly lab manual/workbook exercizes, 1 composition a week (150 words). weekly quizzes, midterm, final.\n"
        },
        {
            "course_name": "Intensive Elementary Italian I",
            "review_date": "December 02, 2005",
            "review_content": "\nProfessoressa Spinelli was without a doubt the best teacher I have had at Columbia. She was entertaining, dedicated, and absolutely the most helpful person I ever met. I am amazed at how much Italian I learned in one semester with her. I assure you that if you're debating over whether to take the intensive class or the regular ones and are discouraged by the amount of presumed work in the intensive class, you should not let it worry you - Prof. Spinelli will pull you through it. She is a gold-star caliber teacher if I ever met one. There is not enough I could say about her style and her true caring for all of her students.\nWorkload:\nAround a dozen exercises combined between the Workbook and Listening Lab each week, a composition that averaged about every other week, easy midterm, final. Everything is extremely manageable and will help you learn Italian in a flash.\n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "January 02, 2005",
            "review_content": "\nI looked forward to Barbara's class everyday!  She's very lively, and she makes classes interesting.  We covered everything in the syllabus about two weeks before the semester ended, so we had plenty of time to review for the final.  She's very supportive and open to help with any questions her students have.  Barbara showed us a few movie clips in class so we could enjoy ourselves while we observed Italian dialogues.  It helps that she is from Italy - she tells us stories about Perugia, and she teaches us to speak with an authentic Italian accent.  I loved having class with Barbara, and I'd recommend her to anyone looking to take Italian.  I hope I can register for one of her classes again!\nWorkload:\nshort to mid-length Mid Term, very manageable Final Exam, easy weekly quizzes, workbook and lab manual exercises due weekly\n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "December 28, 2004",
            "review_content": "\nOMG I love Prof. Spinelli! She is so energetic and wonderful... I can't say enough good things about her! If you are on time (she hates tardiness) and participate she will try 100% to make sure you are doing well.\nWorkload:\nWeekly quizes and excercises... pretty light on the whole. Midterm, Final, 3-4 compositions.\n"
        },
        {
            "course_name": " Elementary Italian I",
            "review_date": "December 21, 2003",
            "review_content": "\ndefinitely one of my favorite teachers... entertaining and unintentionally funny, very nice, helpful, encouraging, and a good teacher. if you are going to take italian try to get into her class...she is awesome and her class is at 1pm which is superb. plus you have to sing italian songs once in a while which made my day because none of us could sing and the music made me feel like i was in an elevator.\nWorkload:\nweekly quizzes , listening lab and workbook for the chapter of the week, easy midterm and pretty easy final. not a hard grader as long as she knows you are trying.\n"
        }
    ]
}