{
    "prof_info": [
        {
            "prof_name": "Scott Snyder",
            "prof_id": 2038,
            "total_reviews": 19
        }
    ],
    "reviews": [
        {
            "course_name": "Organic Chemistry II",
            "review_date": "May 21, 2013",
            "review_content": "\nProfessor Snyder, hands down, is the best science professor I've ever had. \nSomehow, some way, by some awesome orgo magic he made me enjoy getting my lazy self out of bed so I could get to class on time for an 8:40 AM lecture. No small feat considering the fact that I'm chronically late to everything--I kid you not. Graduations, games, dinners, dates, everything but this class. And he was able to do this by simply doing what professors are supposed to do--teach. While I usually tend to like all my professors, I must admit that many of them can't actually teach. Yes, these professors are brilliant but the vast majority lack the skills necessary to engage and interact with large groups of people. Professor Snyder is not one of those professors. His lectures are generously peppered with relevant and often times hilarious jokes and pop culture references that are great for breaking up the monotony of early morning Orgo lectures. He even played a \"training\" montage for us during the last week that included the Rocky theme song and the original Karate Kid movie theme song.\nLectures:\nAll lecture materials are available online. I never even cracked open that dreadful McMurry book (great for me since I never bought the thing) nor did I do any McMurry problems. To be honest McMurry is probably one of the worst O-chem textbooks known to mankind. (If you're going to use an O-chem text, check out David Klein's \"Organic Chemistry\" textbook. I didn't use it for this class but I did use it for Orgo I. It's bloody brilliant. Klein is the grand master of Ochem textbooks). Professor Snyder begins each class with a 10-15 minute review of the previous lectures material, which I found to be insanely helpful because there were weekends where I wouldn't look at Orgo but I never had to worry about not being able to follow the first lecture of the upcoming week because he always reviewed everything. He also does problems in class, which seems to be a rarity for intro science courses. After he taught a topic, Professor Snyder would post \"quickfire challenges\" usually about 3 or 4 questions and we would literally work through them step-by-step. These, more than the actual lecture material, were invaluable to me. I learn best from example so these quickfire challenges really prepped me for the homework. I made sure to pay extra attention to those because many of them came straight from previous years' problem sets and helped me catch onto the patterns necessary for solving synthesis problems.\nHe also answered questions clearly and concisely. He doesn't reword what you say and then answer his own question he actually answers your question. He's terrific at breaking down even the most complex topic. To be honest, there really were no \"hard\" topics. He presents the material in a straight forward and easy to digest manner. I don't think I've ever come across a professor as diligently organized as  \nOffice Hours\nThis guy is so freakishly generous with his time. I say \"freakish\" because I've never had a professor host 2 or 3 office hours in one week. He answers pretty much all questions and even gives answers/hints to pset problems. I went to about 3 in the middle of the semester but then stopped going because they were quite crowded by the scary pre-meds.\nHomework:\nI disagree with the second reviewer down. I don't think there was too much work. It's an organic chemistry II class. What do you expect? Not only that, the work literally preps you for everything and anything that shows up on exams. The psets aren't terribly difficult but they are far more challenging than the actual exam so if you can do the hard stuff in the comfort of the your home with lecture notes and google at your disposal then you can do whatever he dishes out on the exam. They shouldn't take you more than 1 hour to complete.\nIt's really too bad he's leaving.\nWorkload:\n7 problem sets. 4 exams. 1 cumulative final. Go to lecture. Do the problem sets. Rinse and repeat for a fantastic grade.\n"
        },
        {
            "course_name": "Organic Chemistry II",
            "review_date": "July 10, 2012",
            "review_content": "\nI agree with parts of the previous review. Snyder's review page reads too one-sided and there's a need for different perspectives on his class. He's a very good professor and a wonderful person but in terms of his lectures, I cannot give him an entirely flattering review. \nThe big problem with professor Snyder's style of lecturing is that he goes way too fast, and even though he appeared to have slowed down his pace by the middle of the semester (perhaps due to student input?), he was still very difficult to follow. I think this problem can be attributed to the fact that Snyder does not usually allocate time during lectures to questions from the class (unless you raise your hand and interrupt his lecture to ask a question, and not everyone feels comfortable doing so). Although Snyder is very helpful during office hours and is willing to answer questions after class, getting used to his one-hour, I-am-not-going-to-stop style of lecturing was a challenge for me, and I think future Orgo II students should be aware of this (so that they know what to expect) before stepping foot in this class. Granted, some people in the class are able to follow through Snyder's lectures without a hitch, but I guarantee you that many others, including myself, found his lectures to be infuriating. \nI am not saying that Snyder does not make an attempt to engage the class because he certainly does; he peppers his lectures with his pop culture references, historical anecdotes, and his humor (and he's quite funny); I seldom found lecture to be uninteresting. However, professor Snyder needs to realize that pop culture references and historical anecdotes do not make up for a fundamental lack of engagement between professor and student in the sense that large portions of the class would frequently be five minutes behind in drawing resonance structures (that Snyder drew at lightning speed on the board) while the professor erases the board, does not allocate any time for questions, and speeds ahead with the lecture; this continued lecture after lecture after lecture after lecture. I get the impression that professor Snyder is a genuinely kind person and he really makes an effort to engage the class, so I get the impression this is an issue he may not necessarily be aware of. \nNot everyone is a natural in orgo, and beyond the hyper-enthusiastic postbacs cramming the first few rows of Havemeyer 309, the silent and confused masses of \"other\" students found themselves frustrated on a routine basis, and I hope this review speaks for the \"other\" students in the class. A large number of us studied hard on our own, listened to the audio of Snyder's lectures over and over again, and ultimately did well in the class, and I was one of these students. But really, at a bare minimum, how hard is it to pause - momentarily, at least? - during your lectures to take some questions from the class? \n\nWorkload:\nProf. Snyder's exams and psets are manageable. His style of lecturing? not so much...\n"
        },
        {
            "course_name": "Organic Chemistry II",
            "review_date": "July 10, 2012",
            "review_content": "\nProfessor Snyder is simply terrible. I have no idea why so many people are applauding him in this review page.He gives far too much work and relies way too much on memorization. His exams contain wacky \"apply-your-knowledge\" questions that are just downright ridiculous and all the other questions require you to memorize a ton of mechanisms. His problem sets are far too long and difficult, and he just simply floods you with too much crap for your brain to handle. Albeit a good teacher, he moves way too fast. Reconsider and don't listen to the lies on this page.\nWorkload:\nso much crap. problem sets that are annoying, long, and and difficult beyond any level of fairness. Long exams that require mass memorization. Dealing with depression.\n"
        },
        {
            "course_name": "Organic Chemistry II",
            "review_date": "May 19, 2012",
            "review_content": "\nAs I finished Snyder's final, a mystifying thought crossed my mind: \"Do I really want this class to be over?\" You read that correctly- I was sad to be leaving Snyder's class.\nOut of my 6 semesters at this school, I am hard pressed to think of a more dedicated professor than Dr. Snyder.  His classes were at 9 am MWF which absolutely sucked, but every lecture Snyder would be there early, have a recap of the previous class written up on the board, and was answering eager post-bacc questions about a problem set that wasn't due for weeks.  Moreover, Snyder held two 1.5 hour office hours a week in which students could ask direct questions about the p-sets that would be graded, and he would not bat an eyelid as he answered the question fully and in a way that made sense.  He was also very responsive by email even though he has a million other things going on in his life (google him and be prepared to have your mind blown).\nI did well in the course, and I did so by using all of the course materials Snyder makes available on courseworks (I did the psets honestly and then went to office hours and then put my final answers on paper in a group of students), and before each test I would do the old psets and midterms as well as read the supplemental textbook notes that Snyder wrote (yes, the man wrote his own textbook for the course).  Halfway through the course I stopped using the course assigned textbook, but I'd recommend not doing that if you need to know everything.\nSome perks: he grades the exams in 1 day, he offers extra credit, and he does a 20 minute recap of the previous class before getting to his next planned lesson.\nIt is easy to see why my experience with Snyder was so positive after 3 years of CU pre-med and science professors.\nWorkload:\nOut of 7 test hours (4 midterms and a 3 hour final), the best 5 hours were counted for 75% of the final grade.  There were 7 psets, with the best 5 couting for 15% of the  final grade, and 6 recitation quizzes with the top 5 counting for 10% of the grade.  \n"
        },
        {
            "course_name": "C3045-C3046 Intensive Organic Chemistry (for freshmen)",
            "review_date": "August 07, 2011",
            "review_content": "\nSnyder was our instructor for the second semester of freshman organic chemistry, and there were some highlights in his class. In comparison to Breslow, who (though well-meaning) was very confusing in his style of teaching and his creation of examination and never had office hours and constantly left class too early because of his trips to Switzerland, Snyder actually had office hours two to three times a week and had a very clear and organized style of teaching. He would always refresh our memories about materials covered in prior lectures, and would move systematically in his covering of material. In office hours Snyder was very nice, helping with homework and answering questions and trying to calm the ravenous and brownosing premed hounds (foaming Harvard Medical School despair and evil cut throat ectoplasm from their mouths) at his door. That being said, the last third of the class came like a freight train to the students, with a large amorphous and gelatinous beastly caricature consisting of random and confusing topics (amines, pericyclic reactions, some weird radical material, etc.) that ultimately led to this massive panic attack in realizing how much material was covered in the class. The worst part, was his final (45ish % of your final grade) was poorly constructed and ultimately far too long. I honestly feel like there were 50 single-sinded pages all stapled into this devilish mini-book of deceit. Normally, one expects a Columbia final to take between 2-2.5 hours, with a little extra wiggle time in the 3 hour span considering the stress and gravity of the final examination, but ultimately I do not believe 4 hours was fair for this final exam to be taken. I think the final consisted of 25 product questions being given the initial molecule and reagents, 15 annoying miscellaneous short answer questions, some other random long question requiring an explanation, and some 10 or so LONG synthesis and mechanism questions. Yeah, it was that bad. The weekly quizzes were very inconveniently time and consisted of 90% of the people sleepily taking quizzes at 11 am on a Friday, before chemistry lab. Problem sets were also very LONG and DIFFICULT and due at very inconvenient deadlines, and a lot of the times I could not attend office hours where answers would be given, leading me to sulk in the unfairness of the fact that I had other obligations and could not incessantly go to every single one of his office hours like other premeds. I just felt that sometimes the notes and textbook were insufficient to answer some of his cryptic problems and didn't like the fact that overcompetitive and rich premeds with no obligations were ahead of me gradewise because they could just go to all his office hours while I had to work. His exams were sort of random and consisted of a lot of tricky questions, and big points were made dependent on your ability to answer challenging synthesis problems and memorize some long and annoying mechanism. all in all, I love Dr. Snyder and know he is well meaning and I appreciate his efforts and know that he is an excellent teacher, but I do believe there was substantial room for improvement if he is to teach this class again. These consist of mostly fairer consideration for other obligations of students, and a little bit more shortness and fairness in exams.\nWorkload:\nLots of problem sets, annoying quizzes staged at stressful times, exams that can make or break you (depending on your abilities to take tests), and an evil final.\n"
        },
        {
            "course_name": "Organic Chemistry II",
            "review_date": "May 03, 2010",
            "review_content": "\nI was new to Snyder's class this semester, since I took first semester orgo with Sames. The difference between the two is, to use a cliche, like day and night. Snyder is one of the most efficient and organized professors I've encountered. He lectures at a brisk pace but always slows down to emphasize the important points. What's incredibly helpful is that he takes 5-10 minutes at the beginning of class to review material from the previous lecture. This is a great way to double-check the mechanisms you wrote down in a hurry and to refresh your memory before plunging into new material.\nLast semester, the McMurry textbook was my lifeline. Sames' lectures were hard to follow, so I read and reread the McMurry chapters. This semester, Snyder made me realize how inadequate the textbook is. No, Snyder doesn't teach out of the textbook; he only follows the textbook's way of organizing the material. But his lectures are really thorough, and he provides supplemental explanations (read: a mini-textbook) to go along with his lectures. He teaches the material so well that you don't really NEED the textbook. \nThis man's dedication is also amazing. He holds two office hours per week and a review session before each exam. For the third exam, he even trekked to campus on a Saturday to give a review session when he could have easily made one of the TAs do it. For someone whose first semester professor had a tendency to perform disappearing acts at crucial times, this kind of dedication was impressive. Also, I'm not sure if he will do this in the future, but he actually posted his own lecture notes online at the end of each unit from the second unit onwards (I suspect he did this for the second exam because we had a bunch of cancellations due to the weather). \nThis isn't to say that orgo II is easy. It's not. There are hundreds of reactions and many mechanisms. But Snyder makes it as easy as possible and tries very hard to point out the major trends so that the class is less memorization-based. If you do treat this class like a memorization class, you probably won't succeed.\nHis exams do require that you know the material backwards and forwards, but the material tested is entirely predictable. He is perfectly honest about the format of the exam, and the past problem sets and exams are good indicators of what will show up. The mechanism question is usually a gimme, and the synthesis problems have fewer steps than those on problem sets.\nIn short, if you put in the time to actually learn the material, you will very likely do well.\nWorkload:\nA lot. 4 exams + 1 final that equals 3 exams in weight. You can drop your 2 lowest equivalents. 7 problem sets (can drop 2) and 6 recitation quizzes (can drop 1). The quizzes were pretty annoying. \n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "January 19, 2010",
            "review_content": "\nOrganic Chemistry I\nOverall a good teacher. He tries REALLY HARD, he's very patient and pretty thorough for 66% of the material. The last third of the material becomes really rushed, and to make things worse, it is the hardest material of all.\nThe biggest downside is that, because he is so dedicated and friendly, waaay too many people take his class. This means that you will have a ton of super-stiff competition. Tons of pre-meds take this class, which means that they go to every office hour and study endlessly. This subsequently reduces the curve to essentially zero.\nRecitations are easy, and this helps your grade a little in the end. The \"practice tests\" he gives out are overly simplistic and can be very misleading. They often lull you in to a false sense of security for the exam.\nProblem sets are plentiful, but overall helpful in reinforcing the material.\nALSO: my biggest gripe with him was this blatant lie he told us early in the semester. He said that organic chemistry is not about memorization. This is false. For the second and third exam, 95% of the material is just memorizing approximately 45-60 reactions and their mechanisms, electron-by-electron. This is quite annoying. Then on the final, you have to use each and all of these reactions as interchangeable tools in creating new compounds.\nWorkload:\n7 problem sets (1 dropped), 7 recitation quizzes (1 dropped), 3 exams + final (can drop 1 equivalent)\n...I think.\n"
        },
        {
            "course_name": "Organic Chemistry I",
            "review_date": "January 19, 2010",
            "review_content": "\nOrganic Chemistry I\nOverall a good teacher. He tries REALLY HARD, he's very patient and pretty thorough for 66% of the material. The last third of the material becomes really rushed, and to make things worse, it is the hardest material of all.\nThe biggest downside is that, because he is so dedicated and friendly, waaay too many people take his class. This means that you will have a ton of super-stiff competition. Tons of pre-meds take this class, which means that they go to every office hour and study endlessly. This subsequently reduces the curve to essentially zero.\nRecitations are easy, and this helps your grade a little in the end. The \"practice tests\" he gives out are overly simplistic and can be very misleading. They often lull you in to a false sense of security for the exam.\nProblem sets are plentiful, but overall helpful in reinforcing the material.\nALSO: my biggest gripe with him was this blatant lie he told us early in the semester. He said that organic chemistry is not about memorization. This is false. For the second and third exam, 95% of the material is just memorizing approximately 45-60 reactions and their mechanisms, electron-by-electron. This is quite annoying. Then on the final, you have to use each and all of these reactions as interchangeable tools in creating new compounds.\nWorkload:\n7 problem sets (1 dropped), 7 recitation quizzes (1 dropped), 3 exams + final (can drop 1 equivalent)\n...I think.\n"
        },
        {
            "course_name": "Organic Chemistry II",
            "review_date": "May 21, 2008",
            "review_content": "\nAMAZING!!! I'm a rising senior that has taken a plethora of pre-med classes, and Professor Snyder is the first professor I have had that shows a genuine care for his students.  Needless to say that he is brilliant and gives great, organized lectures, he strives to make your experience painless and fun.  He works very hard--holding a ton of office hours, responds quickly to emails, and grades the exams fast.  he is certainly one of the BEST professors i have had at columbia. DO NOT MISS OUT ON HIM!!!   \n"
        },
        {
            "course_name": "Organic Chemistry II",
            "review_date": "April 28, 2008",
            "review_content": "\nProfessor Snyder is hands down the best science professor I have had at Columbia.  I truly can't say enough about how great he is at doing what teachers do: teach.  He is extremely thorough and makes the material easy to understand.  I can honestly say I've learned more in this semester of organic chemistry than in a whole year of my other science courses.  As to Prof. Snyders willingness to help students, it is of a type which is not seen at Columbia.  Office hours twice a week, review sessions before exams, and he is always in class a half an hour before and after each class answering questions from crazed pre-meds that would drive even Mother Teresa to madness.  To be able to deal with some of the most competitive, annoying, and brown-nosing students on the planet Earth and still be able to come across as friendly and genuinely willing to help is a marvel to me.  I couldn't do it, I have enough frustration with my overzealous partner in lab to make me want to drink the halogenated waste container, God knows were there long enough every Thursday for me to do it.  All in all, Professor Snyder is an execellent and caring professor.  To do well, focus on the lecture material and past problem sets and exams.  I didn't crack the book and knew only the reactions and mechanisms he gave and was completely prepared.  Go to the office hours if you can, they're pretty valuable, although you should probably bring a bag to be sick in when you see the amount of brown nosing that occurs.\nWorkload:\n4 exams, 1 final, 7 problem sets and quizzes.  Keep up with the material and go to class and you will come out good\n"
        },
        {
            "course_name": "Organic Chemistry",
            "review_date": "January 28, 2008",
            "review_content": "\nHe is the best teacher in the chem department.  (Unfortunately for Columbia, that's not saying as much as it should.)\nHe does not make the material any harder or easier than it is.  He simply presents it in an incredibly organized manner, and gives straightforward exams.  His problem sets and practice exams are good indicators of what to expect on actual exams.  Definitely go to office hours for the problem sets (It ends up being a group session, and is very helpful).\nHis lectures are perfectly constructed. I highly recommend going, even if it's on Fridays.\nWorkload:\nwhat is expected of an orgo class, nothing more.\n"
        },
        {
            "course_name": "Organic Chemistry II",
            "review_date": "January 23, 2008",
            "review_content": "\nPerhaps I'm the only one who did not appreciate Snyder. Yes, everything about his personality and great lecturing style is true. HOWEVER, I will give a couple of warnings to provide a little bit more balanced feedback. \n1. If you are a text book learner (like myself) DO NOT take the class. It is based on the lecture and even though most students would be willing to buy a second textbook to do better in the class, he doesnâ€™t assign one even though he doesnâ€™t really use the mcmurry at all. \nFor that matter, if you are not a morning person (like myself and most students I know) DO NOT take the class. You need to show up on time at 9 am  three times a week, and what's more, you have to be conscious at that hour. Do not kid yourself - you will not listen to the recorded lectures, and even if you do, they won't do you much good without watching as he performs the mechanisms on the board. (Getting the notes from someone and listening to the lectures is not much better)\n2. What the grading is based on is EVIL. The numerous graded problem sets and the importance of recitation quizzes - SUCKS. The problem sets are really difficult and really hard to do well on. You will spend hours doing these things. They assume that you already know the material and can apply it to trick questions. It means constantly staying on topof  the material - which if you have nothing else going on in your life is possible, but, especially if youâ€™re a bit more of a crammer, this is really frustrating. Same with the recitation quizzes - and warning - shop TAs, it will be worth it to have a good one. \n3. What he says about no curve - is basically true. Perhaps you wonâ€™t get a C if you get a 73 on an exam, but you wonâ€™t get higher than a low B and probably a B-. This is not Cornish. \nFinally, if you are set on choosing a semester of immersing yourself in orgo and spending hours and hours on a class that for most of you wonâ€™t help with anything else you do (how many of us are organic chemists) or doing well on the MCATS (for those of you who are premeds), here is some practical advice to help with the semester of hell you are committing yourself to. Just remember, this is not Cornish. Orgo II is not theory, it is lots of specific information that all ties together and just getting the gist will not be enough. You will not be able to 'just get by' as you did in Cornish, or just cram. Remember that the grading counts about 25% of stuff not exam based and you need to keep up to do well in it. \nSnyder might be great teacher for those who want to go on to graduate work in organic chemistry. And, while it is very refreshing to have a dynamic lecturer with a great personality in the science classes, understand what you are signing yourself up for. \n\nWorkload:\nproblem sets (hard) quizzes, exams, and stress\n"
        },
        {
            "course_name": "Organic Chemistry II",
            "review_date": "January 23, 2008",
            "review_content": "\nPerhaps I'm the only one who did not appreciate Snyder. Yes, everything about his personality and great lecturing style is true. HOWEVER, I will give a couple of warnings to provide a little bit more balanced feedback. \n1. If you are a text book learner (like myself) DO NOT take the class. It is based on the lecture and even though most students would be willing to buy a second textbook to do better in the class, he doesnâ€™t assign one even though he doesnâ€™t really use the mcmurry at all. \nFor that matter, if you are not a morning person (like myself and most students I know) DO NOT take the class. You need to show up on time at 9 am  three times a week, and what's more, you have to be conscious at that hour. Do not kid yourself - you will not listen to the recorded lectures, and even if you do, they won't do you much good without watching as he performs the mechanisms on the board. (Getting the notes from someone and listening to the lectures is not much better)\n2. What the grading is based on is EVIL. The numerous graded problem sets and the importance of recitation quizzes - SUCKS. The problem sets are really difficult and really hard to do well on. You will spend hours doing these things. They assume that you already know the material and can apply it to trick questions. It means constantly staying on topof  the material - which if you have nothing else going on in your life is possible, but, especially if youâ€™re a bit more of a crammer, this is really frustrating. Same with the recitation quizzes - and warning - shop TAs, it will be worth it to have a good one. \n3. What he says about no curve - is basically true. Perhaps you wonâ€™t get a C if you get a 73 on an exam, but you wonâ€™t get higher than a low B and probably a B-. This is not Cornish. \nFinally, if you are set on choosing a semester of immersing yourself in orgo and spending hours and hours on a class that for most of you wonâ€™t help with anything else you do (how many of us are organic chemists) or doing well on the MCATS (for those of you who are premeds), here is some practical advice to help with the semester of hell you are committing yourself to. Just remember, this is not Cornish. Orgo II is not theory, it is lots of specific information that all ties together and just getting the gist will not be enough. You will not be able to 'just get by' as you did in Cornish, or just cram. Remember that the grading counts about 25% of stuff not exam based and you need to keep up to do well in it. \nSnyder might be great teacher for those who want to go on to graduate work in organic chemistry. And, while it is very refreshing to have a dynamic lecturer with a great personality in the science classes, understand what you are signing yourself up for. \n\nWorkload:\nproblem sets (hard) quizzes, exams, and stress\n"
        },
        {
            "course_name": "Organic Chemistry II",
            "review_date": "October 31, 2007",
            "review_content": "\nProfessor Snyder is both a great professor and a difficult one. He just arrived at Columbia last year so it was his first semester teaching undergraduates. Within the first few weeks he knew the names of nearly everyone in the class (even with a class size of nearly 150) and really cared about how each student did. He made sure to have office hours at times which students could attend, had extra office hours during the days before an exam, and was extraordinarily helpful in answering questions both in office hours and after class. Professor Snyder would even set up meetings with individual students if that was what was required. Basically, if you show an interest in learning Organic Chemistry, he really responds and seeks to be of help. However, his class is by no means a breeze. He adds extra material beyond the book to fill out the gaps he sees in McMurry and the tests are difficult, though doable if you put in the effort. If you are ready to work, Prof Snyder and the TAs are there to help you through a difficult class.\nWorkload:\nThe regular orgo load: weekly problem sets (which you probably will need to go to office hours for), 4 midterms and a final.\n"
        },
        {
            "course_name": "Organic Chemistry II",
            "review_date": "August 02, 2007",
            "review_content": "\nThe man is AWESOME.  His lectures are rather fast-paced and color coded.  He takes the first bit of every class to review the last lecture, just to refresh it in everyone's mind.  He also wrote a series of notes that he uploaded to Courseworks because he thought the textbook was bunk.  So, yeah, he pretty much wrote a textbook.\nWorkload:\n7 problem sets (generally 1-2 between midterms) , weekly recitation quizzes, 4 midterms, 1 final\n"
        },
        {
            "course_name": "Organic Chemistry II",
            "review_date": "May 24, 2007",
            "review_content": "\nThis is such a great class....Prof Snyder is probably the best instructor I've had at Columbia.  I think he does an amazing job of presenting the material--even at 9am.  He's really available outside of class with something like 3 or 4 office hours a week and he always responds to emails immediately.  He does review sessions before the exams--instead of having the TAs do something....you can tell that he really cares about instructing his students and makes this course a priority.  I am not just saying this stuff because I did well---I only got a B+.  \nHere's the only problem with the course--because Prof Snyder is such a great instructor everyone learns the material and so the curve is pretty tough and it becomes really, really hard to get an A.  Nevertheless Prof Snyder is really great about explaining the grading system--he even tells you if you are close to an A/B before the final exam....I emailed him at the end of the semester about my grade and he responded within the hour with a really detailed response. \nWhile its hard to get an \"A\" or even an \"A-\" Prof Snyder is a really great instructor and really made me enjoy Orgo II. \nWorkload:\nNormal Orgo II : 3 Midterms + Final\nProblem sets are tough but doable---but the TAs all grade differently which is a little annoying\n"
        },
        {
            "course_name": "Organic Chemistry II",
            "review_date": "May 08, 2007",
            "review_content": "\nWhat an amazing, amazing man! Professor Snyder is one of the kindest, most organized, most committed, most accomodating professors I have encountered at Columbia. First of all, his lectures were wonderfully concise, clear, helpful, and easy to follow. He always started out with a 5-10 minute review of the material from the previous lecture, which was extremely helpful, and then he would continue on to give an interesting, logical lecture that never left us feeling any confusion. His lectures made the textbook seem worthless. Of course, this made going to class essential, but really, it was a pleasure, because I would always come out knowing exactly what was going on. He provided many, many extra problems and study guides to supplement the textbook (which generally sucks), and his problem sets were also helpful and doable. His tests were always fair, and I never felt like they were out to trick me. Besides his teaching abilities, he is unbelievably kind, has a wonderful sense of humor that he let's out once in a while, and he truly cares for his students. Get this--he somehow knew my name before I had ever even spoken to him (which means he must have memorized our names by looking at the guide they give profs on courseworks). In a lecture class of almost 100 students, that's incredible!\nWorkload:\nExpect to work hard, of course, because it's orgo, but all in all, his load was very doable. 6 or 7 problem sets due throughout the semester, one of which is dropped, 6 recitation quizzes, one of which is dropped, 4 midterms, and a final, which counts for three midterms. Of those seven units of tests, you can drop two, but they can't both be from the final.\n"
        },
        {
            "course_name": "Organic Chemistry II",
            "review_date": "May 02, 2007",
            "review_content": "\nSnyder is the best science teacher I have had at Columbia. After a bunch of so-so teachers in gen chem and orgo I, it was refreshing to have a teacher who gave interesting lectures, gave fair exams, and really wanted the class to learn the material. His tests are not easy at all, but they are fair- you wont ever sit there asking 'when did we learn this?' He is also more than happy to help if you go to his office hours, and is really patient with people asking lots of questions. Hes also entertaining in lecture and makes jokes and puns that lighten up the subject matter. \nWorkload:\n4 exams( 2 are dropped), final, 7 problem sets, 6 quizzes\n"
        },
        {
            "course_name": "Organic Chemistry II",
            "review_date": "April 29, 2007",
            "review_content": "\nIf you have to take Organic Chemistry, and you see that Prof. Snyder is teaching, make it a priority to set your schedule around that class.  Being a former high school teacher, I was impressed by the way Prof. Snyder incorporated effective learning strategies into his teaching.  Lectures were not only lucid, but also cohesive, both within a single class and from one class to the next.  He also helped to clear up many of the ambiguities from Orgo I by explaining things deemed unimportant by other professors, such as details of mechanisms and reactivity trends.  And his cheesy-but-endearing humor certainly helped.\nHowever, the work is not necessarily easy.  Problem sets and quizzes are meant to challenge and prepare you for exams.  Also, there is a lot of material, hence what many feel is a race through all of the topics.  However, his lecture strategies, particularly how he recaps the previous lecture, help to \"slow\" things down, and should not be ignored or missed.  So if you keep up with the work, by the end of the semester you will no doubt realize how much he's helped you to conceptualize organic chemistry, particularly when you are preparing for the MCAT.  (He'll even hold out-of-class sessions for MCAT chemistry review, which also shows how much he genuinely cares about his students.)\n It should also be mentioned that at the end of the final class, the students gave him a standing ovation that must've lasted 30 seconds (think about it -- that's pretty long).  He's easily the best professor for the pre-med chemistry (maybe even non-chemistry) classes, and I wouldn't be surprised if he's the best in the entire department.\nWorkload:\n7 problem sets, each taking at least 4-5 hours to complete.  6 quizzes.  The orgo standard for midterms and final.\n"
        }
    ]
}