{
    "prof_info": [
        {
            "prof_name": "Randall Reback",
            "prof_id": 1870,
            "total_reviews": 14
        }
    ],
    "reviews": [
        {
            "course_name": "Economics of Education",
            "review_date": "December 14, 2016",
            "review_content": "\nEngaging lecturer. Very available, objective and helpful during office hours. This course is really what one makes of it and Prof. Reback provides the resources and flexibility to enable pretty much any student to take something away from the experience.  \nIt's great for PDFing, he even allows students to waive the massive project for an automatic C. That being said, it seems possible to get an A although his grading is a tad tough. t was especially beneficial to have reasonable quantities of reading, such that this was the only class that I actually read every assignment for... \nThe material was extremely interesting, we were given enough freedom on the large assignments to focus where we wanted, and any resources/guidance necessary were fully available. I'd take it again and do an entirely different project (spending way too much time on it and being thoroughly glad that I did, again) if I could! \n\nWorkload:\nLight/Medium (depending on what grade you want, it seems) \n1 midterm, 1 debate, 1 policy brief (2000 word max), 1 final \n~ 30 pages of reading per class, but you need to have actually read them to do well on the test\n"
        },
        {
            "course_name": "Economics of Education",
            "review_date": "December 05, 2016",
            "review_content": "\nApproach with caution. Class may seem relaxed but then the midterm is very difficult- it was way too long for 75min, convoluted, and there was no partial credit on math parts. With a class with only around 20 students total, the grades were ridiculously harsh. To put this in perspective, I actually earned the same grade on the midterm in a Columbia finance course... \nThe material in the course is presented in a very disorganized, wordy way and is difficult to follow. There's no textbook or powerpoints so it makes learning the material a challenge. \nFor those who said they enjoyed the policy brief- well they must really enjoy writing because this is an extensive project that is worth 30% of your grade. It has to be 2000 words or less (6-10 double spaced pages).  In addition you have to present the paper to the class. On top of this there is a final that is cumulative. \nAttendance is not required, but if you want to have any idea of the material you need for exams, there is no way you can skip. \nThe debate was by far the most annoying part of this course. Each student gets assigned a debate with 1 or 2 other people and has to talk in depth about pretty difficult topics. Also, he doesn't say it, but it is graded. \nWorkload:\nMidterm 20%, final 30%, participation 20%, policy brief 30%, debate \nNo assigned homework- readings for each class\n"
        },
        {
            "course_name": "Statistics for Economics",
            "review_date": "January 08, 2014",
            "review_content": "\nJesus Christ, this class caused me so much more anxiety than it needed to. This was probably the most confusing class I had ever had to take. \nProfessor Reback is so lovely and so nice so it feels really terrible saying this but by god is he a terrible lecturer. He makes the easiest concepts confusing as hell and his examples are usually incoherent. It seems like he's used to a much higher level of teaching that dumbing down or even explaining these concepts that are so clear in his mind is a challenge.\nThe textbook is very clear and Vera the TA was a goddess. Thank goodness for her office hours (8-10pm on Tuesdays) where she would essentially walk us through the weekly problem sets completely and explain things that you didn't understand. \nAfter the first mid-term I decided to stop going to his classes (they're mostly optional) and lo and behold my grades improved dramatically. I also stopped being so anxious as everything was much clearer now thanks to the textbook and Vera. \nThis class was manageable by all means. The material isn't hard, and Professor Reback is a very lenient grader and is readily available and gives out extra credit. Just be prepared to be confused and honestly, stop going to class and go to the TA/Textbook. \nWorkload:\nWeekly Problem Sets - They're alright, esp with Vera's help. \n1 Midterm - Fairly straightforward but tricky true/false. \n1 Final - Much easier than the midterm. Literally just redo the second half of semesters problem sets and you should get nearly 100. \n2 Group Projects - Easy, straightforward. Present well. \n"
        },
        {
            "course_name": "Econometrics",
            "review_date": "May 23, 2009",
            "review_content": "\nWhen I looked into taking this class, I was surprised to find no reviews. Now, I see why. The class is boring and you won't want to be there, but it is a requirement. The lectures are dull, but it's Econometrics. The professor isn't bad, but he is not great either. He just comes to class and teaches. It's a shame because he could make the material more interesting and further analyze the practical application of the concepts. Like others have said, he does complicate simple things and doesn't explain things well. It seems like he tries to, but he just can't. The TA is a good resource if you have questions. As for the coursework, we spent most of the semester working on group projects. Members were assigned. The midterm is not too bad and the problem sets are good preparation. The final is relatively harder, much harder.\nWorkload:\n10 weekly problems sets, group project, 1 midterm and a final, which is fairly hard.\n"
        },
        {
            "course_name": "Introduction to Microeconomics",
            "review_date": "May 15, 2006",
            "review_content": "\nRandall is a great professor. He is far superior to Colacelli, who almost killed my desire to learn economics. But Randall tried really hard every single class to try and make us love economics, and see how it was in every part of our lives. He would bring in short articles about current events having to do with econ--some in our backyard of harlem! He got better as the course went on I think, and he tried to crack jokes a couple times a class. As long as you can accept the fact that he is a huge econ-nerd (which is okay, because he makes it so adorable) then you will enjoy this class. The workload is far from demanding, and the two midterms weren't so bad (the second one was much harder, but his curves are pretty good so you can still do well in the class if you don't do so well on the midterms).\nMy advice: do all of the problem sets, and do the extra credit he offers. I was able to get a 100.1% homework average, and that really helped my grade. I never skipped his class, and since most of the micro topics he does after the 2nd midterm aren't in the book, I recommend you go to those especially. Also, he is really helpful: if you like a certain micro topic he will let you know what class to take to pursue that. Even if you aren't planning to major in econ, take this course because it's not demanding, not too challenging (as long as you have some grasp of economics), and overall just an enjoyable class. Although he won't be here in 06-07 I am definitely planning on taking a course with him in 07-08!\nWorkload:\nNot so bad. He gives you the grade based on the highest average of three possible combos: 25% homework, 25% midterm 1, 25% midterm 2, 25% final; 25% homework, 25% higher midterm, 50% final; or 25% higher midterm, 25% lower midterm, 50% final. Problem sets due usually every week (graded pretty generously), and one chapter or article a week to read.\n"
        },
        {
            "course_name": "Introduction to Microeconomics",
            "review_date": "November 07, 2005",
            "review_content": "\nHands down the worst class I have ever taken at this university. Yes- Reback does manage to spend lectures making the simplest concepts confusing and skimming over things that could use some real explanation. You wont learn much from his lectures except that he really loves using M&Ms; and snicker bars as examples. The problem sets are from the book and offline, so they in no way reflect what he thinks is important in the class- which of course means that you are not prepared for his exams. This class definitely killed my interest in economics. With so many great econ professors in this university theres no reason to waste time with Reback. \nWorkload:\n3 midterms (lowest one dropped), weekly problem sets either from online at Aplia or from the textbook (the TA gives you a check just for turning it in. Theyre not graded) and a final.\n"
        },
        {
            "course_name": "Introduction to Microeconomics",
            "review_date": "August 27, 2005",
            "review_content": "\nProfessor Rebeck was not a bad teacher.  Granted the class wasn't always interesting and it was sometimes difficult to get to it, he did a good job of trying to assign interesting articles to read and discuss in class. It wasn't too hard, and the workload was definitely manageable.\nWorkload:\nThere were three tests throughout the semester, and I think he dropped the lowest grade out of those three and then the final.  You had homework that you had to complete, but the TA would just check to make sure you did all the problems and then you had the Aplia assignments. Very manageable. \n"
        },
        {
            "course_name": "Introduction to Microeconomics",
            "review_date": "May 31, 2005",
            "review_content": "\nLet's just start off by saying this is a nice guy with good intentions in mind.  However, he does not fully live up to what one would expect from a good economics professor.  At times he overcomplicates the simple stuff, while other times he makes some concepts overly simplistic.  How many professors on the college level spends a good amount of class time polling the class on how many slices of pizza they would buy??  His tests are fairly difficult, which in other cases I would not mind; however, his teaching does not prepare you for these exams.  If you are capable of  teaching yourself the material from the textbook, then his class would not be as bad.  But if you are not, have fun....you will have more difficulty grasping the stuff.  He fails to present the material in an interesting manner,  which could possibly make the subject come off as boring  to many people.  He eventually takes note of this and kinda attempts to make the class more interesting by talking about the Jets stadium, making us read articles where economics applies to real life, etc. etc.  All in all, I am sure this prof. knows his stuff......he just has trouble conveying it in an effective way to the class.   \nWorkload:\n3 quizzes (which are more like midterms) - only the highest two count (40%), 1 final (35%), weekly homework sets from the textbook (10%) - which can be extremely annoying and time-consuming at times, aplia problem sets (15%)\n"
        },
        {
            "course_name": "Introduction to Microeconomics",
            "review_date": "May 18, 2005",
            "review_content": "\nugh...well, lets see. I took this class out of sheer personal interest in the subject, let me start there. The professor...overcomplicates the simple, gets tangled in his own thoughts...the classes are so simplified they are boring, occasionally confusing, often painful...the tests, on the otherhand, were fairly difficult, involving the outdated use of multiple choice and true/false questions...i mean, come on, ask a person to define a concept, fine. but true false? i enjoyed the subject matter to some degree, but felt that the overall experience was not as positive as i would like. definitely not an easy A, which is frustrating, because the material is not complex, and could be handled in a way that makes it accessible to the students....\nWorkload:\nthree quizzes, chapter problems, online problems, cumulative final....\n"
        },
        {
            "course_name": "Introduction to Microeconomics",
            "review_date": "April 26, 2005",
            "review_content": "\nThe good thing about Reback is that he is new and more concerned about teaching his students than sticking to a routine dry teaching style that some professors are too inflexible to change. This is an intro class and some topics are so simplified that it gets a little boring and the real interesting parts aren't taught until the last two weeks of the course. His tests are difficult but not impossible. I truly believe that he takes student's reviews and comments to heart and tries to adjust his teaching and tests so that the students will actually learn. I wouldn't recommend this class if you are looking for an easy A.\nWorkload:\nfrequent problem sets, aplia, three quizzes and a final exam\n"
        },
        {
            "course_name": "Economics of Education",
            "review_date": "January 18, 2005",
            "review_content": "\nThe course is mediocre.  Reback is new and his lectures reflect this fact.  The course is also not as easy as the previous reviews have made it seem.  The pre-reqs. are Micro and Stats.  If you've had Micro or Econometrics, you'll breeze through the class, but if not...then beware!  His exams are MC (25 questions?) and maybe a few short essays which makes them pretty annyoing, because you can get only a few wrong on the MC and have your grade totally messed up.  He's hard to talk to outside of class...he's kind of odd.  He has an ansty personality which permeated the classroom atmosphere-- this often made me uncomfortable in class.  If you're not an econ. person and just taking this course for an easy A, DON'T.  You're better off taking Calc, seriously.  \nWorkload:\nPosting every week, midterm, final, policy brief (most interesting assignment in the class...which isn't necessarily a good thing).  \n"
        },
        {
            "course_name": "Economics of Education",
            "review_date": "January 03, 2005",
            "review_content": "\nGreat Professor and a very enjoyable class, but only if you're into the subject matter (which, fortunately I was). The class requires several prerequisites, but if you're into education, they aren't really that necessary. Professor Reback was formerly a 5th grade teacher, so he is used to breaking things down, but he is able to do it without making you feel like an idiot. Very approachable, values student input, and encourages questions and opinions. \nWorkload:\nThe workload wasn't too bad, a midterm, a final, a 6-8 page paper (which kept getting shorter as the semester went on) and about 10 question sets relating to class readings. All readings were available in a $60 coursepack or online for free. The length of the articles weren't bad, especially for an upper-level course. Grading is fair, but tests tend to be a little tricky. \n"
        },
        {
            "course_name": "Economics of Education",
            "review_date": "February 03, 2004",
            "review_content": "\nthis guy is new and seems a bit unsure of himself, especially when explaining complex mathematical or statistical concepts. however, he's a really good guy and really cares about the material. he used to teach public school, and now he offers the rare econ course that's taught from a policy perspective. readings are academic and popular articles, not a boring textbook. there's lots of good class discussion. he's a really nice guy and a fair grader. he's also the quickest grader i have ever encountered at columbia, for you impatient types. a great class for econ majors who want to see how econ is applied to public policy. definitely recommended.\nWorkload:\nmidterm and final, which are resonable. 2000-word policy brief on one of a set of given topics. topics are very specific and require real research, but he'll guide you through it. sometimes there will be a non-graded problem set or discussion questions. fair grading and not excessive workload. he's a good guy, and the class is a satisfying one.\n"
        },
        {
            "course_name": "Economics of Education",
            "review_date": "December 18, 2003",
            "review_content": "\nThis class was much easier than I thought it would be. Reback is a very fair grader and is very clear - especially since he is new and last taught fifth graders. \nThe math/symbols are limited\nWorkload:\nmidterm, final, policy brief (2000 words or less)\n"
        }
    ]
}