{
    "prof_info": [
        {
            "prof_name": "Mary Carpenter",
            "prof_id": 4256,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Ballet II",
            "review_date": "December 27, 2016",
            "review_content": "\nI absolutely loved her Ballet II class!\nHer Ballet II is considerably more difficult than her Ballet I class. However, she will tell you at the very beginning of the semester if you are not fit for the class. \nI really liked that she spends 2 weeks on each set of combinations, and that they gradually become harder as the class goes along. Since the combinations were not always new, I was able to focus on improving rather than just memorizing sequences. \nHer feedback is great. She can easily point things out that the class is struggling with, but she also gives great individualized feedback. Don't be afraid of being called out on individually! At first I felt embarrassed every time she would single me out, but she does it to basically everyone, and it really helped me improve. \nOn top of all that, she is also very approachable and responsive to emails. \nTake her class! \nWorkload:\nYou have to watch a live performance and answer a few questions.\n3 freebie absences allowed, 2 make-ups (total of 5 absences allowed)\n"
        },
        {
            "course_name": "Ballet I",
            "review_date": "April 03, 2012",
            "review_content": "\nHad a great time with this class! Signed up with absolutely zero dance experience (just figuring I might as well take advantage of the department while I'm at Barnard) and it was a good decision.  Doing flowing movements and stretches to a live, calming piano accompanist is one of the best ways to start your day for sure.  Mary Carpenter is friendly and just right for a beginner, though she also seemed good at giving tips to those who had more experience.  Don't be late or have your cell phone on!  It ruins the peaceful atmosphere.  \nMary's anecdotes in class about her ballet career give you a taste of the bizarre ballet culture without her actually being a hardass.  All kinds of people with many skill levels blended well in this class - guys and girls. Can be a little crowded, but Mary knew everyone's names anyway!  She was good about correcting you and making the class serious, while realizing that many people were just trying it out, or planning to take other types of dance in the future.  It didn't (usually) make me sweat, but it did make me flexible!  Just remember you'll need to buy the outfit, (leotard, cover-up skirt, canvas slippers) but it really wasn't as expensive as I was expecting - about $45 total (you get a discount at the store) and you can choose something you might wear in the future.  \nI recommend this class!\nWorkload:\nI like that she sent out YouTube videos every once and a while to show how that week's technique looked when done by professional dancers.  Very motivational!  I think if you miss a class she asks you to make it up with an advanced student, but it's really not a big deal.  why would you miss class anyway - attendance/participation is the only \"workload!\"\n"
        },
        {
            "course_name": "Ballet I",
            "review_date": "March 29, 2010",
            "review_content": "\nTook this twice with Mary Carpenter, who is ADORABLE.  A tiny redhead who's used to teaching kids!  I hadn't done ballet in literally a decade, although I was solidly grounded in Graham and Limon technique, and this wasn't excessively challenging -- a nice refresher for vocabulary and technique.  As a morning person, I had no issue with the 9 AM start time, but a lot of other people did; hell, the accompanist showed up late more than I did.  (Alas, she wasn't very creative or funny, but perfectly competent.)\nI'm a fan of Mary's ability to find YouTube videos relevant to class material, and the bonus videos of actual performances are always fun.\nClasses at this level tend to be a little big, which can be frustrating -- you rarely get the chance to repeat the chaines, or even try them from both sides, and that's my favorite part; the barre work can be hard to do if you're worried about whacking into somebody; and it's sometimes hard to resist the temptation to watch other students and compare yourself to them.\nWorkload:\nShow up, awake and willing to put some effort in, and you'll do fine.\n"
        }
    ]
}