{
    "prof_info": [
        {
            "prof_name": "Thibaut Pugin",
            "prof_id": 5484,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Calculus I",
            "review_date": "September 25, 2009",
            "review_content": "\nAs mentioned by the other reviewers, Thibaut really is a cut above your average Columbia math instructor.  \nI've had my fair share of graduate students and professors as I've worked my way through 6 math courses at Columbia and I'd have to say that the only instructor who came close to Thibaut was Robert Friedman.\nThibaut has a rare combination of great organization/preparedness (he clearly put a lot of time into the course, even creating his own course materials), genuine mastery of the subject matter (he can explain things n different ways, if need be), the rare ability to map ideas from the head of a math practitioner to a layman (he doesn't just throw theorems and ideas at you, rather he mixes them in with the right mindset) and he just plain appears to enjoy both teaching.\nMy experience in his course was great.  If I ever had the opportunity to take another class with him I'd jump on it.  I see he taught Linear Algebra at some point: I must say that as I slog through it now with an \"average\" Columbia math instructor, I truly wish I'd known and taken it with him.  \nWorkload:\nIt was a summer course, but also an intro course.  I had a full time job and was still able to do well.\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "August 31, 2009",
            "review_content": "\nAs the first reviewer said, Thibaut is hands down one of the best instructors you could ever hope to have.  He's a great communicator, and a great lecturer who really does care about whether or not his students learn.  Outside of call, he's incredibly generous with his time (e.g. holding office hours every day for an hour during the summer term, when most summer instructors will only give an hour a week in the summer).  He'll ask a lot of you, and work you incredibly hard, but you'll be rewarded with a very solid grasp of the underlying mathematical theory that should prove immensely helpful in future courses that use linear algebra.  Highly recommended.\nWorkload:\nHeavy.  The problem sets were incredibly difficult (even for the TA's in the math help room), and time consuming.  Be prepared to spend 10 hours on a problem set, and still feel like you could have put in more time.  The exams are also hard, but generously scaled.  A difficult group project was optional.\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "August 13, 2009",
            "review_content": "\nProfessor Pugin was hands-down the best professor I've had for any math course.  He's extremely demanding, but he's great at explaining and he works very hard to help the students, so you walk away learning an incredible amount.  He's also French, which means that you learn a lot of theory and proofs in his class, and less applications.  For me, that was great, I'm going on to pure math.  For people who want to do applied stuff, well, it's still great.  Because you'll understand the math you'll apply later.\nOne problem was that it was a summer class and he didn't like the textbook.  I agree the textbook sucked, but in a summer class you really have to do a lot of work at home, so you need to have a text that you can refer to.  Not having that made the class very difficult.\nAlso, his tests are rather difficult even if you understand the class material, and I've heard that this is true for other classes he has taught.\n\nWorkload:\nWeekly homeworks and quizzes, the homeworks usually take a few days for about 10 questions, and the quizzes are easy.  Midterm and a final.\n"
        }
    ]
}