{
    "prof_info": [
        {
            "prof_name": "Erk Grimm",
            "prof_id": 1828,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Europe Imagined",
            "review_date": "November 15, 2013",
            "review_content": "\nProfessor Grimm is considerate, attentive, and very helpful in his corrections of the assignments. I found this class to be insightful, and learned a lot from the readings, some of which were seriously among the best books I read in my life.\nWhat can be frustrating, though, is that this is definitely a literature class (duh). \nWhat I mean by that: most of the readings are very, very politically charged, and as a political science person, I always wanted to go deeper into the sociological/political aspects of the readings. Therefore, at first, I often felt constricted when professor Grimm brought the class back to the literary path and never allowed it to stray far from it (most of the time by asking questions about the narrator, very effective). Anyways, I finally got used to it and was able to appreciate this class.\nSo I definitely recommend this class; amazing readings and great professor.\nWorkload:\nMedium. Actually, it can be a lot, about 100 pages to read from one class to another, but the readings are so interesting anyways...\n2 essays, 1 final.\n"
        },
        {
            "course_name": "Europe Imagined",
            "review_date": "March 23, 2012",
            "review_content": "\nProfessor Grimm is extremely intelligent, insightful, and open to students' comments. He speaks in a very low voice which sometimes makes it either hard to hear him or stay engaged, but the material and what he makes of it are fascinating enough to make it worth your while. When I was in this class there were about 10 people, so it wasn't too hard to hear. Professor Grimm is good at inviting student comments and responding intelligently to them, unlike many other professors who don't comment or respond with something meaningless or dismissive. He sometimes makes jokes but you have to be on the lookout for them!\nOne thing I found annoying was that he seemed to assume people have an innate knowledge of the Cold War/Communism or random parts of Europe, but you can get past that. The reading material was varied enough that you were bound to find topics and genres you liked.  You don't have to do all of the readings when they are assigned, as long as you can comment on them occasionally in class, and know them for the papers and final. Take this class if you want to be exposed to new types of literature and places you probably never knew anything about before.\nWorkload:\n3 papers, getting longer as the semester progresses (from about 4 to 8 pages). Occasional half-page or 1-page response assignments. A final that's very doable if you know the readings and can say something intelligent about them.\n"
        },
        {
            "course_name": "Europe Imagined",
            "review_date": "January 28, 2008",
            "review_content": "\nOne of the best classes of my time at Columbia.  It exemplifies what a comp lit course should be - interdisciplinary, culturally relevant, theoretically interesting. The reading list is phenomenal and unique. Prof. Grimm has a wide range of interests and encourages each student to develop her own through engaging discussions. A truly mind-opening experience, especially if you are not familiar with European studies. \nWorkload:\nAMAZING readings; 3 papers; irregularly scheduled response papers and other written assignments; final exam based mostly on paper and homework topics.\n"
        },
        {
            "course_name": "Decadence and Dada",
            "review_date": "January 20, 2007",
            "review_content": "\nA good intro with a lot of interesting reads. Prof Grimm is a genuinely nice guy and he really appreciates people making an intellectual effort in his class. Sometimes he seems kind of sad though,  and looked like he looked like he needed a hug. Maybe it's because all the books we read were really dark and heavy (thats what you get for decadence, I guess). \nWhen I took it, there were fewer than 10 people in it, so it was pretty hard to escape commenting on things. He doesn't grade too hard, but make sure you use good references in your papers. And read (because it's worth it and..... You're screwed if you don't).\n"
        },
        {
            "course_name": "German migrant litterature",
            "review_date": "October 16, 2004",
            "review_content": "\nWhat a great and refreshing class. Selected texts were well chosen and enticing + class discussions were great. Highly recommended for all of those who are interested in German litterature and who wish to have a chance to practice their German. Can only recommend it.\nWorkload:\nReadings, 3 short papers (2 pages), 1 longer paper (4-5 pages) + in-class final. \n"
        },
        {
            "course_name": "Contemporary German Lit ",
            "review_date": "May 30, 2004",
            "review_content": "\ni enjoyed the class. \ncompletely disagree with previous comments.  perhaps it was different this time around because it was in german.. great prof, things got a little redundant sometimes, but that;s because he was scared we wouldn't understand him. \nhe never write a grade on your papers, which drove me nuts\nWorkload:\n2-3 papers , final , llots of written responses to readings (as homework) short paragraphs, but annoying\n"
        },
        {
            "course_name": "Contemporary German Lit ",
            "review_date": "May 30, 2004",
            "review_content": "\ni enjoyed the class. \ncompletely disagree with previous comments.  perhaps it was different this time around because it was in german.. great prof, things got a little redundant sometimes, but that;s because he was scared we wouldn't understand him. \nhe never write a grade on your papers, which drove me nuts\nWorkload:\n2-3 papers , final , llots of written responses to readings (as homework) short paragraphs, but annoying\n"
        },
        {
            "course_name": "Aesthetics of the Grotesque",
            "review_date": "December 04, 2003",
            "review_content": "\nI found Aesthetics of the Grotesque very disappointing The concept of the class was great, and the readings selected were varied and interesting. However, Professor Grimm failed to give the class any direction. He was very stiff in class, and wasted a lot of time repeating comments he had already made. Overall, he gave no feedback on our comments in class, and what feedback he did give was often conflicting or confusing. This made the class frustrating.  \nWorkload:\nLots of reading; three papers and a final.\n"
        }
    ]
}