{
    "prof_info": [
        {
            "prof_name": "Ovidiu Munteanu",
            "prof_id": 3541,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Ordinary Differential Equations",
            "review_date": "December 25, 2011",
            "review_content": "\nI really enjoyed having Ovidiu this past semester. Unlike most of the engineers in the class, I was one of the few students from Columbia College. I decided to take this class as an elective. At first, I was a little concerned because Ovidiu is a very quiet man with a somewhat thick Romanian accent and sticks strictly to the lecture and at first, some of the topics like integrating factor make no sense. After a couple weeks though, he becomes really endearing to the entire class and the material magically makes sense. He's like a giant teddy bear you want to hug. I took the 9:10 am lecture which most students don't attend; however, I would highly recommend attending lectures (he also offers an 11 am lecture). There is a lot of material he covers that is not strictly in the textbook that is on problem sets and exams. If necessary, I would advise attending his office hours especially if you are confused about Laplace Transforms (they are a nightmare!!!!). Ovidiu is extremely knowledgeable and willing to help any of his students. Overall, I would definitely recommend this class!\n\nWorkload:\n- extremely manageable workload\n- 13 problem sets, 10 of which are counted\n- 2 midterms\n- 1 final exam\n"
        },
        {
            "course_name": "Ordinary Differential Equations",
            "review_date": "November 21, 2011",
            "review_content": "\nTake this class with Ovidiu Munteanu if you get a chance, this class is extremely clear and surprisingly funny, considering Ovidiu's tone and facial expression. I don't think he was trying to be funny a lot of the time but, the amalgamation of his monotonic voice and straight face, some of the things he said were just hilarious. Once, he was talking about the Vandermonde Matrix and emphasized tot the students that he was not talking about Voldermort! \nThe math in this class is pretty mechanical and computational, he will show you proofs in class (which is nice for those who are interested) and he will go over variable of examples that will pretty cover the range of things you need for the hw and exams.\nOverall, good experience and manageable workload.\nWorkload:\nweekly problemsets everyweek. approx 13, takes best 10.\n2 exams 1 final. the exams are very fair, if you attend class and do your homeowork. \n"
        },
        {
            "course_name": "Partial Differential Equations",
            "review_date": "September 09, 2011",
            "review_content": "\nIf ODE is calculus on steroids with crazy computations, PDE takes a left turn and is very math heavy. Computations can be even more difficult, but the proofs and concepts are the hardest part here. The book by strauss is helpful along with his suggested book by bleecker for additional explanations. They are easy to follow, especially compared to the grad level books that I tried to read through.\nProf Monteanu is a very nice and funny guy. He followed Prof Daskalopoulos's syllabus closely which is very close to the book. He explains everything well and (I thought) better than the two text books. A combo of all three sources worked for me. During office hours, he is very patient and answered all questions.\nThe official course description didn't list calc 4 as a prereq, but he did. It was used in the last 1/3 of the class but more abstract, similar to the same way ODE used calc. I got by not having taken calc 4.\n\nWorkload:\nweekly homework, midterm, final. His midterm and final closely followed his practice midterm and final. The problem sets can be long, but that's the nature of the material.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "December 20, 2010",
            "review_content": "\nProfessor Munteanu is a super nice man who is very nice when you approach him during office hours. His tests are straight forward and follow his practice midterms and finals pretty closely. He explains things very clearly, and he picks out the important things for his classes. He doesn't care for optimization or approximation or related rates, which makes everything easier in his class. \nThe curve in his class is super nice. The tests aren't difficult, and it should be pretty easy to get an A. His examples in class are pretty helpful, and he picks problems directly from the practice tests, homework, and examples. There are no curveballs.\nWorkload:\nWeekly Homework (graded kind of harshly), 2 midterms (each 20 percent) and a final worth 40 percent\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "September 05, 2010",
            "review_content": "\nI am writing this review 2 years after having taken Calculus I with professor Munteanu. After taking 7 math courses with 6 different professors here at Columbia I have a decent ability to gauge math professors abilities. Professor Munteanu is an excellent professor; he has a very understandable accent and his lectures are clear and concise, he teaches at a reasonable pace,  he blends the perfect amount of proof/theory and practicality, and he gives a very reasonable workload. Munteanu tends to go over an example of all the tricky types of problems that will show up on HWs/exams, so there are rarely any surprises. Furthermore he always gives a practice test before any exam and the real exam has practically the same layout/types of questions with different functions and numbers. \nMy roommate was in my Calc I class and also took Linear Algebra with Munteanu last semester and said he taught it in a very similar manner to Calc I. The only con I found with him is that he is not very receptive to questions during lecture, however he is very nice and helpful if you go to his office hours. One thing to also consider if you are thinking of taking a class with Munteanu (which I suggest you do if he is teaching a course you need) is that he has been a professor here for-I believe- three years now, the majority of professors teaching intro math courses like the first few Calcs are usually fresh out of grad school and have little to no teaching experience (or reviews here on CULPA), so its a gamble when you take a course with them.\nWorkload:\nReasonable: easy weekly problem-sets and Course-Works, 2 straightforward midterms and a final.\n"
        },
        {
            "course_name": "Linear Algebra",
            "review_date": "August 10, 2010",
            "review_content": "\nTo Monty Python fans: \nLectures play out as the lost Linear Algebra segment of Life or Death Struggles.\nhttp://www.youtube.com/watch?v=0p-cY1XWN_Q\nIt does become a life or death struggle to stay awake during lectures, but the achievement is worth more than the accompanying bragging rights: Ovi knows his stuff and consistently explains things clearly, not to mention the in-class examples are very useful when it comes time to do the problem sets, as the textbook is scrimps on the details in places.\nThe midterms are fairly straight-forward -- similar to homework problem sets and most certainly the practice exams in difficulty and material.  But the final was another beast entirely, as it was much trickier, more time-consuming, and generally harder than the midterms (no helpful multiparted questions to walk you through to the major point - he goes straight for the jugular on the final).  The general consensus was that the class average was too high going into the final, and Ovi decided this had to change.  Read: a very manageable class up until the final 2 weeks or so, when you tie your brain in knots trying to remember every minute detail about linear in/dependence etc. and then try to think critically.  It's not necessarily catastrophic, but there will be an explosion of some degree.\nOvi is just as awkward one-on-one as he is in class, but he is quite reasonable, even nice (apologetic may be pushing it) if you've been unfairly graded.\nBonding with the TA's isn't necessary, but it wouldn't hurt your cause if you were unjustly docked points, which is a more common occurance in this class than others because of the extensive room for error in dealing with high-volume matrices.\nOverall, it's not a difficult class, but do expect to put in some effort.  Actually sleeping at night is essential, because with all the numbers running around in the matrices, it is very, very easy to lose a lot of points on careless errors (speaking from a friend's experience).  Not an earth-shatteringly enlightening class, but recommended considering it opens the door to the fancier cryptography class on making and breaking codes (MATH V3025).  And hey, Ovi's goofy mannerisms are kind of endearing (be on the lookout for his understated but abrupt expressions of personal opinion -- even if you don't appreciate the perhaps unintentional comedy, it'll at least make you pay attention).\nWorkload:\nWeekly problem sets, budget 2 or 3 hours to be safe.  \n2 reasonable midterms, neither dropped.\nPesky ego-damaging and grade-lowering final.\n"
        },
        {
            "course_name": "Ordinary Differential Equations",
            "review_date": "May 19, 2009",
            "review_content": "\nGood professor, but will make you feel dumb if you ask a question during class. Overall a good professor for a course which was medium difficulty.\nWorkload:\nMedium. Weekly homework which was manageable and then two midterms and a final. He posted practice midterms which was very similar to the real ones, but did not for the final (much harder)\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "February 20, 2009",
            "review_content": "\nI thought he was a relatively good professor.  He has an accent, but it isn't too difficult to understand what he is saying.  He's usually clear about the explanations he gives in class.  He is harsh about grading homeworks, but then, if you get it wrong you deserve points off and this is Columbia.  The standards are higher.\nThe only truly negative thing that I can say is that he sometimes seems short-tempered when the class isn't following him as quickly as he wants, or when the grades come back poor.  And he is not always able to prove things relevant to the material--for instance, he was unable to prove a theorem about logarithms when I asked him in office hours.  It wasn't essential to the class material, though.\nWorkload:\nLarge but not oppressive.\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "January 11, 2009",
            "review_content": "\nProfessor Munteanu, coming from Romania (I think), is very knowledgeable about Calculus. The class is not too exciting, but most of his lessons are very clear and precise. The only thing negative about him is that he doesn't encourage you to ask questions and when you do, he sometimes make you feel stupid. But still ask questions anyways -- he does the best he can with answering them. \nWorkload:\nWritten Homework every week, Online Homework every week, 2 midterms, and 1 final. \n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "January 04, 2009",
            "review_content": "\nOvidiu is an alright teacher.  He moves briskly through the material but explains concepts relatively well.  He does less well when answering questions during class.  He would usually quickly repeat what he had just said when asked for clarification.  I've heard he is much more helpful during office hours, but I never went myself.  One thing I noticed is that he seems to not have a sense for the math knowledge base of an average incoming freshman, even one that has not taken calculus before.  He adjusted his lecture and exams after the first midterm though, so I think he is getting the hang of things. \nWorkload:\nOne problem set per week, relatively easy with a few hard questions.  2 Midterms. Final.  Gave sample tests that closely mirrored the actual test.  \n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "December 15, 2008",
            "review_content": "\nHad him for Calculus 1 and couldn't stand it. People stopped coming to class and started teaching the material to themselves. I know I learned a lot more sitting with a text book in front of me for 30 mins then sitting in his class for an hr fifteen. AVOID IF YOU CAN! We had a good amount of work and the hw was graded very harshly. The only positive thing is that his study guides are pretty similar to the test, but if you don't know how to do it, then that doesnt help. I couldn't understand anything he was saying. He is definitely smart and knows his stuff, but not a great teacher.\nWorkload:\nproblem set each week, webworks each week, 2 midterms and a final\n"
        }
    ]
}