{
    "prof_info": [
        {
            "prof_name": "Cheryl Mendelson",
            "prof_id": 4851,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Law, Liberty, and Morality",
            "review_date": "December 17, 2013",
            "review_content": "\nI'm a philosophy major and found this class philosophically rigorous and interesting.\nYes, most of the readings are dry, but what do you expect out of a law class. The first portion of the course is devoted to learning jurisprudence, building up the different legal frameworks which we will go on to apply to landmark cases like Roe v. Wade and U.S. v. Windsor. There is a lot of grunt work involved up until this point, but in the end you are equipped with the resources to analyze and critique the cases in an informed way. Trust me, it is a rewarding process.\nProfessor Mendelson knows her stuff, and I only have the deepest respect for her. She is always available for her students, and it is clear that she really cares about the material. Speaking of which, I find it refreshing that she is not shy about her personal opinions. In classes dealing with political issues, I think it is more pedagogically effective if the professor is transparent about where she stands. And she emphasized over and over again that our grades and her respect for us were not affected by whether we agreed with her.\nFor the sake of full disclosure, I am pre-law, but I would recommend this class to anyone who is interested in learning about the topography of our legal landscape. Scratch that, I would prescribe this class to anyone who is interested in becoming an informed citizen of the United States. \nWorkload:\nA midterm, final paper, and final exam. Lots of reading, but Professor Mendelson is uncommonly reasonable and prunes the readings when necessary.\n"
        },
        {
            "course_name": "Law, Liberty, and Morality",
            "review_date": "February 02, 2011",
            "review_content": "\nIf you're a philosophy major who does not intend to go to law school -- do not take this class. If you are interested in going to law school, then this is the closest thing you'll get to a pre-law class. The first half of the semester is devoted to legal philosophy and concepts and the second half of the semester is devoted to specific cases, rulings, etc. There was a lot of potential to weave the two halves together conceptually, but it never happened. A lot of class time was spent just going over the readings, though there was some room for discussion. We discussed \"law\" quite often, but not \"liberty\" or \"morality\" as much. Not entirely sure why this is listed as a philosophy class, as one really does NOT need to have taken any philosophy classes in order to understand the material and do well. However, if you're looking for a fascinating treatment of the various issues surrounding legal theory, you're not going to find it. Philosophically, a really boring class (especially the second half). The readings are very dry. However if you like reading cases and are interesting in going to law school, then it's probably worth it. Some people really liked the class, but most people did not enjoy it.\nPrreview_contentr review_content: Professor Mendelson is a really nice person, really funny, and very easy to get in touch with. She spent time with everyone going over their final paper prospectuses (?) and really helped us develop our topics. She's good at leading class discussions (when they occurred); however, most of the time was spent just reviewing the readings due for that class. I can't decide whether she or the material is what made the class so boring. If you do not like it when your professor injects his or her political views into lecture, then avoid review_contentlass.\nTA review_content: Yoshi is approachable, responds to e-mails quickly, and is willing to respond to student concerns. His comments on the draft for my final paper were extremely helpful. Overall, a good TA. It's worth mentioning he's really attractive because otherwise sitting through this class was like watching paint dry. \nWorkload:\nA lot of (long and dry) readings. Take-home midterm, one 10-15 page paper, and a take-home final.\n"
        },
        {
            "course_name": "What is Philosophy?",
            "review_date": "October 21, 2009",
            "review_content": "\nI've got nothing new to add here because the previous reviews have basically summed Mendelson up in a nutshell, but I couldn't resist hopping over here to just express how much I ADORE this woman!!! She is the reason why I've changed from a Math major to a Philosophy major. She really cares about her students and is very accessible outside of class. She's the kind of professor whose office hours you just want to go to to spend more time with her!\nShe's very clear and she will make sure that you understand the important concepts thoroughly. She likes to have her class as a discussion sort of style, and she makes her best effort to learn everybody's name.\nNot to mention that she is just absolutely adorable! I can't wait for her to come back next school year so that I can take a class with her again!\nWorkload:\nCompletely reasonable. Weekly readings (averaging at about 35 to 50 pages a week). One paper, one midterm and one final. She makes sure that you're completely prepared for them, though!\n"
        },
        {
            "course_name": "Elementary Logic",
            "review_date": "May 12, 2009",
            "review_content": "\nProf. Mendelson is a great professor- she is intelligent, patient, willing to answer questions, and very available for students. Although she has not taught logic for awhile, she explained the concepts clearly. This class presents an introduction to formal logic and is great for students with no logic experience (such as myself). The only time this presents a problem is when students aren't paying attention when things are explained, or simply don't get it, and ask lots of questions that detract from the actual presentation of the material. However, with weekly office hours and the weekly \"logic hour\" just for our class, Prof. Mendelson made plenty of time to answer students' questions. \nOverall, a dry class (what do you expect?), but a great way to fulfill the Q&DR; requirement. Good if you plan to take the higher level logic course and don't have any logic experience.\nWorkload:\nWeekly homework problem sets, two exams, final. Exams are easier than the problems in the homework. Not especially difficult.\n"
        },
        {
            "course_name": "What is Philosophy?",
            "review_date": "April 13, 2009",
            "review_content": "\nLOVED HER!!!! I very much agree with the positive review. A total sweetheart and fabulous lecturer. Her brilliance shines through class discussion. I believe she went to Harvard but she is incredibly modest and not one of those stuck up teachers. She was always there for her students and wanted everyone to do well. All around an A + professor and person\nWorkload:\nPapers and a take home final. Some heavy reading because the works are not easy but always fair\n"
        },
        {
            "course_name": "What is Philosophy?",
            "review_date": "January 19, 2009",
            "review_content": "\nShe is the most amazing person. I have never been in a class yet where the ENTIRE class absolutely LOVED her so much and only had positive things to say. Sometimes the philosophy works could be a bit dry but by the end of the class I had a great grasp of the basic major works. Take her if you want a pleasant experience with a professor!!!\nWorkload:\nFair\n"
        }
    ]
}