{
    "prof_info": [
        {
            "prof_name": "Allan Silver",
            "prof_id": 257,
            "total_reviews": 13
        }
    ],
    "reviews": [
        {
            "course_name": "Friendship in Western/Eastern Civilization",
            "review_date": "November 16, 2012",
            "review_content": "\nHe is one of the best professor I've met in Columbia, I must say. I don't know what he was like before, but the Prof.Silve I know is super knowledgable, humble, and helpful. I am sure most students in my class would agree with me on that.\n I took friendship in eastern/westen civilization with him, a class co-taught with Rachel Chung from Ealac that lauched in Spring 2012. It was an absolutely amazing class. Class content rotate, one on the east then one on the west. When Prof. Silver teach the western part of the story, prof. Chung listen and discuss with us like another student. Same to Prof.Silver, who wanted to learn more about Asian culture as eagerly as we did. Both of the professors was very enthusiastic, class discussion was very interesting, and the workload was not bad at all. There was supposed to be an oral final and a research paper, but they cancelled the oral final because they thought everyone participated in the class really well, and there was no need to test us on how much we knew about the class material.\nHe replied all my emails super fast, and would meet with you happily to talk about any concerns you have. He has a whole library in his head, and all the books/articles that he recommended were super helpful. He is a great scholar and professor. I would recommend his class to any person.\nHe's been here since 1964. In my eyes, he is the model of a true scholar.\nWorkload:\nmanageable - see above\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "September 25, 2007",
            "review_content": "\nI don't know why everyone complains about Allan Silver. He's a saint. The only time he was late was when he was making extra copies for our always-unprepared classmates. If you want a CC lecture that doesn't just worship a group of supposed philosophical giants, but actually questions the relevance of the material, as well as its relationship to our very American perception of things, you might want to take Silver. He's not for the people who want the books explained to them because they lack those very important components of the brain that enable memory and comprehension.  LIkewise, if you have a tendency to repeat the same question several times after 10 other members of your class have already asked it, this class is not for you; because, strangely, he shows some irritation to that type of behavior.  The grading is pretty fair - he expects deep, thoughtful analysis and no ornamentation or overinflated language in the papers. Just say something of value. The mid-term and final are easy if you do the reading, because he also gives you an exact list of things to focus on and actually sticks to them. In addition, your overall grade is largely progress-based, so if you cut back to asking the same question only 2 or 3 times, that is probably sufficient progress. Overall, I didn't particularly have a problem with Allan Silver. He's witty and incredibly intelligent, but is always willing to phrase and rephrase to make his explanations understandable to those who need the help. On the downside, he does tend to run out of time a lot and the syllabus gets pretty backed up, but that may just depend on the overall level of intelligence of your classmates.\nWorkload:\n2 3-4 page papers and 1 optional paper, a mid-term and final, and lots of extra readings on the syllabus, optional dinners(but of course, that is not actually work)\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "August 31, 2007",
            "review_content": "\nCan I say BORING? And dont take this teacher if you think you're getting the easy way out. Aka the \"A\". The class is boring, you dont learn anything and you end up doing horribly. \nWorkload:\n2 papers, 1 optional paper, midterm and final\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 22, 2006",
            "review_content": "\nIt looks like I don't even have to write this review, because enough people have explained the misery that is Allan Silver already.  \nSilver is consistently 15-20 minutes late to class, and canceled class 5 times in one semester.  He had to push back the midterm because he forgot to write it; he pushed back the due date for an essay twice because he forgot to think of topics.  His disrespect and lack of effort for the class is astounding.  I listened to friends talk about their wonderful, engaging professors and lamented my professor who clearly couldn't care less.\nClass is painfully boring, and feels like so much longer than 2 hours, worsened by the fact that he does not give a break.  He does not permit class discussion - in the rare event that he calls on a student, he cuts him or her off mid-sentence and goes back into his own ramble.  Again, the disrespect is incredible.  More often than not I walked out of class angry.\nI wish Columbia would respond to students' complaints about this Professor, or take a look at this page of awful reviews.\nWorkload:\nIncredibly light, you can get away with doing none of the readings.  2 5-page papers.  Midterm and Final are both close analysis of given passages, no IDs.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 05, 2006",
            "review_content": "\nDiscussion: Don't expect any sort of meaningful discussion in Professor Silver's class. He seems to feign that he wants a meaningful class discussion.  Then he does not allow anyone to speak, while he drones on for long periods of time.  He is very long winded, with his sentences beginning several minutes before they end.  You will fail to be able to take any sort of nots. As a lecturer, he fails in every way possible to make any sort of point.  Furthermore, he fails to clarify the material in any sort of way.\n     He copy edits your essays, and then writes a very long-winded and insulting essay response to your essay.  He proceeds to give you a bad grade.  (Or at least a very mediocre one in my case.) \n------ AVOID LIKE THE PLAGUE ------\nWorkload:\nTwo Essays (5-6 pages), Third Optional.  Midterm and Final.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "November 14, 2005",
            "review_content": "\nSeriously, you need to switch out of this class right now.  This is not a personality dispute.  I think that Prof. Silver is a very nice, very sweet man, but the fact of the matter is that he treats CC with absolutely no respect, and his students suffer because of it.  Prof. Silver cancelled five classes and did not require make-ups for any of them.  This at first sounds great, but not really when you consider that you still need to learn this material for his exams and papers.  The problem here is that he does not teach.  This is a seminar class, yet he does not facilitate discussion.  I would not mind if he lectured instead, providing us with any insight on difficult readings.  But he does not do this.  He raises several questions, and none of them get discussed.  He interrupts students constantly, and acts like you should be thankful if you get to ask a question, or make a statement.\nSeriously, this is not a personality dispute.   If you want to learn anything, then do not take this class.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "November 14, 2005",
            "review_content": "\nAllan Silver is boring, harsh, and mean.  I got a good grade in his class, so this isn't bitterness about that, but he made rude comments on many peoples' essays, his sentences make no sense and end about 15 minutes after they started.  I left this class with no idea what was going on in any of the readings whatsoever and only a vauge notion of his skewed perception of one paragraph in the reading.\nDO NOT TAKE HIS CLASS!\nWorkload:\naverage...\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "November 14, 2005",
            "review_content": "\nAllan Silver is boring, harsh, and mean.  I got a good grade in his class, so this isn't bitterness about that, but he made rude comments on many peoples' essays, his sentences make no sense and end about 15 minutes after they started.  I left this class with no idea what was going on in any of the readings whatsoever and only a vauge notion of his skewed perception of one paragraph in the reading.\nDO NOT TAKE HIS CLASS!\nWorkload:\naverage...\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 29, 2002",
            "review_content": "\nWhoever described him as a \"bumbling bafoon\" really summed Silver up nicely.  He absolutely refuses to analyze the texts, or even say anything that can be even remotely called intelligent, spending at least 60% of each class exaulting the \"beauty of the prose\" and making similar silly remarks that have little place in a critical academic class.  He allows the class to run wild as he intellectually dodges this way or that and just as you think he's actually going to come to some kind of conclusion, or at least to a point, you realize that he has no point!  Nope!  His discussion of the quality of the prose and of our own unworthiness to criticize them was all a cover for the fact that he didn't read the book!  His remarks move the class around in circles, only superficially touching on the actual content of the books, and generally are pompous and irritating.  A total waste of time.\nWorkload:\nMidterm, two papers (third is optional), final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 13, 2002",
            "review_content": "\nHe is a wonderful, philosophical man whose thoughts reflect his many, many years. He is also very nice and cares about his students. However, he is a poor lit hum teacher; he never refers to the text, he will ramble about one theme without concluding anything for the entire class. You won't learn much nor will you be prepared for the final. But if you like the man, which isn't hard, it's not so bad. Plus you sit outside when the weather's nice. But if you're there to learn about the literature, go elsewhere. \nWorkload:\n2 (4-5 p.) papers, another 1 optional, midterm, final\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 26, 2002",
            "review_content": "\nProf. Silver was a bumbling baffoon who couldn't keep the names of the characters straight. He looked and sounded just like Rodney Dangerfield, and Silver flapped his hands in the air to distract us from the fact that he had absolutely no idea what he was talking about. In class, we discussed the most ridiculous things such as Cordelia's (King LEar) height. If you're looking for a teacher whose class you can skip every day without missing anything, silver is your man. however, if you're looking for a coherent, informed teacher, avoid Silver.\n"
        },
        {
            "course_name": "BC3082 Introduction to Social Theory",
            "review_date": "December 31, 1999",
            "review_content": "\nFear this man's courses and run from him. In addition to having adamantly fought students in 1968, this man cannot pronounce a coherent sentence. Take this class if you like 1.5 hour ramblings with no thesis and no conclusion; even if you do like this, you'll be disappointed because you can't hear half of what he is saying. A wonderful example of the failure of the tenure process and its disregard of teaching abilities.\n"
        },
        {
            "course_name": "Classical Social Theory",
            "review_date": "December 31, 1999",
            "review_content": "\nThe above review is so harsh! Silver is super-sweet and very smart. He'll take the time to talk about your ideas and is excellent on a one-to-one basis.\nWorkload:\nAverage\n"
        }
    ]
}