{
    "prof_info": [
        {
            "prof_name": "Antoine Compagnon",
            "prof_id": 2778,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Senior Seminar",
            "review_date": "January 17, 2006",
            "review_content": "\nLike the last reviewer said, if you are reading this review, you are taking the class.  Still, I don't know that the situation is that bleak.  Prof. Compagnon is VERY French.  He will not pamper you at all-- things that are wrong he will promptly reject, those which are correct will be accepted, but never praised.  I had mixed feelings about this.  True, I (and most of my classmates) were afraid to speak.  On the other hand, it can be refreshing at times to have a professor who won't let people who would otherwise bulls--t their way through class (you know the people I mean) shut up.  Compagnon is brilliant, and has plenty of worthwile things to say.  I think if you keep in mind not to take anything he says personally, it's possible to get a lot from this class.  It might not be something I would have chosen if I had had a choice, but in the end I think it was good for me.\nWorkload:\nNot bad at all.  Emphasis on close readings, so there aren't that many books.  Speak up on the first day when he asks what people want to read; he really does let you choose, and that is how my class got stuck with a really awful book.  If anyone brings up anything by Celine, vote against it promptly.  D'un chateau l'autre might be my least favorite book.  One page weekly response papers, 2 4-5 page papers that seem like they are graded harder than they are.\n"
        },
        {
            "course_name": "Senior Seminar",
            "review_date": "January 04, 2006",
            "review_content": "\nThe unfortunate thing is that if you are reading this review, you have to take this class.  This is one of the worst classes I've taken in the French department, and I don't say that lightly.  Compagnon is brilliant and a well-known scholar, but in class he is condescending and arrogant.  By the end of the semester, no one spoke during class due to a semester of being beaten down after every and any comment.  He makes up the reading list of 5 or 6 works on the spot, and only one was worth reading, which only compounded the painful two hours spent in class.  Sorry French majors!\nWorkload:\nOn the bright side, there are only 2 four-page papers and weekly one page responses that are ungraded.  Everyone in the class seemed to get between a B+ and an A.\n"
        }
    ]
}