{
    "prof_info": [
        {
            "prof_name": "Maria-Elena Gonzalez-Soto",
            "prof_id": 3577,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Spanish I/II (1201-1202)",
            "review_date": "November 17, 2009",
            "review_content": "\nIf you have a passion for learning spanish, don't take her class. Her classes are mildly interesting at best, and that is on a rare occasion. The most interesting thing were the movies for the Mesa Redondas (discussions led by students based on a movie). The class dynamic is awkward, her homework and assignments feel like busy work and I really was disinterested and unmotivated to attend this class. She loves the online activities which are never reviewed in class which leads me to another issue; her classes rarely related to the tests. Most of the studying is done independently. But the sacrifice of class time for reviewing relevant topics is not put to good use. I really was unhappy in this class.\n"
        },
        {
            "course_name": "Elementary Spanish",
            "review_date": "May 21, 2009",
            "review_content": "\nI agree with the first reviewer: she is a really nice person, but not that great at explaining the material. Make sure you study EVERYTHING in the book, because there was grammar that we never went over in class that was on the test. However, I disagree that she was a hard grader. As long as you put a decent amount of effort in, you'll get an A (including on the compositions). I would take her class again if I had to do it over because she's fair and the some of the exercises she came up with were really fun and creative. That being said, I don't think teaching is her passion. You know those teachers who are so enthusiastic and love what they're teaching so much that its infectious? Well, she's not one of those. But she does like it enough to impart a decent amount of knowledge with minimal pain. \nWorkload:\nAverage. About 6 or 7 short compositions, 1 or 2 take home assignments, she's OBSESSED with online exercises and those from the red book, a midterm and a final. \n"
        },
        {
            "course_name": "Elementary Spanish II",
            "review_date": "December 21, 2008",
            "review_content": "\nShe is a really nice person,and you can tell that she puts a lot of effort into maintaining an entertaining class. However, she is not always great at explaining the material. In addition, if she ever notices you closing your eyes even for a second she will let you know it. She was also a really hard grader. The compositions were worth 25% of our grade. However, the grading scale used for them was unclear and they were graded ridiculously hard. It did not matter if I spent two hours, or five on a composition, I could never get an A on it. \nSo all in all, she's not a bad person so don't hesitate taking her unless you really want an A in the class.  \nWorkload:\nnot too bad-exercises due once a week\n"
        }
    ]
}