{
    "prof_info": [
        {
            "prof_name": "Alexander Alberro",
            "prof_id": 3921,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to the History of Photography",
            "review_date": "January 19, 2017",
            "review_content": "\nI first registered for History of Photography as a Pass/D/Fail course uncertain of what the workload or expectations would be. I was pleasantly surprised to find Prof. Alberro's lectures on History of Photography accessible and easy to understand. Readings were well-integrated into class discussions during the first half of the semester and the workload was manageable (nothing a bit of studying could not overcome).\nI was fortunate enough to have an excellent TA, which I found made a significant difference in aiding my comprehension of lecture. Molly worked hard to synthesize readings and explain them in a clear and accessible way to students. She took time to read over our work line by line and to offer extensive comments (in legible script), which facilitated studying for projects and exams later in the semester.\nI find many students are hesitant to take courses from graduate students, given perceived \"lack of experience\" and \"unfamiliarity\" with the material. However, I found Molly's explanations to be on-point and her knowledge of the material extensive. As a grad student and teaching fellow, only a few years older than her students, I think she was able to connect with students and clearly explain complex concept more readily than someone far older and ostensibly \"versed\" in the material.\nI appreciate the efforts she made to get to know students individually and to explain her grading of the midterm exam and assignments. Papers and emails were promptly returned, and student questions/concerns were consistently addressed.\nThough I took this course as an elective, I would definitely recommend to students interested in art history as a not too demanding and stress-free course. Alberro cares about his students and adjusts his workload/expectations to reflect the fact that, as Columbia students, we often take more courses than we can handle.\nWorkload:\nOne visual analysis and one research paper\nBrief midterm exam in one hour - 3 short essay questions\nShort final exam - 4 short essays followed by 1 extended analysis\nNot overwhelming for a Columbia Course. Quite manageable.\n"
        },
        {
            "course_name": "20th Century Art",
            "review_date": "May 22, 2015",
            "review_content": "\nThis was an excellent course, and I highly recommend students (non-majors as well) take this course if they have the opportunity. Although Alberro's speech is long-winded, he responded well to questions and encouraged students to ask questions despite the size of the course. \nThe mandatory discussion sections are highly useful and it is important to do the reading, as participation in the section contributes to part of your final grade calculation. I'd say that the discussion section is the most important part of the course, as your TA grades all of your assignments. \nYou can definitely get away with reading the book and skipping lecture, but it is an enjoyable class so there is no real reason to skip. It is also important to understand what Alberro emphasizes throughout lectures, as it informs the questions on the midterm and final in ways that you cannot gleam from the textbook. \nThe grading in the course is dependent upon your discussion section leader. Look at the TA's carefully before selecting a section and consider taking an undesirable time if it means choosing a \"nicer\" TA. \nThe reading in the class are optional. I read the corresponding textbook readings during the first half of the semester, but did not do the readings during the second half. \nAlberro gives you a list of 25 images that could potentially show up on the exams (midterm and final), so you can do the reading after you get that list. The hardest part of preparing for the exams was selecting appropriate secondary texts to support your argument. For each slide comparison on the exam, you needed to incorporate one reading. We go over readings in discussion section, but it is still a challenge. \nWorkload:\nLight. 1 Midterm. 1 1500 word paper (go to museum, select a piece of art and write about it. make sure you are heavy on the visual description side). 1 Final Exam. Mandatory discussion section. Easy enough to get an A-range grade. Gotta work for the solid A \n"
        },
        {
            "course_name": "W3650 20th Century Art",
            "review_date": "May 03, 2015",
            "review_content": "\nThe Power Point images need to correlate with the ideas presented in lecture. 20th century art is very conceptual and theoretical, but I would appreciated lectures that were more directly linked with artworks. We moved at such a rapid pace that we were unable to really focus on any movement.  \nIronically, Alberro is much like the enigmatic artist Jeff Koons. You can never tell if he is being tongue-in-cheek about artwork that was often made to mock its audience. This is strangely appealing, because he seems to mirror the artists at hand. I wish that he spent more time acknowledging the widespread criticism of 20th century work for \"not being art.\" \nSpell Check is not a fan of this class. Alberro makes up his own words, such as \"spectacularist\" and \"anthropomorphical.\" One of his favorite words is \"phenomenological.\" He could condense his longwinded lectures by speaking more straightforwardly.   \nNearly every person in this class was on Facebook, e-mail and other social media websites during lecture. It would be helpful if Alberro banned laptops from the class, because they are extremely distracting. However, it is difficult to pick out the key points in Alberro's lectures. People usually end up typing the lectures verbatim. \nAs an aside, this was the most well-dressed group of students I've ever seen. Be warned that no one wears sweatshirts and jeans to the midterm. Chanel minimalist clothing is a more fitting choice. \nWorkload:\nVery manageable. One essay, midterm, final, and weekly readings that you discuss in section. \n"
        },
        {
            "course_name": "Introduction to the History of Photography",
            "review_date": "April 15, 2014",
            "review_content": "\nI can't recommend Professor Alberro enough. His classes are perfect for the student looking for a light workload. His lectures are great for anyone who has never taken art history and those who have. If you just show up for lectures and discussion, you will be just fine on exams and you will learn a lot of very interesting material.\n I just signed up for my third class with Alberro. He is the most reasonable professor I've ever had. Every way you are evaluated is designed to let you show off what you know. That being said, I have learned so much in his classes. The bulk of the learning takes place in lecture. He always teaches with a conversational tone and makes a conscious effort to explain things in several ways and assumes there are students of different levels. \nNot everyone loves Alberro, but I certainly do. There is nothing better than when he steps out from behind the podium to explain a big idea.  \n\nWorkload:\nLight. Discussion section, standard art history comparisons, but NO MEMORIZATIONS :) \n"
        },
        {
            "course_name": "In/Around Abstract Expressionism",
            "review_date": "May 16, 2013",
            "review_content": "\nI thought Alberro was marvelous. I do not deny that he speaks in longwinded, never ending sentences, but I enjoyed that. He correctly assumes people in the room are coming in with all different levels of knowledge of the material, and he explains things in many different ways to work with that fact. In/Around Abstract Expressionism was a great course, and I feel like I can go to the MoMA and know what's going on, which is pretty exciting for me. He teaches art in a structured way, but often he teaches like he's telling a story. He likes to talk about how artists interacted with each other. He was always the first to point out that the artist we were looking at was ridiculous. He seemed very approachable. I had fun, and I'd recommend any of his classes to friends. \nWorkload:\nThere's a good bit of reading and you will be graded on participation in discussion section...but I didn't do most of the readings. YOU DO NOT HAVE TO MEMORIZE THE DATES, ARTISTS, AND TITLES. When I was studying I was able to really focus on understanding what I was learning, and as a result I know much much more about the art. midterm, final, short 2 page descriptive paper, long 10 page research paper. It really wasn't that bad. What you'd expect. \n"
        },
        {
            "course_name": "20th Century Art",
            "review_date": "June 02, 2011",
            "review_content": "\nThis class is recommended, but not entirely because of the quality of the instruction. I came out of the class far less enamoured by Alberro's \"genius\" (as other reviews have referred it) than when the semester first started. At first, I was blown away by his long-winded, convoluted style of speaking, but realized that when I peeled the veneer away from his words, there were rather banal ideas underneath. His style was rather frustrating to take notes off of, as evidenced by the large number of laptops brought to class to take notes on (or check facebook when Alberro began to ramble). Alberro would begin speaking about an idea, then realize that part of his explanation required another explanation, etc. He would not finish the original idea until a good few sentences (crammed into one run-on clause) later. \nLike a previous reviewer mentioned, going to lecture is essential. The slide comparisons are taken from works that Alberro discussed. However, I would argue that reading the textbook is not essential. Although it is no doubt a very good textbook, it is a very dense work that requires multiple reads in order to grasp the ideas presented. I personally only read through the textbook once before the final and I think I probably retained about 5% of what I read. I was a little lost during lecture sometimes because I did not read the textbook beforehand, but the ideas put themselves in place in my head eventually -- I think that way was much more efficient than having to struggle with the textbook. \nIn addition, I did very few of the readings. If you have a good TA, there is really no reason to do the readings either, as they will be outlined for you during discussion section. And really, you only need to pluck a few sentences of idea out of the *essential* readings in order to incorporate them into the exams. No problem. \nI don't want to say that I didn't care about the content of the class -- on the contrary, I am an art history minor. What I'm trying to outline is the fact that learning in this class is very efficient -- for someone that had only the faintest ideas of 20th century art before the class courtesy of Arthum, I was able to put in minimum effort and still learn a great deal. I didn't do so hot on the final but by getting an A on the essay and almost perfect on the midterm I still walked away with an A. \nWorkload:\nvery little. 1 paper which I did the night before/day of. 1 midterm of 3 slide comparisons (selection of works given out 2 days in advance). 1 final (selection of works given out a week ahead + 1-hour essay on main ideas). \n"
        },
        {
            "course_name": "20th Century Art",
            "review_date": "May 16, 2011",
            "review_content": "\nI loved this class, it was by far my favorite.  I am an art history major as a result.  I thought that Albero was great but I absolutely LOVED my TA, Rachel.  There were weekly assignments of readings but she outlined all the important points so there was no need to actually do them. She was so knowledgeable and super engaging...discusssion section was the best part. \nAlbero was a pretty good lecturer, at points he was a bit boring but BRILLIANT. I loved when he would deviate from his notes and expand upon something he was so passionate about. \nDo yourself a favor, no matter what you are interested in, TAKE THIS CLASS. \nWorkload:\nAs long as the subject matter is of intrest, not hard a lot. requires studying before midterm and final. Wish I had worked a bit harder on paper (5-7 pgs), but still got an A.\nMidterm, final, paper, weekly readings and going to lecture (even if you are only half listening...it really helps).\n...Also no ID's, major plus!\n"
        },
        {
            "course_name": "20th Century Art",
            "review_date": "May 05, 2011",
            "review_content": "\nAs someone who had previous doubts about the value of 20th century artworks, I can now (somewhat intelligently) explain and argue modern and post-modern works.  Unlike many other art history courses, this one is not about memorization - it's about understanding.  With that said, going to lecture is crucial and reading the textbook or wikipedia will not suffice.  Professor Alberro's lectures are very clear and interesting.  You will walk out of every class feeling enlightened.  I personally think this is a great course for non-art history students as well to just increase your general knowledge about art.  Walking through MoMA will never be the same after taking this course - you'll be able to understand and appreciate so much more!  Great course - highly recommended.\nWorkload:\nGo to lectures! Weekly readings. midterm and final (you need to know your art movements, but no need to memorize).  one 6 page paper.\n"
        },
        {
            "course_name": "Introduction to the History of Photography",
            "review_date": "November 10, 2010",
            "review_content": "\nAlberro is awesome. in the very first class he said his main concern as a professor is that his students understand the ideas and how to use them to construct arguments in their papers and on the exams. He kept his word. His lectures were always interesting and i learned a ton. there was a lot of reading, but it wasn't difficult and he often used them in his lectures, which was helpful. If you want a teacher who cares, go check him out.\nWorkload:\nyou can't be a total slacker, but the work was never too difficult. weekly readings (and a response email to the TA) a final paper and a midterm and final.\n\n"
        },
        {
            "course_name": "Introduction to the History of Photography",
            "review_date": "October 06, 2010",
            "review_content": "\nI took Intro to the History of Photography with Professor Alberro the spring of 2010. The man is a genius--which is a good thing but actually sort of a bad thing also. His lectures are his brilliant train of thoughts, which sometimes make sense in a coherent fashion and sometimes confuse you beyond belief. But to be fair, he knows a LOT about photography and art in general. Like I said, he's extremely articulate and very poised. I'm a photographer and I learned a lot of valuable information in this class, not technique related. It's very interesting material if you are an art history major especially. \nHe's very nice, and willing to accommodate for office hours. Work hard and I guarantee you'll get an A. \nWorkload:\nNot bad, readings for each class. Just read the important ones (believe me you'll find out which are important). Midterm, final, one shorter paper that is strictly a formal analysis and one longer one that is research-based.\n"
        },
        {
            "course_name": "Late 20th Century Art",
            "review_date": "May 26, 2010",
            "review_content": "\nThe class is very entertaining, and while Professor Alberro at times can go off-topic, the lectures are engaging and the material is well-explained. This class is very approachable, even for a non-major (which I was), and after taking the class I feel as though I can walk into the MoMA and not be completely confused. Don't expect the syllabus to be followed by the letter - the professor definitely can ramble, and therefore you shouldn't try to read ahead very much, as a lesson that he intends to take one class can take 4.\nWorkload:\nLots of reading, one short paper, one long paper, midterm, and final. The reading is completely optional, especially if you have a good TA that can explain what you need to know (which is usually one paragraph out of 30+ pages per reading). The papers are very doable, especially if you give yourself a little bit of time. The midterm and final are difficult, as they ask you to do three slide comparisons between two works each, and even though the slides are given in advance, the questions are not, and each question is only given 20 minutes, which is a tight time limit.\n"
        }
    ]
}