{
    "prof_info": [
        {
            "prof_name": "Jennifer Sonntag",
            "prof_id": 1935,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "December 19, 2005",
            "review_content": "\nJennifer cares about her students becoming better writers. Dedicate yourself to improving your writing and she will guide you to revising your way into being a good writer. She is completely encouraging while being honest about your work when it sucks and when it excels. She does not use her position to just tear you apart. She uses her influence and comments to build your writing skills.\nThe reading is not heavy but you must do it -- two or maybe three times to write a good essay based on the readings and she can tell when you haven't gotten to know your reading sources -- she will give you an opportunity to correct that. \nHer teaching and guidance on my rewrites positively transformed my writing. \nI think a couple of people in my class got 'A's on one or two papers (I did after 3-5 rewrites) which some other UW instructors won't even consider. \nJennifer will grade you for the work you do not some arbitrary standard of only giving a B or less. \nIf you earn it, she will give it to you whether it is a C- or an A.\nThe only drawback to her class is that she has an attendance and tardy policy. Aaaargh.  \nWorkload:\nStandard UW work.\n"
        },
        {
            "course_name": "University Writing",
            "review_date": "January 13, 2004",
            "review_content": "\nIf you get Jennifer Sonntag for University Writing, you are very lucky. Although timid at first, Ms. Sonntag qucikly establishes a great dynamic with the class. During discussions about the excerpts we read, rather than pushing the class towards a particular focus, she gently guides while allowing the students to expound upon their own conclusions. The topics assigned for the essays were pretty flexible, allowing you to explore your own area of interest (save for the dreaded constellation essay... no one in any university writing section really knew what to do about that). Ms. Sonntag is a very fair grader as well... she is more concerned with the structure and quality of your writing, rather than nitpicky about small grammatical errors or punctuation mistakes. (She'll correct them on your paper, but she won't take off unless it's really bad). Also, you can tell she really puts effort into reading each paper by the lengthy and insightful comments she makes. I feel I grew more as a writer in one semester with this class than in my entire four years of high school. \nWorkload:\nStandard University Writing workload.. 3 essays + a retrospective. Also, towards the beginning of the semester she assigned short reflections on the excerpts we read, although they weren't graded. \n"
        }
    ]
}