{
    "prof_info": [
        {
            "prof_name": "Nathalie Jonas",
            "prof_id": 4257,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Modern Dance I",
            "review_date": "May 04, 2010",
            "review_content": "\nI had fairly high expectations for this course, and they were fully met... Every class Nathalie taught us new things, but was aware of the different levels of ability in the class. She treated the subject seriously and with respect, but also let us have fun with the dances. She also always had us keep an eye on the bigger idea of movement -- how we treat our body and what kinds of effects this has.  She made the class enjoyable and always instructive. The class kept momentum throughout because of her energy and preparation, and the students were always kept in the mindset of movement and dance. Whenever I entered the classroom, all my thoughts were dedicated to the two hours of dance -- I wasn't distracted by anything else because Nathalie managed to engage us entirely. Nathalie is a little insane, but in an endearing way...she's a little tricky in terms of knowing whether or not you fall on her good /bad side in terms of attendance -- she got a little irritable with all the tardy arrivals / absences, but as long as you show up on time / consistently...it'll be okay.\nWorkload:\n2 excused absences, 2 page paper reviewing dance in the city.\n"
        },
        {
            "course_name": "Modern Dance I",
            "review_date": "August 27, 2009",
            "review_content": "\nNathalie Jonas is interesting, lively, somewhat irritable, and insane. She is flexible and understanding about sickness and absences, but the normalities stop there. I took this class because I wanted to have exercise scheduled into my week and I absolutely love dancing though I'm no pro. What I got was disappointing to  say the least. The class was overful and much of the time was spent standing around or doing simple exercises over and over again. We never learned an actual dance routine and had only mastered a twelve-count sequence by the end of the class. I felt like I learned next to nothing about modern dance and wasted a whole lot of time doing simple exercises that never induced a healthy sweat. Nathalie also had a tendency of forcing everyone in the class to pair up and practice exercises that were not only pointless, but personally invasive if you don't have a close friend in the class. If you would like to have your backside groped by several strangers throughout the semester, accomplish a whole lot of nothing, and not even break a sweat, then take her class.\nWorkload:\nOnly two absences are allowed and she accomodates sickness well by allowing you to either make up classes or observe the class from the side. She does expect each student to attend one professional dance event in the city and write a one-page paper about it. This can be fun and interesting, but also inconvenient as she must approve the dance show ahead of time.\n"
        }
    ]
}