{
    "prof_info": [
        {
            "prof_name": "George Saliba",
            "prof_id": 133,
            "total_reviews": 54
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Islamic Civilization",
            "review_date": "December 22, 2013",
            "review_content": "\nI took the full year course of Saliba's sequence to fulfill my Global Core requirement. The classes are pretty similar, but I slightly preferred Contemporary Islamic Civilization (taught in the spring) because it had more interesting readings overall. \nBoth classes are the same- boring lectures, interesting readings, and good TA's. Attendance is required but you can always have a friend sign you in if you guys make a schedule. That said, I always attended lecture because Saliba will basically give you a summary of the readings that are extremely useful for the tests. Essentially, show up and write down what is on the slideshow before going back to your reddit/facebook/whatever to ensure you don't fall asleep\nSaliba himself is adorable. Basically a silly Mr. Feeney that likes to do things like play Shakira when he is bored. \nThe readings are way more interesting than lecture. They're a little biased but I still learned a ton! They're not super long for the most part. In CIC there were one or two novels we had to read (Mahmouz and a Said work) that were fascinating, take the time to read them!\nThe exams are really straightforward. So long as you go over slide notes and the readings and interpret them in the same way Saliba did,expect to perform well. \nOverall, a good global core with a boring lecture, good TA's, and interesting readings that isn't too hard.\nWorkload:\nCIC- midterm, final. Both were 8 quote ID's (interpreting them, not figuring out who they were said by) and a choice of 2 essays from 5 prompts. \nIIC- midterm, final. 20 MC- from the readings, pretty doable, and some essays. \n"
        },
        {
            "course_name": "Science Across Cultures",
            "review_date": "May 09, 2013",
            "review_content": "\nThis class sounded amazing. It was maybe the worst class I've taken in my time here. READ: DO NOT TAKE THIS CLASS.\nThe concept of intercultural science sounds interesting, and it could be - but not with this class. The readings are devastating. They are long and dense - it's like reading ancient scientific textbooks. If fact that is what you are doing - and unless you happen to major in whatever the texts cover (units were astronomy/cosmos, physics, optics and the body) they are impossible to comprehend. There is very little context for what you are reading. Also this isn't reading about things that are fascinating - it's literally a bunch of explanations of scientific concepts (geometrical proofs etc.) - so there isn't much actual culture in the readings.\nThe seminar itself is maybe even worse than the readings. If that was possible. Professor Saliba is clearly a giant (and basically the founder of the field) - but he clearly doesn't realize how far out of touch he is with students who haven't studied Arabic mathematicians etc before. He is also mostly deaf - this means that the discussion format of the class is useless. He can't actually hear what you are saying, so he lets you speak and then just says whatever. The class is entirely composed of non-sequiters. That being said, he's clearly a smart guy.  He also is obsessed with California and grad school. If you aren't ready for either of those things - be prepared.\nProf. Newsome is clearly aware of the problems with the class. He tries to bring in lots of gadgets and pictures to explain the unconquerable concepts. Sometimes they are ridiculous - but overall a really interesting way to learn. The thing is - he is clearly hyperaware of Prof. Saliba's place in the field. He is often too intimidated to actually assert himself to make the class function. \n\nWorkload:\nA lot of really dense readings every week (easily 200+ pages). Prof. Newsome even told a number of the students that he didn't expect we could get through them. They were awful. \nRequired weekly post on courseworks. These form the content for class \"discussions.\" Note class was on Wednesday, posts were due Sunday night. So that's when you had to get at least some of the readings done by - three days before class.\nThree papers over the course of the semester (5-7 pages each). Problem is there is absolutely no guidance - we were told write what will be interesting to Prof. Saliba. With material this dense this isn't an easy feat. It honestly would have been much easier if there was some direction.\n"
        },
        {
            "course_name": "Contemporary Islamic Civilization",
            "review_date": "May 02, 2013",
            "review_content": "\nI am majoring in this subject, and happen to be passionately academically enthralled with the material, and this was by far my least favorite class of the semester.  From the very beginning, Professor Saliba told us that our goal in this class was to get a good grade.  In class, I felt I learned absolutely nothing.  He spent nearly every period (except the first two where we watched a movie, one where he reviewed Israel/Palestine, India/Pakistan, and Kashmir, and two where we watched biographies of Um Kulthum) going over the readings for the week, week by week.  As \"nice\" as it was to have such a through review for the midterm and final, I am leaving feeling totally drained of one semester's worth of a course.  I took the class to learn about the Islamic world, and instead spent the semester learned what Saliba's interpretations were of different writers.  My TA was the only thing that kept me from dropping the class because he was so fantastic.    \nIf you are a major, or interested, I do NOT recommend this class.  As a side note though, the midterm was immensely easy and fun (if you like writing about the Islamic world and its history).  \nWorkload:\nWeekly posts for the discussion section.  \n1 Midterm.  1 Final.\n"
        },
        {
            "course_name": "Contemporary Islamic Civilization",
            "review_date": "June 09, 2012",
            "review_content": "\nI took CIC last semester to fulfill a core requirement and was really pleased with the class. For someone with very little knowledge of the Arab world, I still wasn't lost in the material. I thought the syllabus was structured so well. There was about a week of introducing us to the broad themes before we got into the meat of the pieces, which all related to each other even as the writers spaned across time periods/countries/religions/etc. \nThe particular TA I had required us to post a one page paper each week overviewing the pieces we had read, and to prepare one presentation during the semester. This was taxing and I hated it at 9:30pm on a Tuesday when I had two and half hours to wade through tons of (sometimes very dense) material and write something about it. But when the midterm and final rolled around, I was so thankful for the instant study guide I had. Columbia students are smart, and even if I didn't understand or totally remember a certain work, I could rely on my peer's responses to the week, as well. \nTruthfully, I was terrible at paying attention during the lecture and took sporadic notes throughout. The discussion seemed fairly useless only because 50 minutes is such a short time to try and cover a week's worth of material. It would be far too easy to totally slack off in this class, which is why I appreciated the forced posts every week because then I had to get through the material. Not getting anything back all semester except the midterm made me completely unsure of my grade until the bitter end (and it took FOREVER for grades to be submitted at the end of the semester as well), but I ended up with a B, which was good enough for me. \nWorkload:\nThe readings vary week to week, from sometimes quite a bit, to not so much at all. I didn't read any of the books. The weekly workload was dependent on the TA. Attendance is taken.\nOne midterm and one final. \n"
        },
        {
            "course_name": "Contemporary Islamic Civilization",
            "review_date": "May 09, 2012",
            "review_content": "\nI took the second (spring semester) of Contemporary Islamic Civilization. \nGeorge Saliba is a pleasant individual. He has a vivid manner of conducting his classes and if you make it to the end of the semester, you will enjoy a few classes of Arab music. \nThe first half of the semester revolves mainly around Arab/Islamic and other thinkers. The second part of the semester involves discussions about theatre, poetry and music.\nImportant note. Saliba expresses his personal understanding of the readings in class. These are subjective observations and must be taken with a grain of salt. He has apparent political inclinations that he subtly instills, so stay alert and don't take what he says for granted.  \nThe exposure to a well-constructed diversity of thinkers is a positive element. \nI would recommend this course to anyone who wishes to gain some insights into the Arab world. This was especially relevant in light of the developments in the Arab world. Saliba relates to contemporary issues too. On that note, Saliba often trails off topic to discuss an interesting example or topic. Though interesting and enriching - they won't appear in your midterm or final. \nDiscussion leaders vary, they grade differently and have different requirements so hope for the best. \nWorkload:\n3 books over the whole semester.\nOn average 25-30 pages per week.\nYou could manage getting through without reading every word but reading will make class and mainly discussion, more interesting. \n"
        },
        {
            "course_name": "Introduction to Islamic Civilization",
            "review_date": "January 11, 2011",
            "review_content": "\nNote to future students: do not purchase every book the professor lists, because he scans all of the excerpts into Courseworks for you to print out; you really only need to purchase Islam by Fazlur, because you're expected to read the whole book.\nA lot of students enroll in this class expecting to receive an easy A minus, but I want to warn future students ahead of time that you will need to work for even a B+; I know a few people that made extremely poor grades in this class, so don't think you can just breeze through the semester.\nThat said, I made an A. How did I make that A? I showed up for almost every single class, I spoke during discussion sections, I actually did all of the readings, and I made it known to both the professor and my TA that I wanted to learn the most that I could from the course. This is a large class and it's very easy to become invisible, and it's definitely impossible to speak up during class, so I suggest trying to go to at least one office visit with the professor, but make sure the visit is for a valid reason; for instance, perhaps you could ask the professor to clarify a point he made in class or ask for additional information on something you were interested in.\nAlthough the class covers a great deal of information, the midterm and finals are very doable if you keep detailed notes. I suggest writing small blurbs about each individual you cover in class, remembering the major battles and confrontations, know the publications of scientists that you cover toward the end of the class, and have something interesting to say in your essay that shows you can think outside of the box and do more than memorize. Also, as there are so many readings in this class, I suggest writing a few lines about every reading assignment so that you don't have to re-read anything while studying, and can just use your notes; big time saver!\nCommon sense suggestions: attend class (attendance is counted), write as many notes as you can (information from the slides WILL appear on the midterms and finals), read the assignments, and attend your discussion section, because your discussion grade is worth 20% of your final grade; that means you need to actually not sleep through your discussion section, so be honest with yourself when you enroll in your section. \n\nWorkload:\nMidterm: 40%, Final: 40%, Discussion: 20%. A curve is applied to your final grade. Expect 70-100 pages of reading a week; write tiny summaries of each reading to help yourself. Your TA is responsible for designing your homework, so you may have one that requires essays or summaries of reading, but all of the homework is just designed to determine if you actually read anything. \n"
        },
        {
            "course_name": "Contemporary Islamic Civilization",
            "review_date": "December 06, 2010",
            "review_content": "\nSaliba is a wackjob. He rambles on and on and on and doesn't seem to understand the concept of a comma or a period when he talks. He's the kind of professor you will talk about to your friends while quoting the funny stuff he says.\nWrite down everything on the slides and you will be fine. Three or four times a semester someone will ask him to go back to a slide they missed and Saliba will get pissed and turn off the powerpoint saying \"Listen to me and not the slide!\" Then when he puts the powerpoint back on, continue copying down the slides. On a side note, don't be the jerk that asks him to go back.\nGo to class and discussion, attendance is required. Bring a computer and go on the internet when you get bored. Read enough that you can participate in discussion section so your TA doesn't hate you. Use Wikipedia to help you study, especially with the authors in CIC.\nOne thing I will say though, it's difficult to get a straight A because of the damn curve. I know people who have gotten 90+s on both the midterm and final and still got an A-. That said, it is pretty easy to get an A-/B+ provided you don't piss off your TA, and I'm guessing if you are looking to get in a class like the one I've described so far, an A- isn't exactly going to kill your GPA.\nWorkload:\nIIC- Attendance, In class Midterm, Final during Finals week, mandatory discussion section\nCIC Attendance, In class Midterm, Final Paper due the last day of class, mandatory discussion section\nThe very fact that a class like this with so little workload is 4 credits is ridiculous and makes it a class everyone should take. It actually boggles my mind that I got 8 credits for two semesters of this stuff\n"
        },
        {
            "course_name": "Contemporary Islamic Civilization",
            "review_date": "June 01, 2010",
            "review_content": "\nSaliba is a good natured, white-bearded little man in a cowboy hat and quite approachable. As a person you will find his humor infectiously endearing (He has a phrase: \"Holy Tabouli!\"). As a scholar he's, like every other professor at this institution, very remarkable. As a lecturer you will, at at least occasionally, no matter how studious you are throughout, be reduced to 1) surfing Facebook/online poker/Netflicks, 2) doodling on your notebook margins.\nAll in all if you're humanities-aversive and you want to get your history requirement out of the way either course, IIC/CIC is a good way to go and you inevitably get something out of it. Just go to class (Attendance counts.) Take his notes diligently and read them. I kid you not. From the midterm to the final of CIC I didn't read a half of the assignments. As long as you write what he says on the exams and you're specific and relevant in your evidence, you can get an A-/B+ easily enough.\nI thought CIC was more interesting the IIC; it's more up-to-date in the events and probes more questions that have more relevance in the going-ons of the Middle East today. But CIC is structured somewhat less of a history class than IIC; you'll read much about political movements in the Arab World (he tends to focus mostly on the AW, to his chagrin) and literature (he's a big literature buff in both courses). I thought it was interesting to pull from so many different sources, but personally I would've liked to stick to a historical lens. If you want to learn more about Islamic Civ in South or Central Asia or Africa, this isn't really the course.\nDisregard him in totality when he says, \"Don't pay attention to my notes on the screen.\" Write them.\nWorkload:\nYou'll have to sit a midterm and a final for both courses, 20% and 40% respectively; the remaining 20% is based on your discussion section participation, which is once a week. You may have to present briefly for discussion. Take Kamal for CIC. By the way -- make sure you do sign up for a discussion section; get your place early!\nSometimes you'll have as little as 20 pages a week and as much as 100 and more, but you don't need to read that much as the only thing that really matter are his notes.\n"
        },
        {
            "course_name": "Introduction to Islamic Civilization",
            "review_date": "May 26, 2010",
            "review_content": "\nProfessor Saliba's class will be useful to you if you come to it with reasonable expectations and prepare adequately.  To begin, as survey course it is pointless to expect any epoch to receive in-depth coverage.  Saliba is a good lecturer, and I would describe him as a jolly Arabic Santa Claus wearing Indiana Jones' hat.  His area of expertise is Arabic Islamic science from about the time of the Crusades until about the European Renaissance, so that's the most academically interesting epoch covered in the class.  The biggest take home point from that part of the class is this: after the Roman empire's decline, Islamic civilization grew and developed.  It assimilated Greek and Roman ideas and used these to develop novel ideas and approaches in fields like algebra, optics, medicine, and astronomy.  This section fascinated me, since it filled in a lot of gaps left by Lit Hum and traditional intellectual histories taught in American schools.  Apparently, civilization still developed during the thousand years between the decline of the Roman Empire and the European Renaissance.  Saliba getting fired up as he explains the Arabic Islamic underpinnings of Copernicus' heliocentric theory of the solar system was the best lecture in the course.  However, as the history approaches the colonial era near the end of the course, the politics of post-colonialism come out, and these will be jarring to a lot of students.\nIt's useful to have read Edward Said's \"Orientalism\" (or to be familiar with its thesis) if you're taking any MESAAS (formerly MEALAC) courses, since these ideas saturate the department.  Said writes that the West / Occident studies the East / Orient from a position of power.  The enduring discourse about the Orient is that it is exotic, strange, depraved, despotic, static, and ultimately inferior.  This discourse was developed in the West, by the West, and for the West.  It is utilized economically and militarily to define the Orient and to control it.  \"Orientalism\" has had a giant effect in the academic world, and has been taken up by a variety of academics and writers for various political purposes.\nLike any academic school of thought, the post-colonial discourse has its share of ridiculousness and excess, and some of these ideas creep into Saliba's class.  He does not differentiate between valid cultural transmission of ideas and \"the colonized mind.\"  To listen to Saliba, it would seem every European idea or practice taken up in the non-European world is invariably the result of colonial domination, and therefore must be opposed and rejected.  He opened up one of the last units talking about reformers in the Islamic world.  One of the reformers mentioned is Sayid Qutb, an Egyptian writer whom Saliba compared to Martin Luther of the Protestant Reformation.  What Saliba failed to mention is that after Qutb was hanged, his brother Muhammed continued teaching his works in Saudi Arabia.  There he found an eager student in Ayman Zawahiri, who later mentored Osama bin Laden.  Comparing Martin Luther to the intellectual forefather of al Qaeda in an Intro-level course without any qualification or explanation seems a little careless to me.\nSo, overall, I'd recommend the course, but with a few qualifications.  Do not raise your blood pressure by getting pissed off at post-colonial discursive excesses.  You're a big kid going to an Ivy League school now: you are smart enough to filter out the bullshit while taking useful lessons from the class.  The class is a good basic overview of Islamic history; if all you want to learn is the difference between Persians and Arabs, this class will be enough, and if you want to delve deeper, this class will whet your appetite.  If you're taking it for a cultural diversity requirement, don't expect an A unless you are an overachiever.  There are enough students taking the class for their major that the competition is pretty intense.  Conversely, there are lots of kids who don't give a shit in the class.  They surf Facebook and watch movies during lectures, and they pad the bottom of the curve, so if you are taking the class for your major, shop around early for a section full of Long Island Princesses and slack-jawed bros wearing Columbia jerseys.\nWorkload:\nDepends heavily on your TA.  Everybody is assigned the same weekly readings, with additional assignments managed by individual TAs.  Keep in mind that you compete for your grade with the students in your section.  My TA, Mimi Hanaoka, gave light response queries for each week's readings and heavily weighted class responsiveness, making my section rather laid back and enjoyable, but one of my friends was in a section where murderous amounts of work were assigned and all the students were gunning for an A, making it the equivalent of an extra class.  Be very choosy about your TA and section.\n"
        },
        {
            "course_name": "Contemporary Islamic Civilization",
            "review_date": "May 24, 2010",
            "review_content": "\nHonestly, this course was very disappointing.\nIt really takes an academic or philosophical approach to issues in the Islamic world.  Rather than discussing the modern Islamic world concretely, the course focuses on the intellectual movements of Islamic (mostly Arab in the case of this course) thought over the course of the last 150 years.  This was not bad, per se, just not what I expected.\nWhat is bad is that Saliba is a horrendous lecturer.  He doesn't plan out his lectures, goes on 20 minute digressions, and pays only lip service to the readings.  He thinks making good powerpoints distracts students.  One week, we did nothing but listen to Umm Kulthum.  There is an attendance sign in sheet, so you can't skip too much.\nThe recitation was useful, but at only 50 minutes a week, we never had time to cover the all of the week's material.\nGrading was arbitrary.  The midterm and final were both not particularly in depth or demanding, so your grades depended on how your recitation leader liked your style of response.\nWorkload:\nAnywhere from an hour to four hours of reading a week (30 to 100 or so 8.5 x 11 single spaced pages).  Midterm 40%, Final 40%, attendance and participation 20%.  Grading was arbitrary.\n"
        },
        {
            "course_name": "Introduction to Islamic Civilization",
            "review_date": "December 25, 2009",
            "review_content": "\nProfessor Saliba is a decent professor.  His class is entertaining and easy to follow along if you are interested in Islamic Culture.  It is definitively NOT an easy A like some others have suggested.  The issue with his class is that the curve is completely dubious.  Students are curved only within their recitation class which means that the final grade is completely arbitrary and does not reflect the student's overall performance.  This means a 80/100 student could get a better grade than a 90/100 student depending on their recitation group. Also, he likes to interject his own political opinions into an otherwise fact based class.  This seems to be common procedure in the MEALAC department.  \nWorkload:\nDo the readings and make sure you participate properly in the recitation sessions and you'll be fine.  \n"
        },
        {
            "course_name": "Contemporary Islamic Civilization",
            "review_date": "November 14, 2009",
            "review_content": "\nThis class is a fantastic way to fulfill the Major Cultures requirement... in fact, it's a great class for anyone who likes having a high gpa, not doing a ton of work, and reading some relatively interesting material relating to the problems and debates in the twentieth century Islamic World. Professor Saliba's lectures are relatively boring and after the first few that give a broad overview of key issues (useful for the midterm) they are basically a summary of the readings. There is really no point in going to class after the midterm except to sign the attendance sheet (annoying) because the grading is based on discussion section attendance/participation, the midterm, and a final paper (that's right, no final exam!!). Therefore, once you figure out your paper topic, my recommended strategy is to come to class with no books, sign the attendance sheet, and walk out five minutes later pretending to go to the bathroom (that was what I did most of the time post midterm and I aced the class). \n         Do not take this class if you desire an intellectually honest debate on Israeli-Palestinian issues. I'm relatively pro-Palestinian but even I was offended by Saliba's obscene bias whenever the topic came up, though from what I hear his views are pretty standard for his department. I felt bad for some of the Jewish kids in that class. Look for opportunities to shamelessly trash Israel in your midterm essays; don't bother being subtle. \nWorkload:\n3 hours or so of reading a week, definitely do not need to do all of it. 2 novels are assigned but nobody reads them. Weekly discussion section postings, midterm, final paper on a topic of one's choice. Pretty easy for a 4 point class. Generous curve giving around 40+% of the class A- or better.\n"
        },
        {
            "course_name": "Contemporary Islamic Civilization",
            "review_date": "September 03, 2009",
            "review_content": "\nDon't hate on Professor Saliba.  He has clear expectations and a great sense of humor - unlike most Columbia professors.  His class can be boring and attendance is mandatory.....so bring other work to do!  I wrote many papers while sitting in his class and you can totally absorb the information without taking notes.  You will learn something in his class, I promise.  It might not be the most enlightening hour and fifteen minutes of your life but it is an easy, 4 credit A that is completely worth the time.  If you enjoy Princeton jokes and getting good grades, take this class.\nWorkload:\nMedium amount of reading that varies week by week.  Stay on top of it or read it during lectures so you won't be overloaded for the midterm or final.  Some TA's will give you reading quizzes or ask for responses to the readings.\nIntro has 2 exams - a midterm and a final.\nContemporary has a midterm and a final paper that can be on a variety of topics.\n"
        },
        {
            "course_name": "Contemporary Islamic Civilization",
            "review_date": "August 07, 2009",
            "review_content": "\nFirst off, I think professor Saliba is one of the most talented professors I came across at Columbia. Actually, he's one of those professors that will have a life-long effect on the way you think of the Middle East. I took both his classes and I admit that I learned  much more in the Intro to Islamic Civilization course. However, as a student of Arab descent, when I took his contemporary Islamic Civilization class, I didn't learn much. Not that Saliba doesn't introduce interesting material, but his contemporary course is very focused on Arab heritage and culture. If you're an Arab student, it almost feels like your listening to your grandma in the Middle East talk about the good ole' days of Beirut or Cairo. I personally thought the contemporary course hardly emphasized anything relating to Islam; it was a great overview of secular Arab culture.  In other words, you won't learn much about terrorist groups or their origins or any of the modern Islamic extremism. \nSaliba is actually a very funny man, but you will only understand his humor if you're of Arab descent. Believe me when I say this, but he will remind you of your grandparents back in the Middle East.  \nLast word of advice, don't take the contemporary class if you're of Arab descent or very familiar with Arab culture/ heritage because you won't learn much. It's definitely an easy A class if you're familiar with Arab culture.  For the intro class, you will actually need to do some extra work regardless of your familiarity with Islam or Muslim heritage. \nWorkload:\nVery light for the contemporary.. Need to study the lectures well for the intro. \n"
        },
        {
            "course_name": "Contemporary Islamic Civilization",
            "review_date": "June 16, 2009",
            "review_content": "\nSaliba's lectures are dry, and it's hard to pay attention, especially in the second half of the semester when you know the information is irrelevant to your grade (there is no final). Saliba's class is light on the work, but he limits the number of flat As to about 25%. Which means that you have to take tests well, write good papers, and impress your TA to get a solid grade. I've been reading the other reviews and there is a very strange trend: the vast majority of the reviews paint Saliba's class as boring and easy, yet almost all the reviews have far more \"Disagrees\" than \"Agrees.\" I wonder why that is...wouldn't be surprised is Saliba is lurking on these forums...\n"
        },
        {
            "course_name": "Introduction to Islamic Civilization",
            "review_date": "June 10, 2009",
            "review_content": "\nPossibly the worst class I've taken at Columbia. The lectures were incredibly boring and consisted of Saliba rambling about whatever topic he pleased, usually only tangentially related to the class. The readings he assigns in the textbooks and coursebook are not particularly well chosen either -- I would've appreciated more context and structure. Saliba considered himself a riot, but I felt that he was trying too hard with everything he said. \nFor both the midterm and final, I studied off almost purely Wikipedia (the class has no central text and Saliba's lectures were not particularly helpful) and I got an A. If you're looking for an easy A class just to get your Major Cultures requirement over with and are willing to waste 150 minutes of your time each week for that, perhaps this is the class for you. But if you're looking to actually learn something and to stay awake in class, stay AWAY.\nWorkload:\nMandatory recitation sessions, very light readings, midterm, final\n"
        },
        {
            "course_name": "Contemporary Islamic Civilization",
            "review_date": "May 07, 2009",
            "review_content": "\nI'm torn between disgust and pity for Saliba. The first day of class, he revealed that attendance was mandatory. He them gave a ten minute scare speech about how he would know if we signed someone else's name on the attendance sheet. He's so naive. He's also baised...very baised. Though the readings present both sides of the issue, his commentary is mostly just his unsupported view of what's right and what's wrong. He just stands at his podium, king of the lecture hall. Sometimes, he stops mid-sentence because someone has made too much noise talking to his friend, or because someone has, after signing the attendnace sheet, made a break for the exit. \nSaliba has these power point slides that are written in the same full sentence, choppy english that he speaks in. It's as if someone recorded him speak, and then typed up his words exactly. People copy down his slides word for word--Saliba hates this. At least once a class, he stops to chastise students--he claims it won't help on the midterm, which primarily consists of a few quotes from the reading that students must \"comment\" on. Despite Saliba's insistence to the contrary, notes on his power point slides are UNBELIEVABLY USEFUL for the midterm. \nPerhaps the most absurd thing about this course, and what attracted me most to it, is that there is no final.. As someone who hates to work and loves an easy A, I thought this would be perfect for me. But, mandatory attendance + no incentive to pay attention + Saliba's empty threats --> my boredom/pity > pleasure from easy A/no work.\n\nWorkload:\nmidterm...no reading necessary if you copy down the slides exactly. Final paper (8-10). Sooooo littttle. \n"
        },
        {
            "course_name": "Contemporary Islamic Civilization",
            "review_date": "May 06, 2009",
            "review_content": "\nThis review is meant to cover both halves of the sequence, Introduction and Contemporary. Both classes are run in an identical manner, with only one small difference (scroll down to \"workload section for more details).\nProfessor Saliba is, simply, one of the finest professors I have had at this school. He is a kind yet quirky old man who has no problems talking one-on-one with you, despite what you may have heard about him. The courses he teaches deal with a region of the world that we hear about on the news all the time, yet have next to no \"real\" knowledge about - the Middle East and the Greater Islamic World. If you take these two classes you will learn a great deal about them, and many of your pre-conceived assumptions and stereotypes will be shattered. And Saliba's thought-provoking (yet hilarious) lectures and tangents only help you learn more. His occasional side comments will make you chuckle as well!\nIntroduction to Islamic Civilization, the first half of the sequence, covers the rise of Islamic Civilization from its humble beginnings (~600 AD) to the early 20th century. Contemporary Islamic Civilization picks up where Intro left off, and goes up to present day. Please note that this course is NOT an Islam class. There is a separate class for that under the Religion department. The class focuses on the civilizations that were created as a result of Islam, not the religion itself.\nAnd what, may you ask, is Saliba's role in this class? Lectures consist of him going over the readings and analyzing them thoroughly, with the occasional tangent thrown in every now and then. During lecture Saliba uses a powerpoint with the main points of that day's lecture written on it. Now, here's a bit of advice - you don't necessarily have to write down anything. No notes, no nothing. What I did was take my laptop and scramble to write down every word written on the powerpoints. However, this is completely unnecessary and will only distract you from actually listening to what he has to say, which ironically will help you learn the material better than if you wrote down the notes. You should note that he is not the one who determines your final grade - that task falls to your TA, so pick a good one.\nAlso, don't pay attention to some reviews here that paint Saliba as some pro-Islamic, anti-Israeli bigot... one of the things that makes Saliba a great professor is that even though he does favor one side, when he teaches he gives an objective analysis of the history and circumstances. In particular, his explanation of the ongoing Arab-Israeli conflict, the Kurdish question, and Kashmir were very informative and neutral. They could not have been done any better. Anyone who disliked the man obviously had a problem with his personal opinions and not with his abilities as a professor, so don't listen to them.\nAll I have to say is, just give this guy a chance. You'll walk out both entertained and enlightened over a subject your fellow countrymen (assuming you are American) know nothing about. Personally, I will greatly miss having Saliba as a professor next year and would definitely take another class with him.\nWorkload:\nFor both Introduction and Contemporary:\n+ Weekly Readings: Anywhere from 2 to 5 articles are assigned a week. Each week's readings revolve around a theme or concept. Total pages can be anywhere from 20 - 100.\n+ Weekly responses to the readings\nFor Introduction only:\n+ 1 Midterm. This consists of 3 sections: explanation of randomly selected quotes (ie one/two line excerpts) from the readings, multiple choice, and short answer. If you only listen to what he has to say during lecture and you actually do the readings, this is hilariously easy. If you don't, you'll be quite screwed.\n+ 1 Final. Same exact layout and rules as the midterm.\nFor Contemporary only:\n+ 1 Midterm. This consists of 2 sections: quote explanation and short answer. Same rules as the Intro midterm.\n+ 1 Final Paper. This is completely self-directed and is due on the last day of class.\n"
        },
        {
            "course_name": "Contemporary Islamic Civilization",
            "review_date": "December 22, 2008",
            "review_content": "\nHahaha Saliba. This man is hilarious. He is very small and he speaks in this microphone that broke EVERY SINGLE CLASS so each lecture was basically him waiting around for the tech people to come fix it, and then we still couldn't really hear his voice. However, that didn't matter because the lectures were disorganized, boring, and completely irrelevant to any reading which we did. I stopped taking notes the third class, and although attendance is mandatory and I did come and pay attention, lectures were mostly exercises in enjoying this man's hilarious streams of consciousness and random tangents. He did give us the chance to have dinner with him, and he was really knowledgeable and sweet in person, but as a professor he's kind of laughable. The TA sections were unnecessary except for the huge TA review session right before the (easy) midterm, but the readings in the coursepack were actually really interesting and relevant, and the paper was fun to write because it was completely self-directed. All in all, easy class, hardly any work, much easier than many other Major Cultures are. \nWorkload:\n\"Reading\" for every class, mandatory attendance to both lecture and section, a midterm and a final paper. Grade is totally controlled by TA, so make sure your TA is good.\n"
        },
        {
            "course_name": "Contemporary Islamic Civilization",
            "review_date": "June 29, 2008",
            "review_content": "\nI'm not sure I've ever been so bored in my life - seriously. Saliba's words are strongly biased in favor of Islam, but in all honesty his lectures mean very little when it comes to your grade. The midterm is based on readings from the coursepack (skim them, if that), discussions are completely based on your TA, and the final is a take-home 10-12 page paper on a topic of your choice pertaining to Islamic Civ. Attendance is mandatory (he has a weirdly photographic memory, plus you have to sign in each day), but especially after the midterm the number of people who actually go to class is a bit laughable. Most alternate signing in their group of friends, or they leave after they've touched the attendance sheet. Bring something to entertain you during lectures, but I'm guessing this will be as easy a Major Cultures class as you will get. \nWorkload:\n20% discussion (participation, assignments if you have them...this totally depends on which TA you get), 30% written in-class midterm (easy), and 50% final paper that is 10-12 pages and due on the last day of class. Not difficult at all.\n"
        },
        {
            "course_name": "Introduction to Islamic Civilization",
            "review_date": "April 24, 2007",
            "review_content": "\nWhile he can be fun and funny, generally, the lectures are disjointed, repetitive and boring.  The TA section was just as pointless. This class would have required a fair amount of work,and been more challengin, however, I bought the \"blanknotes\", which have notes on the class and the readings. Look for signs to buy these when the semester starts and you won't have to buy any books, do any readings or show up to lecture, and you will get that easy, beefy 4 point A.\nWorkload:\nA lot of Reading. midterm, final\n"
        },
        {
            "course_name": "Introduction to Islamic Civilization",
            "review_date": "October 23, 2006",
            "review_content": "\nYou have to give this guy a chance.  Not only is he a great professor and does he genuinely care about every one of his students, but he is a pretty bright and interesting guy as well. (In addition to his expertise in the subject, which is extense, he holds a Masters in Mathematics and a Masters in the History of Science.)  I personally find the classes tolerable to fascinating and the readings well-organized.  He started off not following the readigs but has since started to discuss each one of the readings in detail.  NOTE:  This class is not on Islam...It is about Islamic Civilizations (stress the civilizations).\nRegarding the other [mostly negative] reviews...I would bet that most of these reviewers had problems with Saliba's opinions.  \n***[Check the \"do you agree with this review\" part under every review to see what the majority really thinks.]\nAnd on that note, I've heard that he's toned down his opinions drastically:  I am currently  halfway through the class and he hasn't said a single thing against Israel.\nWorkload:\nThe readings can get kind of lengthy (about 100 pages of source-ish material per week).  Saliba mentioned that he follows the normal CC grading guidelines, which I can't remember verbatim but were something along the lines of...3.7% get an A+, ~20% A, ~20% A-, etc.\n"
        },
        {
            "course_name": "Contemporary Islamic Civilization",
            "review_date": "August 24, 2005",
            "review_content": "\nThe class is easy. There is hardly any work (I probably spent 2 hours TOTAL-for the entire semester-for daily class preparation and homework). VERY EASY A. \nThat said, you aren'g going to learn much from this class. While Saliba is very nice, his lectures are disorganized, and the readings non-sensical in connection to what he's teaching. If you want to actually learn about Contemp. Islamic Civ, there has to be abetter class out there. But if you just want an easy A to get your major cultures done with, this is the class for you.  \nWorkload:\neasy midterm, 8-10 page final paper. \n"
        },
        {
            "course_name": "Contemporary Islamic Civilization",
            "review_date": "March 21, 2005",
            "review_content": "\nSucks. Professor preaches more than he teaches, and anyone who sits though his lectures can see why he's up to his neck in bad press. The whole concept of this course ought to be rethought, especially since this is likely one of the most important fields that a university can teach in this day and age. Sure he's entertaining, but that's really no the point. He's dismissive of important issues and worse, he's so blinded by his own opinions that he cheats his class out of a learning experience.\n"
        },
        {
            "course_name": "Introduction to Islamic Civilization",
            "review_date": "January 04, 2005",
            "review_content": "\nIf youÂ’re looking to build yourself a perspective on the Middle East, or on modern international political relations, or even an impartial understanding of the history of Islamic culture itself, then keep looking. Fine, SalibaÂ’s a riotÂ…but it seems like I tried to register for Islamic Civ and accidentally hit the Varsity Show. Some of the readings are OK, but neither he nor his TAÂ’s spends nearly enough time discussing them meaningfully, especially given they are the only source of exam questions. Speaking of the exams, which together make up 80% of the grade, the short answer and essays are pretty obvious, as long as your TA is willing to grade you fairly on them, but the multiple choice is incredibly confusing. He says that they are meant to be clear-cut, but all his petty humor gets filtered into this section, and diverts attention from the Â“clear-cutÂ” objective. But apparently this is the way the previous reviewer operates. DonÂ’t take this classÂ…if your interested, youÂ’re better off just reading about it on your own. \n\nWorkload:\nMidterm (40%), Final (40%), Weekly discussions with required short write-ups. \n"
        },
        {
            "course_name": "Introduction to Islamic Civilization",
            "review_date": "January 02, 2005",
            "review_content": "\nThe easiest A+ I have ever gotten.  All you have to do is show up to class (he takes attendance at every class) and do the reading and you're golden.  I only studied for the midterm and final each for about 3 or 4 hours.  But if you're interested in learning about Islam, take another course.  I barely learned a thing.  The lectures are rather boring, aside from the occasional joke that Saliba cracks.  If you want an easy way to fulfill the Major cultures requirement and you don't care, take this class.\nWorkload:\nmidterm and final (not cumulative), weekly responses to the readings\n"
        },
        {
            "course_name": "Introduction to Islamic Civilization",
            "review_date": "December 29, 2004",
            "review_content": "\nProfessor Saliba is the teacher you've always wanted!  He's is definitely a character. He'll joke around during lectures because they'll wake you up from your \"nap cats\". All in all, the sweetest professor at Columbia and worth having a conversation with during his office hours...even if you're not in his class.\nWorkload:\npiece of cake, recitation is worthless, readings can be pretty interesting\n"
        },
        {
            "course_name": "Introduction to Islamic Civilization",
            "review_date": "December 26, 2004",
            "review_content": "\nLectures are very boring. Weekly recitations are a waste of time. Midterm and final both were quite challenging. I don't know the way he structured previous classes but this is definitely not a class to get an easy A in. \nWorkload:\nWeekly reading and recitation section, midterm, final.\n"
        },
        {
            "course_name": "Contemporary Islamic Civilization",
            "review_date": "September 04, 2004",
            "review_content": "\nThe failings of George Saliba have nothing to do with his opinions, which he is entitled to, but the fact that he is so intolerant of others opinions and at times so scatter-brained that he cannot remember his own. I think he is one of the worst professors at Columbia. Horrible lectures, junk drawer readings, and no cohesion. It is really a shame that Columbia doesn't fill his most important of posts with someone worth your time. In this day in age we could use a professor who could give a window on the Islamic world, not someone just looking to spout off in useless rants in front of students. \nWorkload:\nEasy A\n"
        },
        {
            "course_name": "Contemporary Islamic Civilization",
            "review_date": "May 13, 2004",
            "review_content": "\nSaliba is a good, not great, teacher.  On the first day, he got a little crazy and went on a couple anti-Israel rants, but after we got into the readings, he seemed to settle down.  The course is entitled, Contemporary Islamic Civilization, but the readings only stretch from Jordan to Iran.  You read some interesting essays and treatises, but a lot of them are based on fuzzy logic and nebulous history.   My TA (Hossein) was great in leading discussion and pointing out where and how these works failed and succeeded in making sense.\nAnother thing about this course is that the role Saliba has in this class is to come in twice a week and lecture, whereas all of the learning occurs in the section.  This is not necessarily a bad thing, as Saliba's lectures are usually interesting, it just means you have to choose a good TA.\nWorkload:\n2 papers.  Weekly discussion questions.  FInal.\n"
        },
        {
            "course_name": "Contemporary Islamic Civilization",
            "review_date": "May 03, 2004",
            "review_content": "\nHat's off to George Saliba, at his age he is sharp as ever with a great sense of humor. He adds some great perspective to the class which gives people an understanding of Middle Eastern politics. If you do not take this class for your major culture's requirement, you are missing out. it is professor like Saliba which keep the name of Columbia.\nWorkload:\nEasy\n"
        },
        {
            "course_name": "Contemporary Islamic Civilization",
            "review_date": "July 08, 2003",
            "review_content": "\nSaliba is one of the BEST PROFESSORS at Columbia.  People do not like him at times because of his political views.  I for one disagree with him on just about everything, but the debate he raises strengthens peopleÂ’s political convictions.  He forces you to think through your position, no longer will you simply hold the beliefs of your parents, and you will form your own.  Yes he is Pro Palestine in a big way, but the point of University is free thought and a chance to hear opinions that will never make the back page of the NYTimes.  LetÂ’s face it the MELAC department is a hot subject, but would you rather that everyone held the same opinion?  Saliba is an example of democracy at work, and for that he should be praised and championed.  His class is an essential part of your Columbia education.  Yeah, Saliba uses his class as a bully pulpit.  But, that is why he is here.  The man has lived life rather than simply read about it.  Yes his class is political but he gives every point of view that is needed for balanced debate.  I was unhappy with the grade I received in his class, I am still in the process of trying to have it changed, but I would take any class he offered in the future.  The man is a Gem.  No one should be persecuted for his political convictions and I believe that the vast majority of his CULPA reviews are posted in an attempt to lynch him.\nWorkload:\nCake man, light reading and an easy final.  do the reading it will give you an opertunity to see an Arab perspective of Middle East history and politics.\n"
        },
        {
            "course_name": "Contemporary Islamic Civilization",
            "review_date": "July 08, 2003",
            "review_content": "\nSaliba is one of the BEST PROFESSORS at Columbia.  People do not like him at times because of his political views.  I for one disagree with him on just about everything, but the debate he raises strengthens peopleÂ’s political convictions.  He forces you to think through your position, no longer will you simply hold the beliefs of your parents, and you will form your own.  Yes he is Pro Palestine in a big way, but the point of University is free thought and a chance to hear opinions that will never make the back page of the NYTimes.  LetÂ’s face it the MELAC department is a hot subject, but would you rather that everyone held the same opinion?  Saliba is an example of democracy at work, and for that he should be praised and championed.  His class is an essential part of your Columbia education.  Yeah, Saliba uses his class as a bully pulpit.  But, that is why he is here.  The man has lived life rather than simply read about it.  Yes his class is political but he gives every point of view that is needed for balanced debate.  I was unhappy with the grade I received in his class, I am still in the process of trying to have it changed, but I would take any class he offered in the future.  The man is a Gem.  No one should be persecuted for his political convictions and I believe that the vast majority of his CULPA reviews are posted in an attempt to lynch him.\nWorkload:\nCake man, light reading and an easy final.  do the reading it will give you an opertunity to see an Arab perspective of Middle East history and politics.\n"
        },
        {
            "course_name": "Introduction to Islamic Civilization",
            "review_date": "May 26, 2003",
            "review_content": "\nAfter glancing over the reviews I had to write something about prof. Saliba. I took intro Islamic Civ class with him and I found it very fascinating and at the same time challenging. The reading materials were really interesting. And to the best of my knowledge, Saliba is one of the best professors I have ever had at Columbia. In fact, my fellow reviewers are not revealing the fact that is true to the nature (shame!). Saliba knows his materials and his memory is sharper than any young professor at Columbia. His accent is quiet understansable. His lectures may get too intense or out of scope sometimes, but the exams are directly from the course pack and assigned readings. Just do the readings and take notes in class--you will get A. \nThe slides he uses are excellent and absolutely relavent to the subject matter. In fact, we don't want to work rather do the 'word puzzle' in class when he mentions some of the important points. So how could you imagine to get most out of it while you don't work? We should also keep in mind that we are not here to criticize our instructors in the ugliest way. We should be respectful and convey the truth regardless of anything..  \nWorkload:\nweekly reading, reasonable not over loaded. A  mid term and final.\n"
        },
        {
            "course_name": "Islam and Western Science",
            "review_date": "May 20, 2003",
            "review_content": "\nThe most important things every Columbia student should know:\n1) always take the elevators in Lerner\n2) Islam and Western Science is a class that should be avoided at ALL costs.\nI took this class thinking I would be avoiding Saliba's rumored rantings in his Contemporary Islamic Civ course and instead ended up learning about.....well, i'm still not actually sure.  The only thing I'm sure of after taking this course is that Saliba owns more turtlenecks than any other person I've ever met. Saliba's teaching style was totally disorganized and quite incoherent (especially if you sat more than three rows from the front of the room). He'd segue from pre-class chatter (the class was only about 30 students) right into the lecture, and after 75 minutes of his chatting, the class would suddenly be over with seemingly no material covered. It took me four weeks to realize that when he said, \"I have the funniest story to tell you guys....\" it meant \"take notes\". Assigned reading  was two boring books (both out of print) and a coursepack that contained about 25 articles, 20 of which he wrote himself. Believe me, his writing isn't much better than his lecturing. After a midterm that was plagued with arbitrary facts (I had to search through the index of one of the books we read to even find a few of the people he asked questions about on the test b/c he never mentioned them in class), he told the class he decided that to make his life easier, the midterm and final were each going to be worth 50 points (no extra credit), and he'd add together the scores from each exam and that would be our grade for the semester, no questions asked. Apparently, class participation made no difference, and the only other way to affect one's grade was to lower it by being absent more than three times. Btw, for a man who claims to be secular, he is absolutely religious about taking attendance at the beginning of each class. The class was not, as I had expected, a study on the attitude of modern Islam towards modern Science. Rather, it was a confusing montage of Why the West is Evil (Yet Again), Islam: it Totally Rocks!,  Islamic Astronomy of the 7-14th centuries (stolen by the West), and How to Compute Kibla (direction one prays in Islam) Through Ridiculously Impossible Trigonometric Functions.  The saving grace of this class was that I miraculously emerged with an A (I expected a B) and got to enjoy a pleasant dinner with Saliba and some other students at Faculty House. The bottom line is: you won't learn anything that fits together in the sense of an overall course objective, you may not learn anything at all, you'll be bored out of your ming 2 1/2 hours a week, and it's questionable what sort of grade you'll get. \n\nWorkload:\nEasy: bi-weekly readings, midterm, final (both 25 multiple choice and 5 out of ten short answer). The only trouble is trying to figure out how to study for the midterm and final.\n"
        },
        {
            "course_name": "Contemporary Islamic Civilization",
            "review_date": "May 20, 2003",
            "review_content": "\nProfessor Saliba is incapable of separating his views about current events from the material he should be teaching; as a result, this course became one long op-ed-style rant from Saliba that achieved nothing and created the most unengaging and unacademic experience I have had in a course at Columbia in the three years I have been a student here. \nWorkload:\ntwo papers, weekly reading summaries for the discussion section, and a final.  A reasonable amount of work that ends up being a challenge to accomplish because of the utter meaninglessness of the course in general.\n"
        },
        {
            "course_name": "Introduction to Islamic Civilization",
            "review_date": "December 17, 2002",
            "review_content": "\nOkay. Saliba was generally good though at times excellentÂ—like the science lecture. I have no complaints about his lecturesÂ—people doing crossword puzzles in class get on my nerve. This was literally the first time I was in contact with this kind of material. I go to the only section I can make and hereÂ’s this TA talking about how we need to shape up and work hard etc. Many people who showed up the first two weeks saw that the TA was gonna be trouble and split. I couldnÂ’t switch so I stayed. HereÂ’s the deal: this guy worked us like crazy with all kinds of Â“voluntaryÂ” assignments and even in-class quizzes. ItÂ’s weird but somehow I had a crush on him. The most unlikely candidate for a crush, he was tough, made us work, but at the same time got us to think about the material and more importantly about life in completely new ways. I swear I was happy to do extra-credit stuff.  I never did that in my life. I just got my grade and I didnÂ’t get anywhere near an A but I feel so good about having started to think critically (his words). I canÂ’t believe IÂ’m writing this but this is the most intelligent and honest person at Columbia and heÂ’s so cute! I donÂ’t care if heÂ’s married I never got as much pleasure from learning as I did with him. Unfortunately, heÂ’s not gonna TA the Contemporary Islamic Civ classÂ…Bravo Saliba for picking the best TAÂ’s at Columbia!\nWorkload:\nMidterm. Final. And depending on TA; weekly questions, quizzes, and even non-mendatory papers...\n"
        },
        {
            "course_name": "Introduction to Islamic Civilization",
            "review_date": "December 10, 2002",
            "review_content": "\nI really cant figure out why so many people have an axe to grind with Saliba. He didnt express many political views in class, and those he did werent very extreme. His lectures are definitely scattered, but very interesting. Sourcebook readings are long, but they are really good and the only ones you actually have to do. For the reviewer who disliked Jason: He is a kick ass TA and the most brilliant person I have ever met. Yes, he was outrageously offensive the first two classes, but that was the point and you obviously missed it. Sure, we never discussed anything relating to the class, but what we did talk about was fasicnating. He uses a really intense form of the Socratic method to teach, which is often bizzare and a little freaky, but it forces everyone to truly think, not just regurgitate randome facts and theories. \nWorkload:\nA midterm that Mickey Mouse could have passed and a virtually non cumulative final. Just remember that Al-Gazali died in 1111 and you will be just fine.\n"
        },
        {
            "course_name": "Introduction to Islamic Civilization",
            "review_date": "November 20, 2002",
            "review_content": "\nI seriously cannot understand the problem many of you have with George Saliba, but then again the MEALAC dept is quite \"controversial,\" no? All that aside, I took this class my first semester at Columbia (so long ago), and I can honestly say it was one of the best classes I have ever taken. Maybe some confuse his sense of humor for arrogance, I am not sure, but his lectures were completely engaging and yes, I agree with the reviewer who found his lecture on Islam and Science brilliant. His lectures are not that disorganized, and he's able to weave the lecture with a storylike quality. For those of you who \"can't understand him\" - get over it and listen a bit harder, or sit in the front row. His accent is not that bad, though his voice gets soft at times. And he's \"old\"? He's probably 60 or so, but he's sharper than some of the young professors I have had classes with. Get over whatever ideological barriers you have and take this course! The only thing that sucks is the ultra expensive reader - he's principled enough to pay the copyright fees.\nWorkload:\nMIdterm, Final pretty elementary stuff. Not too bad. The TA sections are pretty useless but req'd.\n"
        },
        {
            "course_name": "Introduction to Islamic Civilization",
            "review_date": "November 13, 2002",
            "review_content": "\nThis class was such a huge disappointment. While it is very apparent that Saliba knows a great deal about the subject, he is completely inept at transmitting that knowledge to his students in any comprehensible or interesting form. His lectures were totally disorganized; I spent the class scribbling down every word because I had no idea what was actually relevant. One glance around the classroom will show you how incoherent and just plain boring his lectures are. Most people are asleep and the rest are gazing off into space. The readings were long and for the most part uninteresting. The TAs were ATROCIOUS. I jumped around from TA to TA trying to find a decent person. They were all just as disorganized as Saliba and in some cases cynical and mean. Saliba himself is a very nice guy and you cannot help but laugh at his broken-English and his love of the subject. But extensive knowledge does not make a good teacher. I learned some but I feel like I could have gotten a lot more out of such a culture filled history. \nWorkload:\nA lot of reading, a 400 page source-book (all of it), plus many other supplementary reading, a midterm and final\n"
        },
        {
            "course_name": "Introduction to Islamic Civilization",
            "review_date": "November 07, 2002",
            "review_content": "\nOh my god. This is the single worst class I have ever had at Columbia. Professor Saliba, if you can call him a professor, is barely understandable, unapproachable, and old. The lectures have nothing to do with anything. If he didn't take attendance, there would be four people in the class (out of 200) for every lecture. The tests ask some of the most ridiculous questions ever, the majority of which were never even mentioned in lecture. Discussion sections are worthless as not even the TA's can figure out what in God's name Saliba is blathering about. Worthless, worthless class. Absolutely worthless. My time would be better spent licking the inside of the study carrels in Butler. Avoid Saliba at all costs.\nWorkload:\nLoads of asinine reading that no one does. Midterm that no one does well on. Final that is equally as terrible.\n"
        },
        {
            "course_name": "Contemporary Islamic Civilization",
            "review_date": "August 31, 2002",
            "review_content": "\nI am sorry that the previous review that called Saliba pompous and used the word \"ass\" 5 times was censored. I took him in the Spring despite warnings from my friends who are so called \"liberals.\" They all told me that Saliba makes sweeping statements without backing it up, but I didn't listen. They all told me that Saliba constantly contradicts himself, but I didn't listen. They all told me that Saliba just pushes one point of view without respect for opposing points of view, but I didn't listen. I should have listened. Take this class if you want an easy class, but don't take it if you want to really learn substantial material. Take this class if you want to hear total and utter nonsense. By the way, Saliba is an ass. (I got an A-, so don't worry, I am not unhappy about my grade) \nWorkload:\nTwo easy papers and readings. \n"
        },
        {
            "course_name": "Introduction to Islamic Civilization",
            "review_date": "August 26, 2002",
            "review_content": "\n[CULPA CENSOR: This review was not fit for publishing. Overall, the reviewer feels Saliba is pompous, and expresses his/her negative feelings towards the \"liberal left.\" The word \"ass\" was used about 5 times.]\nWorkload:\nNothing, just some reading and midterm and final. \n"
        },
        {
            "course_name": "Contemporary Islamic Civilization",
            "review_date": "May 24, 2002",
            "review_content": "\n\"Colonialism is bad because you are separated from the smell of your grandma's soup.\" Yes, this is the fundamental theme of this class and you will probably hear this every 10 minutes. This class really lacks any structure whatsoever. Saliba just spurts out random Muslim names that aren't exactly easy to pronounce or understand! He's a great lecturer, I'll give that to him. He really will engage you and the latter half of the semester has a lot of interesting stuff like Islamic music, plays etc. It would have been a much better class if he just focused more on the texts instead of just starting his rampage against colonialism and the New York Times. He has the potential to be a great instructor if he can correct these flaws. \nWorkload:\n2 papers, 7-10 pages and a Final.\n"
        },
        {
            "course_name": "Contemporary Islamic Civilization",
            "review_date": "May 20, 2002",
            "review_content": "\nThis was the biggest waste of a class I have taken at Columbia. Professor Saliba has an amazing ability to speak all class and say NOTHING of substance. He is a good speaker and he has a fair sense of humor, but he literally says stuff like \"the poet uses words to convey things.\" He doesn't use any evidence beyond surface points and even when he does refer to the texts (which is rarer than it shoud be), he doesn't say which author he's referring to. Most of the time, he just repeats statements like \"colonialism will make you lose your identity\" without backing them up at all. Our only exposure to anything culturally significant was during the periods that he showed us videos or played music, which in itself is a testament to his laziness, since I could have bought a boxed set of Islamic Cd's for what I'm sure I payed for each class period. This is honestly the first class in which I have felt insulted by a professor's inability to teach. He is so proud of his good delivery that he doesn't worry that he's not saying anything. I literally think that I would have learned just as much if I didn't show up at all. \nWorkload:\n2 7-10 page papers on anything at all relating to islamic civ (we don't need to have covered it in class) and a final that was so easy, it was embarrasing (the essay topics were: choose any movie we've seen and talk about why you liked it and choose any 3 texts we've read and talk about how they discuss islamic civilization). \n"
        },
        {
            "course_name": "Contemporary Islamic Civilization",
            "review_date": "May 16, 2002",
            "review_content": "\nA general response to the reviewer above who was \"insulted\" by Prof. Saliba's joke about the movie - relax, buddy. the whole class erupted in laughter when he made that stupid joke. It really amazes me how some people can take something out of context and blow it out of proportion. As for Prof. Saliba - I think he leads a really interesting discussion. Yes, at times he might go off on tangents, but that's only bec/ he's so passionate about the material he's teaching that he gets carried away. Cut the guy some slack - he's one of the few professors at Columbia who is willing to go against the grain and really lay out what he believes in. Take this class and you're guaranteed exposure to a perspective that you probably otherwise wouldn't get. I really like Saliba. He's extremely accessible, and his lectures are always entertaining. You might not agree with all he says, but you have to admit, the guy's hilarious. \nWorkload:\nThe reading looks very heavy, but don't worry; you really don't have to do 1/2 of it to do well in the class. the TA's are really great at guiding you towards which readings are the ones to zero-in on. 2 papers (7-10pgs) and a final- easy peasy\n"
        },
        {
            "course_name": "Contemporary Islamic Civilization",
            "review_date": "May 14, 2002",
            "review_content": "\nIt is continuously insulting to be in Prof. Saliba's class. He clearly doesn't care about having a lesson plan. He only lectured 14 of the 24 class sessions; the other 10, he either cancelled to promote \"Palestine\" or showed a movie or played music. One time, he prefaced a movie he showed by saying that he had never seen it himself, and that it might be porn, for all he knew. It is just this cavalier attitude I found to be so insulting. Saliba never talks about the readings in lecture, but sort of extemporaneously philosophizes about how bad \"colonialism\" is. Everything he says just seems to be common sense. \nWorkload:\n2 7-8 page papers. Final (which was a joke)\n"
        },
        {
            "course_name": "Contemporary Islamic Civilization",
            "review_date": "May 11, 2002",
            "review_content": "\n Saliba prefers to prowl the stage while lecturing, and refers to himself as the \"tiger.\" He is more like a preacher at the pulpit, though, delivering emphatic, wandering lectures that are so tangential that you can forget taking notes. Especially frustrating is when he begins to outline a point by saying, \"there are two things about _______\". He then starts talking about the first one and gets so lost on his point that he forgets to mention the second. All lectures eventually lead to the same conclusion: Colonialism=Bad (Now you can sleep during lectures). All said, I can't help but like the guy. He has a good sense of humor, and seems benign. in the end, I actually learned a bit. Advice: Get a good TA for section, that'll make all the difference.\nWorkload:\n2 Term Papers, Final\n"
        },
        {
            "course_name": "Introduction to Islamic Civilization",
            "review_date": "March 04, 2002",
            "review_content": "\nSaliba may be amusing at times, but his lectures are disorganized and sometimes difficult to follow. This becomes unfortunate when the material from the reading becomes confusing. In addition, Saliba devotes way too much time trying to show the class how the stereotypes of Islam, Arabs, etc. are wrong. (Shouldn't merely teaching the material be enough to do that?) I certainly ended up taking the class during an unusual semester (Fall 2001), but too often the discussion sections (and occasionally the lectures) became a forum where liberals could rail against \"evil America\" and more conservative and moderate views seemed unwelcome. In the end, I left the class knowing more than when I had started but with the feeling that I ought to know more. The material was often interesting, but the class was just too disorganized and unfocused. I think my frustratation with certain elements just ended up outweighing everything else.\nWorkload:\nAverage amounts of weekly reading that required submission of discussion questions. (Most readings are relatively interesting, but one of the books is just awful to read and difficult to follow.) Midterm. Final. Optional paper.\n"
        },
        {
            "course_name": "Introduction to Islamic Civilization",
            "review_date": "December 31, 1999",
            "review_content": "\nAlways entertaining, though a bit light on content. Lectures are sprawling and sometimes feel a bit disconnected; readings are moderate to heavy. Structurally, the class is overambitious: hundreds of years of history are crammed together with 'civ' stuff--poetry, painting, film, science, math. It's can be bewildering, and makes studying difficult. Irresistable sense of humor, though, so while you may complain about the lectures, you probably won't sleep through them.\nWorkload:\nmidterm, final, optional paper.\n"
        },
        {
            "course_name": "Introduction to Islamic Civilization",
            "review_date": "December 31, 1999",
            "review_content": "\nSaliba is an old bore. He jokes are lame, outdated, and smell funny. For some reason he likes to use Yiddish words. Loves to repeat he knows Arabic, Hebrew, Syriac, Aramaic, French, German, Italian, Latin and whatnot. Secular Arab nationalist, reminded us often he was Christian. Superficially cares about students, but try getting a hold of him! Mainly because of the 'civ' issue but also because of the lecture, class is disorganized, readings unhelpful. Poor TAs tried to make sense but eventually gave up. Definitely take the class. In the confusion, you'll come out on top...if allah wants!!!\nWorkload:\nMidterm and Final. 2 5-page papers (extra-credit)\n"
        },
        {
            "course_name": "Introduction to Islamic Civilization",
            "review_date": "December 31, 1999",
            "review_content": "\nSaliba is a dynamic lecturer who clearly cares a lot about his field and the class. Except some tiresome repetition, he makes class interesting. He's a genuintely nice guy who is very open to questions both during the lecture and outside of class. Although the first half of the class is very informative, the second half is a waste of time and he just repeats a few ideas over and over. You can get through this course without ever showing up at lecture, but attendance at the required discussion sections is a must.\nWorkload:\nVery light - some reading (basically optional) and an easy midterm and final.\n"
        },
        {
            "course_name": "Introduction to Islamic Civilization",
            "review_date": "December 31, 1999",
            "review_content": "\nAlthough I used this class to fulfill the Major Cultures requirement, that was not my only reason for taking it. I genuinely wanted to gain an understanding of the history and culture of the Islamic World. Unfortunately, what I got instead was a lesson in the hypocrisy of the academic left, thanks to George Saliba. Saliba and the TAs in this class were constantly discussing stereotypes of Islam and of Middle Easterners, but they seemed to have never challenged their own stereotyped thinking. It is reprehensible that one TA (Jason) thought it was acceptable to tell me I must think certain things because I was white, middle class, and American. As far as work goes, this is an easy class. I managed a B with practically no effort, just studying for the midterm and the final. But in my humble opinion, the university ought to sanction Saliba for some of the comments he made in this class.\nWorkload:\nMidterm and final. Also an optional paper.\n"
        },
        {
            "course_name": "Introduction to Islamic Civilization",
            "review_date": "December 31, 1999",
            "review_content": "\nLike a great jolly Lebanese (I think) Santa Claus...with a white beard and his ever-present red sweater, the comparison can't be avoided. Once you get past it, though, he's pretty much the man for his job; the lectures on science and mathematics are BRILLIANT. Course is scattered, and a bit of a bully pulpit, but in the end you've learned more than you thought. Saliba is very enthusiastic, which is kind of refreshing in a lecture class. Bravo!\nWorkload:\nSerious but doable reading (class is very easy if you do the reading) midterm and final.\n"
        }
    ]
}