{
    "prof_info": [
        {
            "prof_name": "Chris Buchenholz",
            "prof_id": 824,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "January 25, 2013",
            "review_content": "\nReally Great Professor for Music Hum. Really excited to teach everything and always comes to class with passion and energy. You can clearly see that he is in love with music. He presents the material well and provides a good context for everything and is good at making the class understand all the technical and fuzzy concepts associated with music.\nOne criticism I have of the class is that sometimes it is easy to the point of banality. This is not in reference to the technical and listening aspects of the class which can be a bit tricky (but could have definitely been more challenging and interesting and not so basic) but more to the historical and cultural aspects of the music. In this sense the class seems to have been watered down a lot and one could get through an entire essay by just BSing some buzzwords and dropping some names rather than having any in depth analysis of anything. It also seemed that he panders to the students a lot in terms of making the class easy and was quite often bullied into giving easier assignments and cutting out things from the syllabus by lazy students who didnt really want to put in anything. The assignments are quite useless but the exams are a good measure of ones knowledge and understanding of all the concepts. The material of the class however is quite interesting and amazing and I really got exposed to some amazing music in this class.\nThe Professor is really a nice guy and he himself seemed really pissed off about watering down the class so much and sort of hated giving people credit for their BS. I feel that if the professor raised his expectations for the class a little bit in terms of the quality and rigor put into the work and didnt get scared that he was ruining someones grade or making it too difficult or anything then it would have been a much more fruitful class and not have the flavor of something that was just a requirement and needed to be thrown out of the way.\nWorkload:\nWeekly quizzes which you may do badly in if you dont review the material. Weekly reading assignments which you can skim or even not read. Two concert (one page) Reviews/reports (one on an Opera and another on an Orchestra performance) Two exams (not too difficult if you know the stuff) and One Desert Island Project (This involves making a list of 10 of your favorite songs that must have with you on a Desert Island if you were abandoned on one and describing the technical aspects of the song learnt in class and describing why you like them/why are they important to you)\n"
        },
        {
            "course_name": "Ear Training I",
            "review_date": "October 09, 2003",
            "review_content": "\nHe remains the most effective Ear Training teacher ever.  Knows his stuff, and knows how to make you know it.  Never rude, but sufficiently strict (bad word, but you get the idea).  Also an all-around great person.\nWorkload:\nNothing bad\n"
        },
        {
            "course_name": "Ear-Training",
            "review_date": "May 07, 2003",
            "review_content": "\nby far the best teacher I've had at columbia - (and maybe ever) - not only does he know his stuff, he has a unique teaching style, and makes every student feel important.  he's also a really funny guy.  takehis classs if you get a chance\nWorkload:\nmed/light\n"
        },
        {
            "course_name": "Ear Training I",
            "review_date": "May 09, 2002",
            "review_content": "\nWhat a great guy. A brilliant musician and composer, but never makes students feel stupid, even when they screw up really easy stuff. He knows its a one-credit class and that its not supposed to be a source of major stress. He's very willing to help students achieve their individual goals. Take him- you'll be in for a treat.\nWorkload:\nLight\n"
        },
        {
            "course_name": "Ear Training I",
            "review_date": "December 15, 2001",
            "review_content": "\nReally funny & nice guy who truly wants you to know more about music. Very smart; knows his stuff.\nWorkload:\nEasy solfege exercises. Singing exercises and interval dictations are more challenging. Meeting with him for three office hours is mandatory.\n"
        }
    ]
}