{
    "prof_info": [
        {
            "prof_name": "George Lewis",
            "prof_id": 2178,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "Jazz/Improvised Music After 1950",
            "review_date": "April 12, 2016",
            "review_content": "\nGeorge Lewis is a great guy. Funny, likeable, idiosyncratic... he is a maverick.\nThat doesn't mean he's a good teacher. In fact, he's definitely not a good teacher.\nGeorge Lewis does not care about this class. It's really, really far down his priorities list. That was evident from his periodical, unexplained absences, as well as the fact that we rarely spend even 1h of the 1h30 class time discussing or analysing the assigned readings. But what I also got from this class is that, if you've done the readings that he assigns, everything he says makes sense. \nHe's a bit of a \"sideman\" but also kind of a big deal. He knows that, and although he might not want you to know that, it's pretty obvious from the moment he sits down. George Lewis is there because he needs to be.... this is what it has come to.\nBut he also provides his students with absolute pearls, hilarious stories and generally a real attempt at discussion with his students. He also cares about what you have to say. Even though he knows he's better, he also has a child-like curiosity that means that his knowledge is never used against the student to overwhelm. \nSo the class is fun. George Lewis is an excellent character. Always good-humored and he shows a real interest in what we have to say, opening up the floor for discussion throughout his classes.\nThe only problem is that it's very unclear as to whether he wants to be there, or whether he's making jokes because he doesn't care enough about the reading to discuss them with us. Or maybe he's only there for the sake of it, to make his jokes and earn his pay-check. \nAll of this to arrive at the real problem with George Lewis's class: his grading method.\nFor a professor who doesn't seem to care about anything, he is certainly tough and even harsh in his grading method.\nStudents are expected to know everything, but are taught almost nothing.\nOverall, I think this is the only glaring problem. He's entertaining enough that I didn't care much about not discussing the readings, and arguably that made my life easier because it was one less class to worry about throughout the semester.\nIf you're a good writer, and love jazz, and love the maverick characters that populate the jazzual realm, then this is for you.\nIf you're into academia and are intent on learning. STAY AWAY.\n\nWorkload:\nRidiculous amounts of reading. But other than a few excellent assigned readings I'd say most of them are utterly useless since we never discuss them in class. So in the end extremely light in the context of my semester.\n"
        },
        {
            "course_name": "Jazz",
            "review_date": "May 30, 2008",
            "review_content": "\nThis was the most worthless, horrible class I have ever taken.  Professor Lewis consistently turned up 10 minutes late to class, screwed around with the AV equipment for another 5, consistently kept us in class for 10-20 minutes late, and spent the entire time talking about himself.  I learned nothing, and the class was a complete bore--despite the fact that I love jazz, grew up listening to it, and wanted to get a new perspective on teh subject.  If you take a class with him, don't bother going to the actual lectures--just do the reading, write about them in your assigments (cite everything!), and you'll do fine.  Easy grader, but overall the most worthless course I've taken.  This man should be fired.\nWorkload:\nMidterm, Final, two papers\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "February 23, 2006",
            "review_content": "\n100 pages of reading per week? An overexaggeration. Lewis sure did assign readings, but only from the Listen book (which was like 20 pages per week). \nLewis is obviously a very talented musician and knowledgable professor. Sure he digresses to certain off-tangents, but if you want to learn about and engage with the music assigned, Lewis does an excellent job of doing that. He encourages class discussion, and won't hesistate to disagree with you if necessary. The initial phase of the class gets a bit monotonous because he has to cover the standard classical and baroque material. But once he gets to the modern period (post 1900), it starts to get really interesting -- like he introduced us to queer forms of \"music\" that I would NEVER have known if I hadn't taken this class.\nPoint is, if you're looking for the \"standard\" music hum class, avoid it. But if you're looking for that unique core class, Lewis is the man. \nWorkload:\nFinal exam (he virtually gave us the questions 2 weeks before finals), tough mid term (even the TA admitted it was tough), 2 papers (which can be lots of fun!)\n"
        },
        {
            "course_name": "Jazz/Improvised Music After 1950",
            "review_date": "January 26, 2006",
            "review_content": "\nThis class was excellent.  I've joined the George Lewis cult and y'all should, too.  What others thought was disorganized (from previous reviews) I perceived as flexibility and freedom to digress in lectures.  For some reason, reviewers on this site think that digressions are devoid of information from which to learn.  College is a bloody digression!\nThe material was interesting, and whether or not Lewis chose to talk about it (which is cool with me), learning occurred.  Assignments were varied and somewhat open-\nended.  George encourages everyone to participate in class despite its designation as a lecture; he's interested in our ideas, but he's quick to challenge them if he disagrees.  Class was more or less pointless when Lewis wasn't around (maybe 3 classes) and the TA had to teach.  Guest lectures and performances (5?) were pretty cool.\nHere's the point: Lewis' teaching approach and course maximized my learning and thinking about the material.  I've never learned more in an academic setting.  This is the best class I've taken here.\nWorkload:\nFair amount of reading assigned, but it's not actually necessary.  I ended up reading the assignments cause they're interesting, not to be prepared for class.  A few papers, including a concert report and listening assignment, which were all rewarding.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 23, 2006",
            "review_content": "\nProfessor Lewis is an amazing person and is very talented. However, his class is best only for the most intense music fan. He speaks in a monotone and it is easy to get sleepy. He prefers to focus on the non-traditional, so if you want to know who Bach is, do not take this class. If you like Music, I would recommend him. If you are just fufilling a core class, I would save yourself a lot of headaches and find a more traditional and more sensical professor.\nWorkload:\nMidterm, Final, (2) 4-page papers, 1 hour of music listening a week, 100 pages of reading a week.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 09, 2006",
            "review_content": "\nProfessor Lewis is a mixed bag. His lectures are very entertaining, and the workload is quite light. Unfortunately its really hard to tell what is important and what's not based on his lectures. Also, he doesn't write anything useful on the board. His office hours were infrequent, and he didn't seem willing to meet with students outside of them. Fortunately, his TA was very available.  He spent about 10-15 minutes reviewing the class before the two exams. This consisted of telling us the type of questions and their topics. When the actual exams came they were different (e.g. he told us in advance the essay questions for the final, but then changed them on us; he told us nothing from the book that we discussed in class, but there were some short answers from the book). The two papers were incredibly open ended. Grading was mysterious, but you'll probably end up in your normal grade range.\nWorkload:\nReadings in the textbook and 3 assigned articles. 1 listening report (3-4 pages) and 1 concert report (2-3) pages. Midterm and Final. Grades were never returned on either paper. My grade was 1/3 lower than I expected based on my midterm grade.\n"
        },
        {
            "course_name": "Music, Race, & Nation",
            "review_date": "January 04, 2005",
            "review_content": "\nI agree with the statement that the complexities of a particular article cannot be fully addressed by a textbook approach to the course. However, without any background or general framework, discussions become quite tangential, no matter what ideas they force out. Additionally, certain remarks made in the class were quite offensive when not stated in an understandable context. Lewis, however, was very impressive in his first semester of teaching here, in that he put a leash on most of these discussions and kept them within a general direction while not compromising the liberty of students to delve deeper into certain issues. As this is meant as an intro course, despite the 3000-level placement in the bulletin, the first review should be given more respect than it was given (see the second review), as a bit of a crash course introducing some terminology and sociological concepts would not be a hindrance to the intellectual output of the class, but would fuel the discussions even more. Additionally, IÂ’m not quite sure the first reviewer was implying that the discussions were either useless or that they should be replaced by a lecture-style class with force-fed notions of race and cultural relations, but only that they could have had more coherence. Exceptional professor, and overall very enriching experience. \n\nWorkload:\n3 papers, difficulty depends on the topics you choose. \n"
        },
        {
            "course_name": "Music, Race, & Nation",
            "review_date": "December 22, 2004",
            "review_content": "\nI guess I'm one of those people who joined Prof. Lewis' cult following within the first week of his being at Columbia.  Lewis is probably the smartest, most interesting professor I've had at Columbia, and that the music department hired him (an avant-garde jazz trombonist, electronic composer, Macarthur Genius Grant winner, etc.) bodes well for the future of the department.  This class was a tad disorganized, no doubt.  For one thing, he assigns a ton of reading every week.  Usually 4 or 5 articles, most of them about 20 or so pages and fairly dense at that.  And he didn't put together a course reader (because he said it would cost students too much money), so you had to max out your print quota every week, and then keep track of stacks and stacks of stapled readings.  Unfortunately, not many students came to class prepared to discuss all the readings, and since there were a ton of non-majors in the class, music as an object itself to be studied was de-emphasized.  Instead, the class mostly dealt with the discourses surrounding the music--what it meant (and means) for so many people, and how ideas about race, nationality, ethnicity, gender, sexuality, etc., play into that meaning.  This is exactly the type of course the music department needs to have more of (and not just leave it for the Center for Jazz Studies to deal with music as something with meaning in society).  But I wish we could have studied the music itself a little too.  But even if you don't do the reading, if you come to class, you'll be pretty impressed by Lewis' brilliance.  He can scrawl a list of related books and references on just about any subject.  He knows and has played with about every important left-of-center composer or musician of the last 25 years.  Lewis is the man.  I highly recommend anything he teache at Columbia.  \nWorkload:\nA ton of reading.  100 or so pages every week, much of it fairly sophisticated analyses of composers and performers.  No in-class exams, but three 5-6 page papers on assigned topics.  \n"
        },
        {
            "course_name": "Music, Race, & Nation",
            "review_date": "November 06, 2004",
            "review_content": "\nThe fact that this man developed a cult following within his first week of being here should clarify what taking a class with him is like.\nIf you'll notice the previous review, some people just aren't going to like his course (I suspect, however, that the previous reviewer doesn't do the reading and doesn't try to talk in class).\nThe class functions like a forum - he will argue with given students, but it forces out problems in students' arguments, whilst supplementing the text we've read.  He will stop and take time to clarify confusing texts, and is conscious of trying to help out students to understand this rather complex subject.\nThat said, if you want a lecture that is organize (and which, therefore, will never explain the complexities of any situation), then this isn't for you. \nLewis is a great professor, though not necessarily for everybody\n"
        },
        {
            "course_name": "Music, Race, & Nation",
            "review_date": "October 14, 2004",
            "review_content": "\nThis guy might have been involved in modern music in every square foot of the world, but I guess he never came across any ideas on how to teach a university class.  You go in there every day and listen to Lewis take up an argument with one or two students, and he never gets to the core of any of the readings or illustrates any important concepts in the material. The readings range from repetitive and monotonous to pretty interesting. Alas, you're left completely in the air as to what to focus on out of all these stacks of material. Although there is a \"syllabus,\" there is no apparent  logical order in any of the topics. So basically, he's a complete novice professor, and pretty much relies on students to tell him how to run the class, even saying once \"am I to understand that this is a tad too much reading? -- when I asked them how to put together a course, they just said a bunch of readings, and a few papers and exams.\" He did just that. And nothing else.\nWorkload:\n100-150 pgs. of reading per week. 10-page paper. Take home midterm and final. \n"
        }
    ]
}