{
    "prof_info": [
        {
            "prof_name": "Eric Herschthal",
            "prof_id": 12855,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "American Civilization to the Civil War",
            "review_date": "March 27, 2014",
            "review_content": "\nProfessor Sloan knows so much, and that is apparent from his lectures. That having been said, he can be boring and a bit dry, and lectures can tend to drag on a bit. There were definitely times I feel asleep in lecture. You have a textbook, which I found was good because it gave the background to what Sloan would discuss in lectures, but you could really get by without reading it and just going to lectures and taking notes -- for the final, Sloan gives you a list of terms that you will have to know, which do a good job of encompassing everything covered in lectures. He would pick specific overarching themes of the period, and spent several lectures over the course of the semester on historiography, which I found was interesting, but, again, was a bit dry. You also have to read six other books over the course of the semester, some of which are interesting, and some of which are boring, useless, and did not contribute anything to my knowledge of American History (Robert Cole's World, I'm looking at you).\nThere is also weekly mandatory discussion sections. My TA, Eric, was okay, and did a good job of facilitating conversation about the texts we were reading.\nGrading is done randomly, so you can have a TA or Professor Sloan grading your paper and your final, making grading a bit of a mixed bag -- you win some, you lose some. You also don't know which one is grading, which makes it hard to figure out how to do better. The class was also part of the Barnard Writing Fellows program, so you had to hand in mandatory rough drafts of your papers that get reviewed by a writing fellow before you hand in a hard copy. It was good to have someone look at my writing, but it could be tedious at times.\nWorkload:\n3 papers, based on books that you read over the course of the semester. Not all of the books will be covered with the papers, and you will have to refer to them on your final. No midterm. Final is 10 IDs from a list of about 40 that Sloan gives you, and two essays (you have no choices). Mandatory discussion section.\n"
        }
    ]
}