{
    "prof_info": [
        {
            "prof_name": "Sigrid Nunez",
            "prof_id": 2341,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Fiction Workshop",
            "review_date": "January 02, 2005",
            "review_content": "\nI'll be honest, at first, I absolutely hated this woman.  I even tried to see if there's anyway I can switch into someone else's workshop.  Let's just say I am very glad that Leslie did not let me switch.  This turned out to be a great class!  Sigrid is an acquired taste, that's true, but once you acquire it, it's awesome!  Yes, she's harsh.  But not overly so.  The woman is honest and blunt about it.  I disagree with the previous review that Sigrid expresses favoritism.  I did not get that impression at all, and I can not think of anyone who she favored or disfavored.  I thought she was very fair in her treatment.  If she doesn't like the piece, she'll trash it, if she doesnt like your attitude, she'll yell at you, if you're not participating and clearly haven't read the piece, she'll pick on you to comment.  But if you come prepared, having read the pieces, if you offer helpful comments, and if you take everything with a grain of salt, she'll absolutely love you.  The woman is also hilarious. Overally, if you can take a bit of criticism and sometimes an attitude, take the class, you'll have one hell of a time.  If you're gonna cry every time ur piece gets trashed or the prof snaps at you for talking to your neighbor, or you get grossed out easily, then stay away, because you'll be cringing all the time.\nWorkload:\n2-3 pieces for workshop.  She says that the 30-40 page portfolio counts for your whole grade, but i'm pretty sure that your comments in class also contribute.  The portfolio can either be workshopped rewrites (which need to be very significant rewrites, not just a sentence here or there), and/or new material that hasn't been seen.  I got my best grade in creative writing in this class.  The woman rocked!\n"
        },
        {
            "course_name": "GS fiction workshop",
            "review_date": "December 28, 2004",
            "review_content": "\nWhile Sigrid seemed harsh at times during the year (she will totally trash your fiction submission and make workshop a living hell if she doesn't like you - even if you submit a good piece) she grades fairly.  She offers direct, decisive commentary that can be helpful if you can stop the copious amounts of blood and bile spilling out of your heart after dealing with her workshop.  I'm not a particularly sensitive workshopper  - and I cringed not only for myself but for several of my classmates over the course of the semester.  Sigrid seemed to favor the two male students in the class - and her tendency toward astonishing displays of favoritism made me very uncomfortable and angry.  However - I learned a lot.  My skin got thicker.  And I wrote some of my best fiction in an attempt to appease her with my final portfolio.  The class was challenging, difficult, frustrating, insane, aggravating, impossible, but not worthless.  Somewhere between a hit and a miss. \nWorkload:\ntwo submissions over the semester.  a 30-40 page portfolio at the end which is 100% of the grade - and gave me an ulcer.  \n"
        }
    ]
}