{
    "prof_info": [
        {
            "prof_name": "Allen Durgin",
            "prof_id": 13184,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "University Writing",
            "review_date": "December 25, 2016",
            "review_content": "\nDr. D is a great professor to have for university writing. I always found his feedback helpful. The more feedback you can get from him, the better your writing assignments will be (so go to office hours often). He really helped me to improve my writing. A word of note: His area of expertise is gender studies. I had him for contemporary essays, and a lot of our readings were about gender and sexuality; however, we always had other readings on which we could complete our assignments. \nWorkload:\nStandard UW workload. You have writing assignments and readings to compelete for each class. Completing the daily assignments can take anywhere from 30 minutes (initial exercsies) to several hours (for the exploratory and formal drafts). Do them all. It helps with the final drafts. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "November 16, 2016",
            "review_content": "\nDr. Durgin is knowledgeable, witty, and makes class an enjoyable experience for all. He's a fair grader and gives constructive, meaningful feedback on writing.   \nWorkload:\nTypical University Writing workload.  If Gender and Sexuality is something that you find very difficult or challenging, I wouldn't recommend that specific section. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "March 28, 2016",
            "review_content": "\nProfessor Allen Durgin will make your University Writing class possibly the best class you will ever take at Columbia. Under its non-serious first impression, he will make you learn things that will be a treasure for the rest of your life - not only as a student but also as a person. JUST TAKE UW WITH HIM.\nWorkload:\nstandard UW - AMAZING READINGS THO\n"
        }
    ]
}