{
    "prof_info": [
        {
            "prof_name": "Christopher Brown",
            "prof_id": 3465,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "England and the Wider World",
            "review_date": "April 28, 2011",
            "review_content": "\nWhile he can come off as pretentious at times, Prof. Brown does know his stuff.  Lectures manage to stay interesting throughout the majority of the course.  Except when he was making up for a class he missed, Prof. Brown does use much of the class time for discussion.  He knew those of us who participated frequently by name after about a week, and the rest of the class he learned within a month.  The readings involved both primary and secondary sources, covering three source books, a text book, and about six secondary sources.\nOne major problem that Prof. Brown has is his tendency to not put readings up on courseworks in a timely manner.  Beyond that, he is quite good overall.\nWorkload:\n~10 Books, 2 Essays of 6-8 pages each, a Midterm, and a Final as well as weekly discussion sections, there are no discussion posts.\n"
        },
        {
            "course_name": "History of Slavery",
            "review_date": "December 27, 2008",
            "review_content": "\nProfessor Brown is one of the rising stars of the history department. His course on the history of slavery, although being a broad survey, was tied together with very intelligent and compelling themes. His lectures were well prepared and elegantly delivered. Coming from Rutgers, I thought he could have offered a slightly more aggressive and challenging approach in the class, and he admitted this himself mid-way through the course.  It was always a pleasure to attend, and the readings were relatively light but always interesting and valuable. \nWorkload:\nRelatively light reading compared to other history courses; two pretty short papers, but Brown has high expectations and doesn't except BS\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 30, 2008",
            "review_content": "\nProfessor Brown, a visiting professor from Rutgers, was a welcome switch from a previous big shot historian.  He has a great ability to stimulate interested discussion amongst the students (which the former professor was never able to do) by asking the class a question.  The question was often something that had puzzled Professor Brown himself and was often a  key to unlocking and understanding the entire work.  What I admired even more was the importance he placed on impartiality, his evident kindness, and willingness to help the student outside of class.  He's a very nice guy and it's a shame he's only here for a bit.\nWorkload:\n8 responses (13 chances throughout the year), 2 papers (3 chances throughout the year).  If you do more than 8 responses, he'll take the highest 8 scores.  Same deal with the papers.  Like any CC class - class participation counts for about 20%.  Very fair midterm/final.\n"
        }
    ]
}