{
    "prof_info": [
        {
            "prof_name": "Amy Johnson",
            "prof_id": 1111,
            "total_reviews": 13
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "April 28, 2016",
            "review_content": "\nIf you are in her section - you are very very lucky. Stay. She is one of the most knowledgeable lithum professors in Columbia and she knows the texts inside out. She also truly cares for each individual student. Don't feel bad if there is not as much discussion in her section as in other sections. Instead, listen to what she says - she is always insightful and profound, and she tries to make the texts relevant and link them to our daily lives.\nWorkload:\nShe tends to drop one or two of the texts, so the workload is slightly lighter.\n"
        },
        {
            "course_name": "Literature Humanities",
            "review_date": "July 15, 2013",
            "review_content": "\nProfessor Johnson is one of the best professors at Columbia. She cares about each student--In fact, she is still a dear friend to me today. She inspired me to become an English major. She is incredible. If you can, GET INTO HER SECTION. She is one of the most honest, humble, brilliant people I have ever met. While totally sweet, she is not afraid to call students out in front of the class for being close-minded, rude, or bigoted. Easily the best professor I have ever had.\nWorkload:\nLight. Grades reflect effort and excitement.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 13, 2011",
            "review_content": "\nProf. Johnson knows the works that we read very well, brings up some fascinating points in class, and if you choose to come to class having done the readings, Lit Hum with Prof. Johnson can be a rewarding and intellectually satisfying experience. She's a wonderful person who's extremely approachable and is always willing to meet with her students. \nNow it's important to be mindful that her Lit Hum section is what you choose to make of it. She doesn't try to encourage the entire class to participate in discussions about the books that we read. She is soft-spoken, she doesn't modulate her voice, and her class is more lecture-based than discussion-based. So yeah, if you haven't done the readings, aren't paying attention, and/or don't come to class prepared, you may find this particular Lit Hum section to be pretty boring. A sizable number of people feel this way. If you come to class prepared, you'll be able to appreciate the many interesting ideas and points that she brings up in class.\nMy own recommendation: if you're in her section, STAY. Especially if you don't have much of a previous background in the Lit Hum texts (as is my case) and are okay with a Lit Hum section that is more lecture-based than discussion-based, you may find this particular section to be satisfying. While her section and her teaching style isn't for everyone, I thought I learned a ton from her and enjoyed her class very much.\n\nWorkload:\nLight. No HW assignments. Occasional pop quizzes. Two papers + Extra Credit assignment. Midterm (with no passage ID's). Final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 13, 2011",
            "review_content": "\nProfessor Johnson knows the Lit  Hum texts backwards and forwards, she just doesn't know how to teach them. Our \"discussion\" consisted almost entirely of her listening to herself talk.  Johnson's feedback on my papers and tests was discouraging and I gave up utilizing her office hours after a couple of times because she seemed completely closed off to my concerns. I felt appalled by the amount of favoritism she showed for certain students.  If you choose to take this class, you will learn a lot (so long as you can stay awake) but you could also be setting yourself up for several months of frustration. \nWorkload:\n2 shorts papers, midterm and final \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 11, 2011",
            "review_content": "\nI really enjoyed Prof. Johnson's Lit Hum section; it was one of the best classes I have ever taken. \nI can see why some people don't necessarily like her style of teaching. She is very soft spoken, could perhaps modulate her voice a little more, and probably spends more time lecturing than other Lit Hum professors; you can tell that not everyone in the class is engaged (or paying attention). It really takes time to get used to Prof. Johnson's style of teaching. Since the pacing of the class can be a little uneven (sometimes 25 pages a night, other times you have 100+ pages to digest in 2 days), you may want to consider reading ahead. But ultimately, almost all her students will find Prof. Johnson to be a laid-back, quirky and very approachable teacher who goes the extra mile to help her students. While she's soft-spoken, she has a great sense of (deadpan) humor and can be very, very funny at times as well. \nProf. Johnson is incredibly smart, and the things she says are insightful and original. Having taught this class for decades, she knows the course material amazingly well, and her focus on examining key themes in the works that we read (the Big Picture) and searching for modern-day connections makes taking Lit Hum with her incredibly rewarding. Later on in the semester, Prof. Johnson decided to have us prepare presentations for each class and lead discussions that she would help guide; it was quite effective and made Lit Hum a class that I would look forward to.  \nIf you find yourself in Prof. Johnson's section, consider yourself very lucky. You're in for a great class.\n\nWorkload:\n2 papers, 1 extra credit paper, 1 midterm, 1 (standard) Lit Hum final.\nThe class isn't as easy as what other reviews say. But if you keep up with your readings and actively participate, you should be fine. Prof. Johnson's a very reasonable grader. \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "November 24, 2009",
            "review_content": "\nDr. Johnson is very well educated, and supremely well prepared to teach LitHum. She went to Harvard for undergrad, got her PhD in comparative literature in Greek and Latin at Harvard as well, studied at Cambridge (not quite certain through which program, but still) and was a post-doctoral fellow here at Columbia.\nI consider myself a good writer and reader, and I came to Columbia for the Core. I did well in the first semester and found the readings enjoyable, I am a humanities type etc, etc, just to let you know where I am coming from.\nThat said, I didn't love going to this class. I think this is a reflection of both the 9 am class and how Johnson responded to it. The class didn't seem to be very engaged in the materiel and most people didn't seem to do their readings. Only a handful of people spoke regularly, which at the end of the day meant there was next to zero discussion. Johnson did little to amend this, and could just drone on for the whole period while not a soul said a thing.\nThat being said, I have high standards. She does have an encyclopedic knowledge of the material, so she provides some very interesting related information. She is a very nice lady who seemed willing to sit down with students and go over their papers, etc. She was also understanding if someone missed class every once and a while. So to summarize, I would say she is a solid teacher: not great and not horrible. However, if you are looking to have a really good intellectual experience with what is supposed to be the cornerstone of the Columbia education, you may feel disappointed. If you are just looking for a passable way to survive LitHum, then it should be fine.\nWorkload:\nTwo 1000 word papers. Two 1 page responses postings, ungraded and contribute to your participation grade. Mid-term and final. Not sure on her rewrite policy. Also has a forgiving late policy, with one of the two papers for the semester allowed to be two weeks late (as a trade off, it won't be returned in a prompt manner or with comments).\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 19, 2004",
            "review_content": "\nI agree with the other reviews.  She is very nice, smart, and flexible.  On the other hand, she isn't the MOST engaging.  This was partly due to the reluctancy of the class to really get into discussion, but partly due to her as well.\nIf you get in her section, stay in, it's worth it.\nWorkload:\nmidterm (no IDs, 1 close reading, 1 essay).  Classly discussion Questions.  2 papers.  dept-wide final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 08, 2004",
            "review_content": "\nProfessor Johnson was great: Knowledgable about the books, flexible about the assignments, and able to tie in more than simple plot analysis and review. Consider youself lucky if you have her, she's very sweet and smart!\nWorkload:\n2 easily graded papers per semester, midterm w/o ids, the usual department final.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "February 08, 2004",
            "review_content": "\n Â“These works are over two-thousand years old.  If you think youÂ’re going to come up with anything original, youÂ’re mistaken.Â”  With this phrase, Amy Johnson set the tone of the class for me.  Indeed, much of class was spent reviewing the plot rather than doing analysis.  \nMs. Johnson required us to write two questions for each class period.  These were collected and counted towards our class participation grade because Â“many people donÂ’t talk in class.Â”  It was unclear what exactly she wanted with these (and much of each class consisted of her berating us for bad questions:  Â“donÂ’t ask me why this happens Â– itÂ’s just the way the book goesÂ”) \nAmy Johnson is a good lit-hum teacher whose class had one crucial problem:  it had no structure whatsoever.  Sometimes she would read our questions out loud and respond to them.  Other times, she would review the plot.  One class, she assigned a part of the work to each person and had us analyze it.  Unfortunately, class wasnÂ’t very stimulating.  As hard as she tried, she couldnÂ’t make class interesting (and she seemed to give up at some point).  She rarely prompted the class for input and she never wrote anything on the chalkboard.  More often, she would passively sit and talk (in a slow drawn-out sort of voice with lots of long pauses) about the work.  Frankly, it was boring, and people would sometimes fall asleep.  If you could stay awake and pay attention (as I was eventually able to do), youÂ’d realize that she actually had some very insightful things to say about the works and some insightful connections to current events.\nBottom line:  ItÂ’s not hard to do well in her class (just do the questions, and write solid essays).  If you want to survive and enjoy class time, however, have some coffee and try hard to pay attention.\n\nWorkload:\nFor each class we had to write two questions based on the reading.  We also had two 5-7 page essays -- the first was close-analysis of a scene.  For the second, we could do another close-analysis, or we could connect a work we studied to something else (a newspaper article, a poem, a book, a movie etc.).  SheÂ’s a fairly easy grader on the essays, and will read over rough drafts before the due date.  Also, she took feedback when setting due-dates.  She did not assign any extra books (in fact, we didnÂ’t even read part of the bible)\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "February 05, 2004",
            "review_content": "\nAmy Johnson knows her stuff about the books in the Lit Hum curriculum. She doesnÂ’t know too much, however, about how to convey her knowledge.  The class is unstructured Â– the period typically consisted of 2 hours of her reading a small passage out loud, summarizing the passage, and then lecturing for a few minutes on that passage.  This would be alright if she sparked interesting class discussions, but the class was generally asleep within 20 minutes and discussions did not generally go anywhere.  She is a lenient grader, both on the papers, and on the midterm and final.  All in all not a very stimulating or exciting class, and I got the impression that she was tired of teaching the class by the end.  An easy good grade, and you may get something out of it if you do all the readings and can manage to stay awake during class.\nWorkload:\nAll the Lit Hum books, no additional readings.  One 5-7 page paper on a passage in the Odyssey, and one 5-7 page paper on pretty much anything related to a work we had read.  Fair and lenient grader.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "March 12, 2003",
            "review_content": "\nExcellent teacher.  I enjoyed her class immensely.  The lectures were also very clear and she is very approachable outside of class.  She is a very sweet lady and I think anyone will enjoy taking Lit Hum with her.\nWorkload:\nLight\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 20, 2003",
            "review_content": "\nMrs. Johnson was an excellent teacher.  She knew her material extremely well and presented it in an effective manner.   The work load was light and lenient.  She usually allowed you to select which books and topics you wanted to write about and allowed you to rewrite essays as much as you wanted.  The lectures seemed pretty long at times, especially when there was little participation, but so would any 2 hour class at 9 in the morning.  Judging by how boring a two-hour Lit Hum course at 9 in the mourning could be, this class could actually be rated as interesting.  She was also very understanding about lateness for early morning classes and very available for confrencing.  \nWorkload:\n4 papers, midterm, final, 2 response questions due every class, and obvious reading\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "May 14, 2002",
            "review_content": "\nVery good teacher, knows alot more than she has to. Class discussions sometimes hit a rut, probably because there were only 10 of us. Very good teacher to take lit hum with. Kind of tough at first with the papers - you need to know how to write more than anything.\nWorkload:\n4 papers (3pp each) due throughout the semester, whenever you want - a midterm, and final - pretty standard\n"
        }
    ]
}