{
    "prof_info": [
        {
            "prof_name": "Manouchehr Kasheff",
            "prof_id": 1009,
            "total_reviews": 11
        }
    ],
    "reviews": [
        {
            "course_name": "Persian",
            "review_date": "March 03, 2007",
            "review_content": "\nAn important point not discussed is his teaching abilities at the technical level, specifically, his ability to explain seminal points of grammar. \nThe official class textbook is his own, and handwritten in major parts. It is not clear on many issues, however, on major points of grammar, for example, the proper formulation of imperatives, subjunctives and jussives, it is beyond dismal. \nSupplemental texts (not required but) available in any bookstore, are far too pedagogical to be of use to the average student. I speak here of the well known texts by Wheeler Thackson and Ann Lambton, both useful tools, but often dense. Thus, it falls on the teacher to explain these points clearly, and Kasheff is lacking in this area. Nothing separates a good teacher from a bad one more than the issue of communication.\nMany students who take his class have no background in foreign languages. In order for a student to grasp Persian, they first need a primer in grammar (beyond what a verb, noun or adjective is), and he is not able to explain these necessary elements. Indeed, he claims to dislike grammar terms, which is regrettable because these grammatical terms are fairly standard, irrespective of language. Thus, even those students who do have a background in languages, are denied the necessary frame of reference by his refusal to identify a genitive as a genitive, and an accusative as an accusative, etc.\nIf you have to take Persian, then you have no choice. But if Persian is an elective, go elsewhere. \nWorkload:\nIf he likes you it does not matter how much homework is turned in on time. If he does not like you . . .Grading is completely arbitrary.\n"
        },
        {
            "course_name": "Persian",
            "review_date": "December 26, 2006",
            "review_content": "\nI have to agree with the majority of the comments posted here. Kasheff is arbitrary in his grading, and favorites do better than others. He is a good teacher, however, that is overshadowed by his classroom manners, where he can be rude to some, pleasant to the people he likes; further, he wastes time with his stories, including some that are inappropriate for a mixed classroom, like his tales about visits to strip clubs.\nUnfortunately, he is the only one who teaches Persian at CU. If you absolutely have to take Persian, then suck it up, be real nice to him in class, visit him during office hours, attend all classes, do ALL the homework and corrections, and pray for a good grade. If Persian is an elective, avoid him like the plague.\nWorkload:\nA lot, but necessary if you really want to learn the language. The more you do, the better  you will be, so do it all.\n"
        },
        {
            "course_name": "Persian",
            "review_date": "February 23, 2006",
            "review_content": "\nKasheff is a pretty damn good professor.  He's not perfect, but who is?  Those students who have complained about him on this website suffer from a lack of perspective and work ethic.  Allow me to explain...  For those that complain about his first year teaching book-- try learning from one the few published Persian textbooks (and they are slim pickings).  You will find that Persian teaching material is dismal and confusing.  Take it from someone like myself who learned first year Persian at another University with a printed textbook-- they're terrible.  Kasheff's material is as good as it gets and I think it speaks well of the man that he went to the trouble to put together a text book of his own, which I might remind everyone that he certainly was not obligated to do.  Appreciate it and be glad that you do not have to encounter the printed Persian teaching materials.  For those who complain of Kasheff's teaching style and recommend learning Persian elsewhere-- Persian instruction in this country is not good.  Kasheff does not teach particularly well, that I will grant, but see it in perspective-- no one teaches Persian any better.  So, if you want to learn Persian, my advise is to stick with Kasheff and do some extra effort so that you can get a lot out of his class.  This brings me to work ethic.  Look, I know in the ivy league, some students are used to sailing by in courses on grade inflation and like having everything laid out for them.  It's not so here, so if you want to learn Persian work a little harder.  Do some extra reading on your own, make the effort to connect all the little things he mentions in class (because contrary to popular opinion these things are not random, but thought out and appear again and again in the readings, examples, and tests).  Kasheff will not connect all the dots for you, but put your mind to work and do it for yourself, and you'll be fine.  Some complain that he plays favorites and picks on Iranians.  Perhaps, but only fairly and let me explain... I am one of his favorites because I work hard, turn in all my homework and on time.  In class he does berate people who say miss one of every three classes and are never prepared.  I find this incredibly fair.  Is he harder on Iranians-- only insofar as he expects them to know more because they knew more going in.  That is to say that Kasheff grades according to how far you have progressed.  If you walk in like myself not being able to speak a word of Persian and can mumble through a sentence or two after a semester, you get an A.  If you walk speaking fluent Persian because you speak it at home and after a semester can still speak fluently, but can read and write any better than when you came in, you don't get an A.  Again, I find this incredibly fair.\nLet me also expound Kasheff's good points.  He is brillant.  The man is a walking historical encyclopedia in Iran and has memorized thousands of poems (and anyone who studies anything related to Persian can tell you how important poetry it to Persian culture and learning).  He is also extremely willing to help students outside of class, meet with you in office hours, etc.  The man is not a saint and Persian instruction across the board in this country could be much much improved, but all things considered Kasheff is a valuable resource for students at Columbia and a good professor.\n"
        },
        {
            "course_name": "Elementary Persian I",
            "review_date": "December 27, 2005",
            "review_content": "\nSo I went into this class believing that there was some way to get a decent grade by doing my homework, studying, and participating.  Well....honestly, there is no way.  Kasheff's class is filled with mostly tangential material and he expects you to remember much of the useless crap he tells you.  The grading is pretty much completely arbitrary....he says you grade yourself, but at the end he pretty much gives you whatever he thinks you deserve.  There's absolutely no structure or indication of how you are graded.  The notion of homework is very nebulous as is the notion of tests.  The class is filled with random pop quizzes and its unclear whether they are graded.  He doesn't remember anyone's name, so its obvious he doesn't keep track of homework.  Even if you have a genuine interest in learning the language, such as I did, it is disheartening to not be able to do anything to get the grade you deserve.  Kasheff is not a bad man, or mean spirited as other reviews state; he simply is very set in his ways and opinions.  Beware to anyone who gets in his way!  If any notion of gpa has no meaning to you, then by all means take this class, its slightly entertaining but also slightly terrifying, since he enjoys embarrassing people openly in class.  \nWorkload:\nwhatever you want it to be\n"
        },
        {
            "course_name": "Persian",
            "review_date": "January 31, 2004",
            "review_content": "\nIf you are accustomed to neat textbooks and workbook exercises that help you learn grammar and vocabulary, you will be sorely disappointed with KasheffÂ’s Persian class. Kasheff wrote the so-called textbook which is actually a disorganized bundling of class notes you must purchase from CopyQuick. Frankly, I think itÂ’s garbage. It is certainly not as user-friendly as the material you receive in the Hebrew or Arabic courses at Columbia. What one of the previous reviewers said about KasheffÂ’s personality is true. The guy is obnoxious. He has a habit of dotting over a few of his favorite students. When one of his not-so-favorite students tries to speak, he lashes out at them if they make a mistake. He also has the habit of asking students very inappropriate personal questions with the obvious intention of humiliating them. One female student in my class burst into tears because of his verbal abuses.\nWorkload:\nIf you do all his assigned homework, itÂ’s still not enough. He expects you to make up extra homework for yourself if you want to impress him.\n"
        },
        {
            "course_name": "Persian",
            "review_date": "November 16, 2003",
            "review_content": "\nIve read a lot of the reviews here and I think they are wildly unfair. Kasheff is fairly odd but not as evil as some make him out to be.  He gives the impression of being a bumbling little sweetheart, but is sharp as a tack and i know that may throw some people off. The reason grades seem strange in class is that he gives  the impression that homework doesnt always need to be handed in or that he doesnt see every little face you make, but watch out becasue hes on top of it.  Kids who think they can just get by in his class have another thing coming. and as methodic a teacher as he is, he is also one of the most sincere and kind people i know of. His political views are quite strong, and he will challenge you on any issue.  Dont expect him to always listen to everything you have to say or even answer your questions, but give him a chance and listen to his stories and his rants. if nothing they are entertaining. and i dont know of anyone in their right mind who would actually COMPLAIN about his tangents.  fifteen minutes of Kasheff oration in a two-hour class can be great when you've had a long day and feel like you cant really absorb persian at the rate he ususally presents it. Just make sure you look mildly interested! In any case, his methods are unorthodox but you will learn to speak persian before you know it, and much faster than in any other class...grammar comes a bit later but somes nonetheless, you have to push him a little to explain certain things. On a scale of one to ten I'd give him a 6.5 overall--good and bad included.  Like i said, give Kasheff a chance and he will not only teach you real persian but hopefully win you over with his mischevious smile.\nWorkload:\nup to you and what grade you want\n"
        },
        {
            "course_name": "Persian",
            "review_date": "October 07, 2003",
            "review_content": "\nkasheff is the most unprofessional and obnoxious teacher I ever had. He really should be ashamed of the way he teaches or rather doesn't teach. In my opinion, he plays favorites with his students, giving higher grades to students he likes and lower grades to those he hates for the same amount of correct answers. Avoid him.\nWorkload:\ndaily assignments. he tends to make up the assignments on the spot after the class has ended and half the class is out the door.\n"
        },
        {
            "course_name": "Persian",
            "review_date": "September 08, 2003",
            "review_content": "\nI've had Prof. for two semesters. So far, I can see the negative and positive sides of the man which were reflected in the three other opinions from former students of his.  Personality: on one hand, if he likes you, he will encourage you, will give you a better grade. In this case, he is sweet and avuncular.  If he doesn't like you, WATCH OUT!  i've seen him tear perfectly nice people to shreds with a whip of his tongue-sometimes in a backhanded, circular kind of way, sometimes quite openly. it is really hard to watch, let alone endure that kind of castigation in public. anyway, before taking his class i heard he's hardest on iranians, and it's not totally false. i think he expects a certain type of behavior and respect from them that is very traditional. my advice: to get on his good side, seem very eager to learn, ask questions, and attend class regularly and on time. also, this sounds ridiculous, but don't dress loudly( trust me on this folks) or roll your eyes when he says something quaint or outdated-he's old but he's not blind. he's quite sharp when it comes to reading attitude, expression, and body language. if you are on his bad side , the best way to deal with this is to praise him to his face. lie if you have too dammit! it works!! he raked my friend across the coals of persian hell and then my friend changed his approach to dealing with Prof. K. Prof. K was surprised, but really softened up on him. Finally, if all else fails, memorize a persian poem or poems, and ask to recite it during class, or just spontaneousy burst into a recitation at the beginning of class. He'll definitely love you after that!! He's obsessed with poetry so that is the way to his heart. but like another reviewer said, if you want to do persian you have to deal with him. so unless you transfer out, or take persian at NYU, you will have to change your approach with him. trust me-it works. once you win him over, persian is a blast. i do agree however, that it shouldn't have to come to this, but hey, life's not perfect.\nTeaching Ability: Pretty good on most days. Sometimes however, Prof. K veers off on long-winding tangents, which are occasionally interesting. A quick look at the clock and then at the text in front of you (a gesture which he WILL notice you doing)  should get him back on course.  I think he's a bit weak in explaining grammar cohesively, so buy an intro. book, like the classic one by Anne Lambton. He speaks a lot in persian so make sure your aural and speaking ability is up to par if you are second year or advanced. He's patient with non-Iranians not speaking/reading well, but expects more from those with Iranian backgrounds.  For sure, he takes it seriously when he says his students are his \"sons\" or \"daughters\". Just make sure you are not a black sheep!!  \nWorkload:\nmoderate, reasonable. advanced persian -heavy on translation-6-8hrs of translation time per week.\n"
        },
        {
            "course_name": "Intermediate Persian",
            "review_date": "September 06, 2003",
            "review_content": "\nKasheff is the worst instructor (heÂ’s not a professor and never will be) I have ever had. I agree with the other reviewer who said taking Persian at another school would be better. In my opinion, Kasheff is rude, obnoxious, plays favorites, and is condescending. He is extremely discouraging. Someone mentioned earlier that people in the class with a problem with him should talk to him so that the class would be better. Well, I tried that. I tried speaking to him on a number of occasions, expressing my concern. I found him extremely defensive and he quickly lost his temper. His behavior inside the classroom and out is totally inappropriate. I worked very hard this semester and feel that I could have accomplished much more with another professor. Avoid him.\nWorkload:\nWorkload: in my opinion, you can put in as much effort as you want and it won't matter because his grading is so arbitrary\n"
        },
        {
            "course_name": "Elementary Persian, Intermediate Persian",
            "review_date": "March 09, 2003",
            "review_content": "\nSpending four semesters with Kasheff as your Persian instructor is a fate I would not wish upon my worst enemy. He is a very obnoxious man who can be extremely mean and sarcastic to those students in the class who are having difficulty grasping spoken Persian. I have no idea why he says the cruel things he says to students. It just discourages them and creates an unpleasant atmosphere in class. He is also an extremely disorganized teacher and a highly subjective grader. There is no course syllabus and no idea of how quizzes and tests count toward the final grade. In fact he doesnÂ’t even give letter grades, not even on the final exam. You are not sure of where you stand until the course is over and you see your course grade online. My advice to any students who wish to learn Persian is to take it at another university. The Persian program here is a mess just like the rest of the MEALAC department. Kasheff is the only instructor of Persian at Columbia so you will be stuck with him for four semesters if you chose Persian to fulfill your language requirement.\nWorkload:\nVarious tests, quizzes, homework assignments, and a final exam\n"
        },
        {
            "course_name": "Persian",
            "review_date": "April 03, 2002",
            "review_content": "\nIf you want to learn just the Persian language buy a tape and book. If you want to learn Persian come to Mr. KasheffÂ’s class. Mr. Kasheff is an elderly professor with the vigor of a young student. He is much like the Persian Grandfather we never had. When you leave his class you realize that you learned more than just how to translate Â‘my house is bigÂ’ but you learn a lot about the houses in Persia and the people living in them. This class is as much an education of Persian culture as it is language. Though it may seem intimidating to non-Persians, Kasheff make a very serious attempt to equalize the level of all students regardless of their background. Mr. Kasheff is a unique teacher that livens up classes with stories, poetry, and art (films and museum). He truly cares about his students and refers to them as his children. \nWorkload:\nweekly assignments vary. The more you do the happier Mr. Kasheff is.\n"
        }
    ]
}