{
    "prof_info": [
        {
            "prof_name": "Trent MacNamara",
            "prof_id": 11071,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "U.S. in the Era of Civil War and Reconstruction",
            "review_date": "December 17, 2010",
            "review_content": "\nTrent has the prowess of a Columbia doctoral candidate and the charm of a Texas boy. Together, it's quite a delightful combination in a very cute package (too bad he's married). I really enjoyed his discussion section. He is very knowledgeable about the material, and creates an environment where everyone feels really comfortable participating in discussion. I also like that Trent is interested in social history- he's writing his dissertation about the popularization of birth control (As he puts it, he's interested in when western cultures shifted from the view that children just happen to when they decided it was something they themselves could control.). I really liked that discussion often center around big social questions such as \"Why did poor white southerner fight?\" or \"Did the slaves actually work for their own freedom?\". However, Trent was also really knowledge about the political and economic factors of the times, and could talk at length about these things. I actually wish he talked even more though. My least favorite thing about the discussion section was that Trent often took a backseat and let the students talk amongst themselves. Of course he would intervene sometimes, but for the most part he really left us in charge of the direction of discussion. As a result, sometimes the discussion section was too full of the thoughts of undergraduates, which I didn't feel was extremely productive. The only improvement would be if Trent actually taught us more.\nIn addition, he is really available outside of discussion. He says he lives kind of far away, so he not on campus a lot, but he's willing to set up a time to meet with you. The best way to get in touch with him outside of class is via email. Also, he's willing to look at drafts of papers, which is always nice. \nWorkload:\nIn addition to the readings, midterm, final, and historiography paper, a total of six discussion posts or you can edit a relevant wikipedia page. Also, each student is assigned a day to prepare discussion questions over the reading. \n"
        }
    ]
}