{
    "prof_info": [
        {
            "prof_name": "Robert Belknap",
            "prof_id": 455,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 16, 2007",
            "review_content": "\nI was hesitant to stay in this class because he made us read extensively (more than the other classes). He will, however, never give you a bad grade when grading essays, which is a relief. Participation was not a big deal in my class. I thought his midterm was going to be impossible but our class did pretty well on it. The class, overall, is not a lot work. Just read and go to his office hours. He's a nice man.\nWorkload:\n2 essays (one longer and shorter). midterm. final. two pop quizzes.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "September 05, 2006",
            "review_content": "\nAll around fantastic. He probably has read every single piece of Western literature, but the beauty is, unlike other professors, he doesn't expect that the students have as well.  A pretty engaging lecturer who's class is neither overwhelming nor reductive. Plus, he's just so damn NICE. \n(Perk: expect an invite to his swanky penthouse apartment in the 90s for wine, fresh cheeses and fish and a dramatic reading of King Lear by the fireplace. But that's just the icing on the cake). If you get Belknap, stay in your section!\nWorkload:\nAverage. Participate every once and a while, standard lithum midterm/final, keep up with reading and he'll help you with the two papers to guarantee you'll do well (or as well as you can).\n"
        },
        {
            "course_name": "Russian Drama: Chekhov to Present",
            "review_date": "May 22, 2005",
            "review_content": "\nProfessor Belknap is the best Professor I have ever encountered  at Columbia. \nHis classes are increadibly interesting even for a non-native Russian. He has been traveling a lot to Russia since he was young and he can tell a lot of fascinating stories. His knowledge of the theater is amazing and this class will introduce some interesting theatrical terms.\nThe readings are not overwhelming and there is no midterm. The class is usually under 10 people so there is a lot of discussion going on an by the end of the semester it feels like you are leaving your family when it is time to say goodbye. \nThe paper that can be rewritten as many times as possible before the deadline (so the earlier yuo start the better it comes out)  is an analysis of two plays: mainly comparison with similarities and differences. Professor Belknap is so helpful with the papers that it is impossible to do badly.\nThe final is 3 hours at the end of the semester and will require the knowledge of at least half of the 30 plays that were read before and it is managable. \nOverall the greatest class ever, take it without hesiattion if you want to read fun dramas and have a great discussion.\nWorkload:\nNo midterm10-page paper due at the final examFinal exam\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "September 09, 2004",
            "review_content": "\nThis guy is amazing. First of all he is one of the few over-qualified teachers of lit hum. He seems to have read every book ever written. He spent several years in Russia studying Dostoevsky and Tolstoy. He knows the Aeneid almost by heart in Latin. And he can act Shakespeare better than any actor I've seen. Anyway, you can have all that and still not be a good teacher but that's not the case with Belknap. First of all, he wants every student to improve and he will go over every essay of yours with you. He will never give you a bad grade on an essay. He will work with you on it until you make it good. He makes discussion interesting without trying to control them like insecure grad students do. I could go on and on about this guy. Basically, if you can take any course with Belknap, DO IT.\nWorkload:\nvery reasonable. average workload. 2 longer essays (7-10) pages instead of the usual 3 shorter essays.\n"
        },
        {
            "course_name": "Tolstoy and Dostoevsky, Russian 19th. C. drama ",
            "review_date": "December 31, 1999",
            "review_content": "\nI think Belknap is one of the most erudite yet one of the nicest professors on campus. It's the first time I've been able to admire someone for knowing almost everything about all of literature and also for being a genuinely good person. He sings his colleague's praises without ever even mentioning his own books on Dostoevsky, although I understand he is quite famous in his field. (The lifelong learners, who flock to his Tolstoy and Dostoevsky course, are always a good indicator of reputation.) He allows rewrites (at least for smaller classes) because he wants everyone to do the best work they can. Because he knows something about everything, and because he is willing to let the class raise whatever questions it feels important (he's remarkably patient) the lectures can get off track, but then you realize that literature is about absorbing and reflecting. And naturally, he's very accessible outside of class. It's a joy to pick his brain on just about anything. No knowledge of Russian required. He teaches in English and is happy to fill you in on any cultural or historical background. \nWorkload:\nRussian writers never exactly kept anything short, but the readings for the above mentioned courses involve only primary literary sources. There is usually one medium (10 pages) but fun paper, and a midterm and final or just a final. All of the work is so enjoyable you'll barely realize how much of Russian literature you've absorbed. \n"
        }
    ]
}