{
    "prof_info": [
        {
            "prof_name": "Alan West",
            "prof_id": 1929,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Molecular Engineering & Product Design",
            "review_date": "April 13, 2010",
            "review_content": "\nThis is the Pre-professional course for Chemical Engineers.\nAlan West is a likable guy who really knows what he's talking about, especially when it comes to his research area, electrochemistry. Sometimes his lectures can be a little disorganized, but if you write down all the formulas he writes on the board, listen to him, and do the readings, you can understand the concepts, which is important for the quizzes (which are more like exams, which he admitted after the first one). He says that if you do the homework, you will be okay for the quizzes, but you really should look over the notes and read ALL of the readings he posts on Courseworks.\nIt really isn't necessary to buy the book for this course, since everything you need is given in class or posted online, but it's an interesting read.\nThe class is made up of three modules, each in groups of three or four that he assigns. Each module has a homework assignment which basically walks you through the design project. For one of the modules, you will be assigned a written report, one module an oral presentation, and one you will only have to do the homework.\nThe written report is about five pages, split between the members of your group. The oral presentation should be about 10 or 15 minutes. Each group member needs to talk for at least 3 or 4 minutes.\nAttendance is mandatory and makes up 20% of your grade. The TA passes around an attendance sheet a few minutes into class. If you're a little late, you can usually still sign in before the TA takes back the attendance sheet.\nThe homework is 15%, the oral presentation is 15%, and the written report is 15%.\nThe quizzes (more like exams) make up 35% of your grade.\nHe also brings in guest lecturers a lot to talk about their experiences. They really aren't relevant to what you are doing, but you have to be there, and some of them can be pretty interesting.\nWorkload:\nMost of the work is done with your group, so each module generally involves at least two or three meetings with your group. How long you actually spend on it depends on how well you or your group members understand the concepts. He says you don't need to, but it helps to put in a couple hours of studying before the quizzes. The median for the quizzes is usually a high B (about 86), so nothing's curved. Overall, it's a pretty interesting/fun class. You don't really have a choice if you want to major in Chemical Engineering, but at least it's an enjoyable requirement. This class really is what you make it.\n"
        },
        {
            "course_name": "Materials and Energy Balances",
            "review_date": "January 21, 2004",
            "review_content": "\nProfessor West is a pretty nice guy, although he seems a bit removed from his students (perhaps he's scared of them?)  The lecture part of this class can be pretty boring, but the application of the material in the lab and group project can be very interesting (although tedious at times).  The professor is the most monotonous I've ever had (no lie!), but the subject matter is pretty boring.  Attendance isn't that important, so if you'd prefer to read/skim the book, go for it.  \nWorkload:\nabout 5 or 6 homework assignments, lab (a few hours in a group over the internet), Group project complete with report and presentation.  midterm, final (open book, open notes on final - but that doesn't make it easy).  the curve is good, but the class is about half soph and half juniors and since there's thermo and other subjects that the juniors have more experience in involved, the sophomores will have a slightly harder time with it and with the curve\n"
        },
        {
            "course_name": "Materials and Energy Balances",
            "review_date": "January 08, 2004",
            "review_content": "\nawfully boring, but the material is that way. admits its a boring class many times during it, but its an easy class. may take a little while to get what to do, but once that happens the class is easy.\nWorkload:\nlab, midterm, project, final. curve is great. project is not hard and everyone gets an A.\n"
        }
    ]
}