{
    "prof_info": [
        {
            "prof_name": "Dorothy Ko",
            "prof_id": 1302,
            "total_reviews": 15
        }
    ],
    "reviews": [
        {
            "course_name": "Gender and Power in China",
            "review_date": "April 21, 2015",
            "review_content": "\nProfessor Ko is the best professor I've had at Columbia all year. Her lectures are funny and engaging-- she won't spoon feed you the reading, but rather work to explain the full historical moment and place the reading in context. She *will* ask that you participate and answer incredibly difficult/leading questions, and you shouldn't be afraid to. \nShe's very good at making sure white people don't dominate and derail a conversation about China, especially in a room full of women of color-- she's super mindful of class dynamics. Professor Ko is real about asking white students to check their orientalist impulses and encouraging students of color to be more forthcoming and bold in their answers. I found this to be incredibly empowering as a student of color. \nShe's also genuinely the kindest person in Office Hours. I've gone to talk to her about articles I've read, about pursuing a history major. She is serious about mentoring younger women of color who want to go into academia and is *very* serious about her teaching in general. Professor Ko truly goes out of her way to help you. \nHer TA this term, Gal, is also amazing! So brilliant! \nWorkload:\nShort readings. You should do them, always. \n4-5 summary papers (2-3 pages each) + final paper (5-7 pages) \n"
        },
        {
            "course_name": "Chinese Feminisms",
            "review_date": "December 13, 2013",
            "review_content": "\nI took Historical Approaches to Feminist Questions with Professor Ko and loved every minute of it! (for some reason CULPA's not showing this class, but I wanted to make sure Professor Ko got a good review somewhere on CULPA!) This woman is everything you could want in a professor: she's incredibly intelligent and knows exactly what she's talking about, she treats her students like adults and allows them to have their own insights about which she is happy to have conversations, and she's seriously funny, although her humor always catches you off guard, since she's not the type you'd expect to make the types of jokes that she does.  The class was great.  Professor Ko assigned a lot of reading for each meeting (about 50-100 pages per week) but she speaks so passionately about all of the readings that she really makes you want to stay caught up.  Seriously, I hardly did any CC reading this semester, but was happy to read 50 pages about gender differences across cultures even when I knew I wouldn't be required to prove to her I had done it.  I found the class pretty enlightening; we talked about all these different ways of thinking about things that seem so natural to us and Professor Ko really got us to queer our perceptions of what we identify as normal.  I would definitely recommend this class to anyone.  The material was interesting and the professor was remarkable.\nWorkload:\nWeekly readings, around 50-100 pages per week, 8 reading responses throughout the semester (you're required to write responses for the first 4 weeks, then you choose which other 4 weeks you want to write), a final paper 12-15 pages, you get graded on the outline for the paper and on the paper itself.\n"
        },
        {
            "course_name": "Chinese Cultural History",
            "review_date": "May 05, 2011",
            "review_content": "\nThough her teaching methods are rather unconventional, Professor Ko is extremely intelligent, and her lectures are insightful and engaging (sometimes she brings on the sarcasm too). She teaches history with an anthropological bent, which does need some getting use to, but the readings are interesting and the time period (Ming to late Qing) is fascinating to explore. Prof. Ko is also really nice and sweet! She occasionally brings quirky artifacts to class, like the time she came back from a trip to somewhere in Asia (forgot the exact place), and gave us paper charms from the temple she visited. A class with Prof. Ko at some point in your experience at Columbia/Barnard is definitely recommended!\nWorkload:\na fair amount of reading (totally manageable), an in-class midterm (IDs and essay; she gave us the essay topics beforehand and said we could use our notes for the essay portion of exam), a couple of short homework assignments (basically question and answer), one short paper, a final (she gave us the option of take-home or in-class, depending on which you felt more comfortable with; topics were also given beforehand). she said at the beginning of the term that she would give pop quizzes if she senses that the class is not doing the reading, but in my memory, she only did that once. \n"
        },
        {
            "course_name": "Body Histories: A Case in Footbinding",
            "review_date": "March 03, 2009",
            "review_content": "\nKo is not only a brilliant intellectual she is also an amazing and creative professor who is totally dedicated to her students. The best thing about this course and Ko in general is that she abhors the monotonous analytical essay writing that we all have learned the formula for and demands her students to be creative and go outside their comfort zone. The assignments for this class were loosely defined and she genuinely wanted to be surprised with our definitions. Her classroom is an open, creative, and thriving home for intellectual discussion, and her clothes are AMAZING. \nWorkload:\nOne paper, one object study and one group project where you can pretty much do anything you want. \n"
        },
        {
            "course_name": "Body Histories: A Case in Footbinding",
            "review_date": "December 10, 2008",
            "review_content": "\nI can only say the most glowing things about Professor Ko - she is by far the best professor I have had at Columbia. The topic might seem obscure to those who do not specialize in Chinese history or gender studies but the majority of people in the class specialized in neither of those fields, and all were there because they had an interest. I think that is all Professor Ko cares about - that her students are interested and engaged in the material...and it's not hard to do so when the readings Professor Ko picks out are insightful, thought-provoking, and enjoyable to read. There are few other classes where you will read serious scholarship on the Chinese home, bawdy erotic texts, and scholarship on fetishism in the span of a few weeks. Additionally, much of what we are reading are the only sources on the topic, so we were able to really dig in and discover new things. This class is groundbreaking and one of a kind, if you have even a spark of interest I highly recommend that you take it.\nShe is an inspiration to be in class with because she is THE expert on what she studies and her knowledge is unrivaled at Columbia or any other university in America. Yes, some people think she is a little odd (she is more grounded than most of the other professors I have had though, to be honest and I didn't find her odd at all) but it is only in the most endearing and wonderful way, it won't prohibit you from getting familiar with her and speaking with her. She brought us twisted fried dough inspired by one of our readings and she talked about wanting to get a steel claw - these things only made her more interesting. I would highly recommend this class, or taking ANY class with Professor Ko, to any student who wants to have their assumptions broken down and their mind expanded...yes, that sounds cheesy but Professor Ko is THAT good.\nWorkload:\nThe workload isn't over the top for a seminar - we had one large group project, which she wanted to be creative, a small paper (5-8 pages), a small object study (3 pages), and a final paper about our project (8-10 pages). We had between 70-150 pages of reading a week and a weekly discussion posting which could be a small paragraph or a few paragraphs - it was up to the student!\n"
        },
        {
            "course_name": "Fashion",
            "review_date": "April 13, 2007",
            "review_content": "\nWell, the people in the class were all pretty weird, but what do you expect from a Barnard Fashion course.\nKo was knowledgeable, kind, and organized. I believe that she is probably quite intelligent and eloquent, unfortunately, she seemed to feel that she needed to dumb everything down for the audience (she was probably right).\nThe readings are all pretty interesting and you will learn stuff, but it is kinda sad that there is no pressure/arena in which to take the ideas further till the final.\nWorkload:\nWeekly readings of various sizes (usually on the longer side, but easy because of the layman writing style--fashion is still a young in the world of academia) with each person/pair presenting the lectures/leading the discussion once. (And we were testing weekly participation in the form of web postings, paragraph reactions, etc....don't know what she has settled on.) A final project in the form of a 15 page essay or a homemade fashion piece (or a mix, if you are creative).\n"
        },
        {
            "course_name": "Chinese Feminisms",
            "review_date": "March 25, 2007",
            "review_content": "\nHaving the chance to take a class with Professor Ko was one of the reasons I decided to come to Columbia and she surely does not disappoint. Perhaps it was the material itself or the interesting viewpoint Professor Ko brings to class (Chinese studies legend feminist fashionista) but every class period was incredibly interesting. She is very open to your views about the material even if they are not her own, and if you have limited knowledge of Chinese history/culture, she is even more accepting of your views. In addition to leading a fascinating class, Professor Ko is an extremely nice human being who is always willing to bring you extra materials (as she did for many of the final projects) or discuss anything with you outside of class. Furthermore, she DOES look at her students in class, don't worry about that! \nWorkload:\nTwo papers (5-8 pages each), a final presentation, weekly posting, regular participation\n"
        },
        {
            "course_name": "Chinese Cultural History",
            "review_date": "January 03, 2006",
            "review_content": "\nProf. Ko is interesting.  She's not quite as eccentric or unapproachable that the other reviewers make her out to be.  She's only interested in your arguments so don't just randomly piece together things without any rhyme or reason.  That being said, she's pretty open to your interpretation to chinese culture, because she assumes that you didn't take a previous class in chinese history so any oddball theories (backed up with evidence) are pretty much okay with her.  As for her \"unusual\" mannerisms, there's no rule that you have to look at your students for the entire lecture.  She has a different style for teaching, learning, etc., and she even stated that she's a \"contrarian\".  All in all, I found her class to be fun, somewhat \"eye-opening\" and relatively easy.\nWorkload:\nReally manageable--a short take-home, in class midterm (ID's and essay) and take-home final (also essay)\n"
        },
        {
            "course_name": "Body Histories: A Case in Footbinding",
            "review_date": "March 28, 2005",
            "review_content": "\nThis is without a doubt the best class I've taken at Columbia (I don't wanna hear \"oh, it's a Barnard class\" - this class is worth it). If you are interested in women's studies, Ko's class is a must. She brought in actual shoes that women wore (three to five inches long!) and one of our projects was to find its origin and what type (class, age. etc...) of woman would have worn it. I cannot express how delightful this woman is. Our class discussions are wonderful and always thought provoking. There are weekly postings and it is necessary to do all the reading, but for a seminar the workload isn't that bad. Range from 25-100 pages a week, and most of the time it's not more than 50. The reading are interesting and you'll want to do them (promise). If you are a history major or looking for a major cultures II, you NEED to take this class. \nWorkload:\nClass participation: 20%Object study: 20%First essay: 20%Group project: 20%Final essay: 20%\n"
        },
        {
            "course_name": "Chinese Cultural History",
            "review_date": "March 02, 2004",
            "review_content": "\nYou will walk out of this class saying \"huh?!!\"   I have no idea why people rave about Prof. Ko.  Hers was the probably the worst class I've ever taken.  She NEVER looks at her students, therefore class discussion never ensues and questions are not encouraged.  She delivers her lectures in an oddly, measured cadence, which only serves to further muddy whatever point she's trying to get across.  Profound?  Please!  Personally, I think there are much better ways of conveying impressive knowledge and insight other than speaking in riddles.  But here's a tip:  if you want to take this class, make sure you spit back some meaningless, seemingly profound mumbo-jumbo back at her.  You'll probably get an A.\nWorkload:\nReading isn't too bad, 1 paper, midterm and final.  Questions for exams are provided in advance.\n"
        },
        {
            "course_name": "Chinese Cultural History",
            "review_date": "January 23, 2004",
            "review_content": "\nI agree with the previous poster. People go on and on about Ko as though she is some academic dynamo. Her class was average at best - I was expecting a lot more from her though.  I think people rave about her because she is a sweet person. Anyway the class was easy so take it if all you want is an A.\nWorkload:\nsame as stated below.\n"
        },
        {
            "course_name": "Chinese Cultural History",
            "review_date": "January 15, 2004",
            "review_content": "\nIt takes you a little while to get used to Ko's lecture style.  She's very dramatic, lots of inflection, looks thoughtfully at the ceiling and the floor, but never at the students in the class.  I was a little disappointed with the material in the class, which deals more with examining China's \"cultural icons\" than actual Chinese culture.  It's kind of a greatest hits of Chinese culture.  Looking back, I didn't learn that much.  Prof. Ko herself is very caring, always considering the concerns of her students.    \nWorkload:\nFairly easy.  Read 5 books.  1 short paper, midterm, final.\n"
        },
        {
            "course_name": "Chinese Cultural History",
            "review_date": "January 17, 2003",
            "review_content": "\nEasily my favorite class so far.  I decided to take her class on whim, and now feel supremely lucky to have had the opportunity to have her as a teacher.  Prof. Ko is extremely sharp and intelligent, but not in a condescending or forceful manner.  In fact, she is kind and thoughtful, and has a great, sometimes dry sense of humor.  As a previous reviewer mentioned she has awesome style and fantastic clothes so it's fun to see what she'll be wearing each time class meets.  She makes sweet wise cracks about popular fashion and culture also, like \"Let's suppose you were at the Gap . . . no, forget it, the Gap is OUT right now.\"  Her methods of teaching are wonderful, she makes you feel important and comfortable sharing your ideas, and her lectures always offer a new twist or surprise on history that you may have thought you knew.  I found that I was making all kinds of connections (not the cheesy high school kind) and seeing subleties which intrigued me\nWorkload:\na couple papers, short 5-10min quizzes which are very straightforward and usually have a lot of opportunity for opinion or multiple \"correct\" answers, mid term and final-- she gives out study guide and gives essay questions.\n"
        },
        {
            "course_name": "Women and Gender in Chinese History",
            "review_date": "December 01, 2002",
            "review_content": "\nDorothy Ko is my favorite teacher at Columbia. Every word that comes out of her mouth is interesting and profound. She also cares a lot about her students. Make sure to take a class with her before you graduate!\nWorkload:\nthree 5-7 page papers\n"
        },
        {
            "course_name": "History of Modern China I",
            "review_date": "November 25, 2002",
            "review_content": "\nProfessor Ko rocks-- she's an antropologist teaching history, and her resulting cultural emphasis makes class doubly interesting. plus her outfits are sublime-- total fashion plate academic chick. her syllabus was great for this class-- mixing more conventional historical accounts with chinese murder mysteries. plus, well, she's chinese. she knows. \nWorkload:\nfair amount of reading-- 2 papers (plus midterm & final)-- fair grader\n"
        }
    ]
}