{
    "prof_info": [
        {
            "prof_name": "John Collins",
            "prof_id": 153,
            "total_reviews": 45
        }
    ],
    "reviews": [
        {
            "course_name": "Methods and Problems of Philosophical Thought",
            "review_date": "July 20, 2015",
            "review_content": "\nThis class is a great introduction into philosophical thought. I came into this class having no formal education in philosophy, and I learned a ton. His heavy analytic style may be a little bit frightening in that he mostly talks about ideas and arguments by organizing them in steps, which makes the entire thing a little less \"fun\" and a little more rigorous. However, he is an engaging lecturer, has a great accent, and is very helpful during office hours. I would definitely recommend this class to anyone unsure about whether to take it. You will finish with a very solid foundation in philosophical content and style.\nWorkload:\nLight. He posts a lot of readings but you don't necessarily have to read them to understand the lectures or do well on the tests. \n3 homework assignments that didn't take very long (they have to be less than a page in length or he won't accept them).\n1 midterm\n1 final\n1 final paper 5-7 pages\n"
        },
        {
            "course_name": "Methods and Problems of Philosophical Thought",
            "review_date": "May 14, 2015",
            "review_content": "\nIf you have the opportunity to take this course with Professor Collins, I strongly recommend you do so. \nThe lectures are very interesting and, when time allows, he will permit the student's questions to drive the conversation, often for the betterment of the class. The only time when time will not be an issue is when Professor Collins recalls a witty story or a philosophy joke, and will undoubtably end up telling it. Although the stories and jokes may end with silence, his lectures are, more often than not, very funny. As stated in the previous post, you will see No! on your returned papers, at least if you write philosophy papers of the same poor quality as I do, but the grading is fair. \nIf you are new to philosophy, as I was, do not expect an easy transition into the subject, the first topic was time travel. If you have never experienced an extreme level of confusion, so extreme that you may be convinced you have just suffered a stroke, you will when you read a philosopher's explanation of time travel. You will also never be able to enjoy Back to the Future ever, ever, again. \nOccasionally the link to the assigned readings will not work and the notes will not be posted, just bring it up to him before or after lecture and it will get fixed. I do not recommend emailing him.\n\nWorkload:\n4 short papers, 400 word max; Final paper 5-7 pages; Mid-term shocked a few people, Final was the same format. I highly recommend you do all of the assigned readings, especially in preparation for the mid-term and final.\n"
        },
        {
            "course_name": "Methods and Problems of Philosophical Thought",
            "review_date": "April 13, 2015",
            "review_content": "\nDr. Collins gives new life to the stereotype of a crazy philosopher. White-haired, pot-bellied, digressive, chalk-throwing and brilliant, he suffers no fools. Be ready for the consequences. He and his TAs will not hesitate to return assignments marked in red with \"NO!\" and \"this makes no sense.\" While the workload of his marquee class - Methods and Problems of Philosophical Thought - is low, don't expect points just for effort.\nBut if you're philosophically inclined, good at Socratic discourse, and curious - by all means take the class.\n \nWorkload:\nLow\n"
        },
        {
            "course_name": "Epistemology",
            "review_date": "March 09, 2015",
            "review_content": "\nProfessor Collins is, simply put, the best professor I have ever had at Columbia.\nBut if he's not your style, you will not have a good time in his class.\nI had him for both methods and problems and epistemology, and the difference between a 120 person class and an 8 person class was huge.  In Epistemology, Collins could actually get to know each and every one of us, and he was honestly interested.  It's a tough subject to master, but he went clearly and methodically through every subject, making sure everyone got what was going on.\nIf you are a fan of syllabi and structure and knowing exactly what's on the exam, this is not the professor for you.  Our \"syllabus\" was a list of topics that he wanted to get to at some point.  He writes his exams the morning of the test, and if you ask him what's on it he will honestly tell you that he doesn't know.  If that bothers you, don't take a class with Collins.\nIf you're a fan of philosophy and really thinking critically, this is the class for you.\nThis is the kind of class that will keep you up at night, not because you're in butler studying but because you're lying in bed thinking about that days lecture and wondering if we know anything at all.\n\nWorkload:\nMidterm, final, both very easy if you went to class.  A few (3-4) 1 page assignments that can be tricky, but he allowed re-writes if you wanted.  Total reading <50 pages for the entire semester.\n"
        },
        {
            "course_name": "Methods and Problems of Philosophical Thought",
            "review_date": "April 21, 2013",
            "review_content": "\nJohn Collins is an amazingly lecturer and also the laziest person I have ever met. \nOn the first point: his lectures are incredible. He is hilarious, he goes through the material slowly and clearly, he makes everything and anything interesting, and he responds so thoughtfully on-the-spot. If you take this class, go to the lectures and you will forever see the world differently. (I still talk about a lot of the material to anyone who will listen.)\nOn the second point: he is so unbelievable lazy. He writes his tests the morning of (for a 9 AM class); the upside of this is that if you go to his office hours the day before, you know exactly what topics will be on the midterm/final. He flees the scene after class, and I once saw a student catch him before he left and ask to set up special office hours (because he had class during the regular office hours) and Collins told the student to email him. \"I have emailed you,\" said the student. \"Email me again,\" Collins said. \"I have,\" the student said. \"I've emailed you three times now.\" Collins was just kind of quiet for a second, and then he looked at the kid and said \"Well you've really got me in a corner,\" and then walked out of the classroom. I have never seen a teacher so shamelessly avoid work.\nI would definitely recommend this class: both what he teaches and what he does will provide you material to talk about for many years.\nWorkload:\nNo work. Literally, there is almost no work. Weekly homework assignments that take ten minutes. A midterm and a final (easy if you've gone to class).\nIf you're only taking four classes in a semester and this is one of them, then you are a lazy alcoholic college student, because this class is no work.\n"
        },
        {
            "course_name": "Methods and Problems of Philosophical Thought",
            "review_date": "August 23, 2012",
            "review_content": "\nOh well well, where to start? First of all, I enjoyed Collins's lectures. He is hilarious, fairly articulate, and structured compared to a lot of other lecturers in the philosophy department. He would proclaim in his very first lecture that he would grade harshly. That is not true - median in midterm is a clear cut B+, which is a standard Columbia curve. Despite the nature of this course as an introduction to philosophy, Collins spends most of his time talking about epistemology and logic but barely touches on ethics or more literature oriented philosophy. And he admits it himself. While this is understandable because a serious philosopher does not give a damn to what other philosophers say, you should definitely think again if this course is really for you. He sort of has a skeleton of which topics he will talk about, but he follows it loosely. Quite a few lectures seem to be of what's going on in his mind on that particular day. Having said, he talks about stuff that is not unheard of, which allows you take on some new perspective and help clarify some stereotypes. That is the good part. Midterm and final are in the same format, around fifteen short response questions, covering everything in class. Questions are very standard, not testing on your philosophical talent, but just how much attention you've paid to his lectures. If you manage to take notes diligently and copy down every words that spit out of his mouth, you have a good shot to ace the exams. That is the sweet part. One thing could potentially disturb some people is that a lot of arguments tend to be directed towards Collins's understanding. This might not be the most ideal scenario since this course is supposed to introduce philosophical argument but not to reassure opinions. But again, a serious philosopher can't stand a second opinion, let alone to teach one. Overall, Collins is really sharp and not arrogant (not sure if he is approachable though). His lectures are insightful and worth listening but don't expect a smooth or very structured lecture series.\nWorkload:\nfour 400-word assignments but somehow winded up to 7 in the end; One 7-15 page paper which is based on his lectures; readings close to none; one manageable midterm and final. Grading could be random. \n"
        },
        {
            "course_name": "Rational Choice",
            "review_date": "January 07, 2012",
            "review_content": "\nI am not the type of person to speak negatively about a professor, but I just needed to do this for the good of our school and for anyone who is ever considering taking a class with John Collins.\nCollins is funny and adorable; he can blow your mind and, to some degree, make you think about your life differently.  But it stops there.  As a professor for Probability and Decision Theory he was completely negligent and indifferent about the class.  At several times during the semester, I thought \"maybe he's just trying to test the limits of how little effort one can put into a class and still get through the semester...\"  I'm not saying he's lazy or anything...for all I know, maybe he was going through a lot that semester.\nTHE GOOD\n- he's funny\n- he digresses and talks about interesting things\n- he doesn't punish you with his grading\nTHE BAD\n- he does not respond to emails, no matter how many times you reword them and send them\n- he does not post his office hours online, so that if you want to meet with him to talk about something you sent him 4 emails about, you have to get him before he ducks out of class at the end of his lecture\n- he does not give a syllabus\n- he changes his requirements over the course of the semester so you never know how you're doing or even how you COULD be doing in the class\n- he does not give assignments back...not even the midterm...so you don't know what you did right or wrong\n- his exams test you on things that you wouldn't know from the class...which I guess wasn't that surprising since there was nothing substantive taught in lectures to actually be on an exam\n- he promises to give weekly readings...he gave ONE for the entire semester.  he said he would post another reading at the end of the semester, but never did\n- he promised to give us a written assignment (40% of grade) every 1-2 weeks.  he gave TWO for the entire semester\n- he does not use Courseworks, like every other professor at Columbia (I think they are actually required to)\n- he cancelled class 3 times\n- he promised to post notes for the class throughout the semester.  He posted them the DAY BEFORE the final\n- he often came to class and realized he was unprepared to teach things that he was planning on teaching\n- he held a review session for the final (what a saint!) but everyone was so confused about what they should even ask him that he wound up just teaching some new concepts\n- his grading had to have been very arbitrary...I thought I must have failed both the midterm and final but still got an A- for the semester.  I think he probably just realized that he was so neglectful all semester that he couldn't rightly give anyone a bad grade\n\nWorkload:\n2 short assignments\na midterm and final\nnothing else\n"
        },
        {
            "course_name": "Metaphysics",
            "review_date": "May 29, 2011",
            "review_content": "\nOh where to begin with metaphysics...\nThis class was hilarious, pointless, challenging, and useless all at the same time.  In fact, the only way that one can sum up the absurdity of this course is to look at the absurdity of the professor. Collins exhibits unexpected strengths and unexpected weaknesses. The most apparent thing about Collins is his utter lack of professionalism. This lack manifests itself in many way including but not limited to: the notable absence of any syllabus that actually tells you what you are going to learn in the course (for the trolls out there, know that there is a 'listing of readings and assignments' but it is updated as we go which means you never know where the course is headed), Collins' utter rejection of the idea that he needs to put any of the topics we discuss in context (i.e., so that you could see where a particular debate fits in to the larger field of philosophy), and the lack of a grading rubric, a set number of assignments, or a description of how much each assignment will affect one's grade. In my opinion, Columbia professors should be allowed to teach their classes as they wish provided they meet certain a criteria of professionalism which Collins simply does not possess nor demonstrates any desire in possessing. This unprofessionalism leads to all sorts of frustrations from not knowing how you are doing in the course to being bullied in class for offering an opinion that is wrong and (in Collins' opinion) stupid.\nSo now that we have gotten why you should not take this class out of the way, let me pander to those who really love Collins so that we can really understand why this professor is so contentious.\nDespite all of his unprofessionalism, Collins does do a tremendous job of stimulating debate. Be warned, however, that this is not meaningful debate. Collins likes to talk about what redness is or whether it is possible for two objects to be located in the same space. These questions are not interesting because they have no impact (or potential impact) on our world. Despite their lack of importance, the questions do have a way of teaching you to be a good critical thinker and a good debater. Collins is capable of describing a number of good argumentative techniques that will be genuinely helpful to you in the future. This is why some may enjoy Collins. If you can set aside the pointlessness of the class and the lack of professionalism and simply focus on perfecting one's argumentative skills, then you may enjoy this class.\n*breath*\nNow, on the other hand, Jon Lawhead is an absolute joy. The man was empathetic with the fact that we had to suffer through this joke of a class, he answered our questions in a clear, consistent, and comprehendible way, and he was totally approachable. Everything good in TA can be found in Jon, and I recommend that you try to be in his section anytime he is in a class.\nWorkload:\nOkay so this is probably useless because there is no way of saying whether this workload will be the same next time Collins teaches this class, and there is no way to say how much he weighted each of these things but here it goes:\n4 400 word assignments (he originally said there could be up to 7 of these) on questions that Collins thinks up after a given lecture of his choice\nMidterm\n5 page essay on either a question he gives or a topic of your choice if you are into that kind of thing\nFinal\n"
        },
        {
            "course_name": "Methods and Problems of Philosophical Thought",
            "review_date": "March 15, 2011",
            "review_content": "\nAn entertaining and enlightening introduction to the different fields of Philosophy, Methods and Problems was certainly a course I do not regret taking. Prof. Collins makes the class additionally enjoyable as his personal investment in the problems is palpable. The topics covered included the subjectivity of color, logical necessity (and yeah, in that context we spent a lot of time on time travel), consciousness and philosophy of mind. If you sat through more or less stale history of philosophy courses you'll find the hands-on experience a welcome change. On the downside (for me) but understandably, given Collins' focus on metaphysics and logic, ethics and political philosophy were not at all talked about.\nWorkload:\nA few dense readings, mid-term, final (both incredibly fun to solve - yeah, solve). A few short assignments of 400 words and a final paper of five pages. While not an easy A it is quite possible to get one if you stay on top of the material.\n"
        },
        {
            "course_name": "Methods and Problems of Philosophical Thought",
            "review_date": "November 19, 2010",
            "review_content": "\nJohn Collins whose course I have actually taken, IS the greatest professor at Columbia.  If you do not take a course with John Collins you are the most foolish student at Columbia.\nJohn Collins is great.\nI will add, that as John Collins frequently discusses traveling back in time to the moment of one's conception, that if I could travel back in time to the movement of John Collins's conception, the beams of light and singing of angels would be more glorious than any moment in my time at Columbia.\n\nWorkload:\nHeavenly\n"
        },
        {
            "course_name": "Methods and Problems of Philosophical Thought",
            "review_date": "August 03, 2010",
            "review_content": "\nFor all you freshmen out there coming in wanting to take an intro philosophy class, this class is not exactly a home run. Yes, it's a solid intro class and Collins is ridiculous and very funny, but you'll walk out wondering what exactly it was that you actually learned. There's no set syllabus, and most of the semester just involves him rambling on about whatever he feels like talking about. With that said, the work load is INSANELY light, with 3-4 400-word maximum assignments about whatever random philosophical question/concept he decides to test you on.  Another upside is that there is almost never any required reading, but these both come with the additional downside that you have no idea what exactly to study for the midterm or final unless you took supremely copious notes on whatever was spewing from his mouth during lecture. So take notes. Diligently. Regardless of all the above facts, his grading seems to be totally arbitrary, so just ask smart questions (he loves being challenged) and hope that he likes you. This course was actually just enough to turn me off from taking philosophy ever again because I did not find it to be stimulating in the slightest, but if you are set on taking philosophy, this course will do the job and Collins won't bite.\nWorkload:\nImpossibly light, with the aforementioned 3 or 4 400-word/1 page maximum assignments and basically no required readings ever (there might have been one). Classic midterm and final which just involve a lot of writing but aren't too long.\n"
        },
        {
            "course_name": "Epistemology",
            "review_date": "May 02, 2010",
            "review_content": "\nThis man is hilarious, engaging, intelligent, and knows how to lecture. He clearly enjoys what he does and I enjoyed listening to him lecture.\nThis course went rather slowly, belaboring details, but Collins could make almost any subject at least somewhat interesting.\nThere is rarely any reading or syllabus, and there are opportunities in class for discussion.\nHe quoted a student as saying to him, \"Now that I've completed your course, I know even less than when I began\", and pointed to that as one of his proudest moments. He follows a slightly-combative, discussion-based pedagogical style which I enjoyed but may turn some people off.\nHe invented the word \"comundial\" on the fly, meaning, \"in the same world\".\nWorkload:\nVery light. Tough but fair grader.\n"
        },
        {
            "course_name": "Methods and Problems of Philosophical Thought",
            "review_date": "December 17, 2009",
            "review_content": "\nJohn Collins, a brilliant and careful thinker, leads this course in an excessively roundabout fashion, with few readings, a meandering syllabus, and lectures that are always deeply provocative of thought and entertaining to boot. He seems a rather disorganized man, and thus the seven short assignments he promised turned into three, and he was often a week late in sending out questions and topics for assignments. Professor Collins will attempt to introduce philosophy to you by a series of tricks and gimmicks: he wants one to learn philosophy by experience of it, and will try his best to make that experience as simultaneously frustrating and rewarding as possible. Take this course if you want, essentially, to be a more careful thinker.\nWorkload:\nThree short assignments, one midterm, one final exam, one 5-7 page final paper.\n"
        },
        {
            "course_name": "Methods and Problems of Philosophical Thought",
            "review_date": "September 14, 2009",
            "review_content": "\nJohn Collins is an unashamed egomaniac. If you like that - if you, likewise, are an aspiring egomaniac, but simply lack the experience/degrees/age/money to express it unabashedly - then this class will tickle your fancy. It's amazing to see a professor so in love with himself, who could not care less about the syllabus, and who simply wants to masturbate a few thoughts/concepts to please himself. Other than that, or because of that actually, John Collins is quite entertaining in small weekly doses. I didn't really take much with me from the class, except remnants of discussions concerning light, color, a few \"is\" and \"is not\" word plays.\nThis course can't really be taken seriously with this professor, but then again, it's an intro course, so who wants to take it seriously?   \nWorkload:\nNothing really. One or two short-responses, mId-term and exam (both in class). I did none of the reading, didn't need to. Didn't do particularly well, but then, like I said, I didn't read, and I didn't re-read my class notes. If you do re-read your class notes, however, that's all you need. Collins grades somewhat at whim, according to fancy.  \n"
        },
        {
            "course_name": "Methods and Problems of Philosophical Thought",
            "review_date": "January 11, 2009",
            "review_content": "\nThis was a good course to get you thinking about the most basic of philosophical problems, but it didn't move much beyond that. Collins let the class choose most of what we learned, talking about things like free will, colors, time travel, etc. He is a pretty good lecturer, taking questions and explaining logical proofs well, but often the views he presented were very narrow and over-simplified. He's also extremely leisurely in his work, and will take forever to get an assignment back to you. \nOverall I'd recommend this course if you want a taste of the world of philosophy, but are not interested in taking other philo courses (otherwise a deeper, more engaging course would be better). \nWorkload:\nPretty light, considering there is no reading whatsoever. Three 500-word papers--but don't be fooled by the length; Collins grades on how precisely you articulate answers. In class midterm, final exam, and longer final paper on a topic of your choice. \nDifficult to get higher than a B+. \n"
        },
        {
            "course_name": "Methods and Problems of Philosophical Thought",
            "review_date": "January 05, 2009",
            "review_content": "\nWhen you choose John Collins for a course, you are putting yourself at a risk that could either be a disaster or extremely rewarding. Collins doesn't use a syllabus, his assignments are few and tiny, and his lectures often spiral out of control. But unlike other philosophy classes of the same nature, they are rarely boring. Collins attempts to frustrate students in order them to dig their own way out of the hole, and has great fun doing it. His Australian accent his even funnier. His grading can be ambiguous and often strange, and you really could end up with a grade somehow you never saw coming in the class, seeing how there is so little to prepare for at both the midterm and the final. But I almost took another Collins class this semester (it didn't fit into my schedule) just because I enjoyed coming to class so much.\nWorkload:\none reading the entire semester, 3 400 word responses (tricky), midterm, final, and final paper (7 pages)\n"
        },
        {
            "course_name": "Methods and Problems of Philosophical Thought",
            "review_date": "December 31, 2008",
            "review_content": "\nAMAZING CLASS.  AMAZING TEACHER.  Take it.  So laid back.  So fun.  Huge class, but feels like a seminar.  Contribute.  Show up.  Pay attention.  ENJOY!\nWorkload:\nA couple minor written assignment, some light and interesting reading, and a midterm, big final paper, and final.  Not too bad at all.\n"
        },
        {
            "course_name": "Methods and Problems of Philosophical Thought",
            "review_date": "December 27, 2008",
            "review_content": "\nThe class is really interesting and fun although it's tough.  It's worth taking just for Professor Collins though.  He's brilliant... and entertaining!  I recommend taking it pass/fail so that you can just enjoy the class as almost purely entertainment.  That sounds like a waste, but it's not.  The class time itself made me so happy even though when I sat down with my notes after class I didn't really understand much of the material.  Taking it pass/fail allows you to just enjoy the class time, the crazy conversations you'll have, and all the great stories and tangents Collins takes you through.\n\nWorkload:\nNothing.  No book or anything.  Just go to class! It's worth it because it's so fun and entertaining. \n"
        },
        {
            "course_name": "Methods and Problems of Philosophical Thought",
            "review_date": "December 11, 2008",
            "review_content": "\nI highly recommend this brilliant and enthusiastic teacher, who manages to make you reflect on sometimes challenging matters while being totally refreshing for the mind. He teaches in a very relaxed and open-minded way, which really allows you to ask the questions you may have and makes you realize that serious stuff must not be always talked about in a serious way.\nLoved the whole semester\nWorkload:\nBarely a few assignments and a very free final essay at the end. Midterm and final, both totally feasible once you understand what was talked about in class\n"
        },
        {
            "course_name": "Methods and Problems of Philosophical Thought",
            "review_date": "January 21, 2008",
            "review_content": "\nAfter reading some of the previous reviews, I was rather excited to take a course with Collins.  Unfortunately, I was horribly disappointed once the semester got underway.\nOn the first day of class, Collins read aloud some reviews from CULPA, both good and bad, forewarning us of his possible faults as a teacher.  While this was humorous and engaging, I should have taken those reviews more seriously and dropped the course as quickly as I could.  Being a Phil major and having taken Phil courses before, I was extremely frustrated with Collins's teaching style and his lack of coherency.  Philosophy to begin with is a difficult subject to comprehend, but Collins often made it near impossible.  While his lectures could be funny at times, his humor did not make up for his rambling.  Collins is obviously a brilliant man, but his teaching is simply not clear.  I was looking forward to learning in depth about philosophical argumentation, but instead, I walked away from his class knowing hardly any more than I did when I walked in.  The only reasons I survived with a decent grade are meetings I made with the TA.\n\nWorkload:\n3 short papers (although he said there would be one every other week), midterm, final-- all graded harshly by the TA\n"
        },
        {
            "course_name": "Methods and Problems of Philosophical Thought",
            "review_date": "April 15, 2007",
            "review_content": "\nRegarding the \"17 May 2006\" Methods and Problems review, I just want to add a few comments, as I was in the same class. \nThe class (and philosophy in general) is not: let's all get together and share our feelings on and 'talk about' time-travel and the matrix. So don't be disappointed when you find that a 'cool' thought you just shared wasn't entertained by the professor because it didn't make any sense.\nConcerning time-travel, Collins tries to tell you a coherent story about time travel to show you how there is no conceptual contradiction. So, yes, there are many arguments and Collins is meticulous about the logic, but a huge part of what the course is supposed to do is to teach you the proper methods of making arguments and prepare you for further study in philosophy. Collins also shares with you some infamous argumentation flaws in the history of philosophy.\nThe class is difficult, but regardless of the grade you get, if you try hard, you will leave with a better understanding of what an argument is and a clearer mind. I felt it was just what an intro to philosophy class should have been.\nWorkload:\n7-8 written assignments which required much thinking. Midterm, final: both very fair, i.e. do your work and understand the material and you will be fine.\n"
        },
        {
            "course_name": "Methods and Problems of Philosophical Thought",
            "review_date": "April 15, 2007",
            "review_content": "\nRegarding the \"17 May 2006\" Methods and Problems review, I just want to add a few comments, as I was in the same class. \nThe class (and philosophy in general) is not: let's all get together and share our feelings on and 'talk about' time-travel and the matrix. So don't be disappointed when you find that a 'cool' thought you just shared wasn't entertained by the professor because it didn't make any sense.\nConcerning time-travel, Collins tries to tell you a coherent story about time travel to show you how there is no conceptual contradiction. So, yes, there are many arguments and Collins is meticulous about the logic, but a huge part of what the course is supposed to do is to teach you the proper methods of making arguments and prepare you for further study in philosophy. Collins also shares with you some infamous argumentation flaws in the history of philosophy.\nThe class is difficult, but regardless of the grade you get, if you try hard, you will leave with a better understanding of what an argument is and a clearer mind. I felt it was just what an intro to philosophy class should have been.\nWorkload:\n7-8 written assignments which required much thinking. Midterm, final: both very fair, i.e. do your work and understand the material and you will be fine.\n"
        },
        {
            "course_name": "Epistemology",
            "review_date": "October 08, 2006",
            "review_content": "\nEarly in the semester (Fall 05), Collins regaled the class with the story of a professor he once had in Australia.  This professor would like to go on walks in the bush with no map, plan, compass, or anything, get lost, and find his way out again.\nThis, Collins said, is how he liked to teach.\nI don't think I could imagine a worse class. There was no syllabus and no plan and my blood boils when I think about it.  Epistemology is such a fascinating field of philosophy and Collins butchered it.  Terrible.\n"
        },
        {
            "course_name": "Methods and Problems of Philosophical Thought",
            "review_date": "May 16, 2006",
            "review_content": "\nBe warned: Methods and Problems with Collins is basically a logic course.  The topics discussed sound cool (time travel, the matrix, etc.) but the way they are presented would turn even the most interesing subject into a drawn-out lesson on the form of argument.  Collins will literally spend three hours forming arguments only to refute them in five minutes; a fact which makes note-taking extremely difficult.  It doesn't help that he's a difficult grader either.  The best part about this class was often the ridiculous discussions the written assignments would provoke, both inside the class and outside with your classmates.  All in all, it wasn't a terrible experience, but it definitely was not what I was anticipating.  \nWorkload:\n7 (often difficult) written assignments, a challenging midterm and final that may kick your ass if you don't go to lecture.\n"
        },
        {
            "course_name": "Economics/Philosophy Seminar",
            "review_date": "September 22, 2005",
            "review_content": "\nTerrrible, Terrible CLASS! NO one ever had any clue what was going to be taught each week b/c there was no syllabus. The professors (Collins co-taught with Prof Amarante) seemed not to notice that few if any students were following the discussions. Few topics were covered as the profs spent most of their time rehashing (again and again) the topics they were interested in (i.e. had written papers on). After class, we would commisserate in the elevator about how much we hated the class. Unforunately, if you are an econ-phil major, u don't get much of a choice. just hope that the class gets better, or that someone else teaches it.\nWorkload:\none presentation, one paper--at least the paper was on a topic of your choice, so it didn't matter if you didn't pay any attention at all in class.\n"
        },
        {
            "course_name": "Methods and Problems of Philosophical Thought",
            "review_date": "May 18, 2005",
            "review_content": "\nI really enjoyed my class with Professor Collins, and I learned a lot.  As Collins explained early on in the course, he was once known as \"the man\" thorughout campus because he taught the philosophy class with no homework, no reading, etc.  He decided to add a few \"written assignments\" and some light reading to scare away students who just wanted an easy class and to make the class size bearable.  It worked, and we had a great class with great discussion (and still not too much work, although I gladly would've done more for the class as I had a good time).  Don't enter the class hoping to learn about Plato, Kant, etc.  This class is about actually BEING a philosopher - making arguments, using logic, etc.  There is a lot of class discussion, but you can talk as much or as little as you want.  Collins said he was a tough grader at the beginning of the course.  He later sort of admitted that he was trying to scare people off, but that we really shouldn't worry that much because we seemed like an above average class anyway and should expect better grades.  I think he is a tougher grader than most, but not terrible.  Some of my friends, who I thought would get A's, got B+'s, but I felt I had earned an A, and he gave me one, so I can only assume he's a fair grader.  Collins is really funny and makes class fun.  The first day of class, he just read us this huge short story by Robert Heinlein about time travel, and then we argued about it for a few weeks.  It was a blast.\nMy only complaint about the class was sometimes I felt like Collins didn't give us the full story on certain topics and stated things that he merely believed to be true as fact. However, in a class about philosophizing, it's hard to expect your professor to give you arguments he doesn't believe in with a straight face, so I can't hold it against him.\nOverall, I would highly recommend the class.  It was a lot of fun and I learned a lot about philosophical thinking.  In fact, I might major in philosophy, partly due to this class.\nWorkload:\n5 or 6 \"written assignments,\" which were like 400 words each.  However, they were pretty tough, you had to think hard, and he graded them tough.  That said, he admitted that a 7 on the homework would not translate to a 70% in the class.  We had to read one short \"book,\" Berkeley's Three Dialogues, and a brief thing by Plato.  Not much reading either.  Midterm and final, some of it restating stuff from class and some of it applying logic to new problems.\n"
        },
        {
            "course_name": "Introduction to Symbolic Logic",
            "review_date": "March 26, 2005",
            "review_content": "\nThis class was a nightmare! You could go to all the lectures, do every homework meticulously, and still end up completely lost on the exam. There was no way whatsoever of getting help. No way of figuring out what you did wrong (the homeworks were just never returned). Yeah, he's funny and a great lecturer, but unless you're willing to get a horrible grade despite all your hard work, stay away.\nWorkload:\nProblem set every week, two midterms, final\n"
        },
        {
            "course_name": "Introduction to Symbolic Logic",
            "review_date": "January 21, 2005",
            "review_content": "\nThis guy is sloppy and lazy, a real disgrace. I am not saying he doesnÂ’t understand the material; I am saying in my opinion he gave absolutely no forethought to how it should be taught.  Not only wasnÂ’t he prepared to teach this class, -\tHe was incredibly disorganized\n-\tHe apparently had no time to correct homework (only 6 of the 10 assignments were ever graded and only 5 of these 6 were available to be picked up in the philosophy mailroom at the end of the semester)\n-\tAlthough in class he would promise to post answers to homework assignments, he repeatedly failed to do so.  This left many students in the position of not knowing what they got wrong on the homework AND not knowing the correct solutions.\n-\tAlthough homework was supposed to be posted on Thursday, he often didnÂ’t get around to it until Monday or Tuesday Â– indicating again how ill-prepared he was to teach this class.  On two occasions homework was simply cancelled because he didnÂ’t have it ready.  How hard is this to prepare?  Especially for a logic class, homework is a critical part of the learning process. \n-\tHe often changed the syllabus but did not reflect these changes in the reading assignments as he promised to do. \nHe actually said that he views his classes as performances.  This is not an attractive quality in a professor, unless he first meets the necessary condition for a professor: the ability to teach.  I often asked myself how he gets away with his lack of professionalism. \nThe text used in this class (a copy of a draft manuscript) combined with CollinsÂ’ unfamiliarity with it, is an embarrassment.  It is not formatted, making it very difficult to use.  No answer key is available Â– even to the TAs, leaving them to slog through each question with students.   It is filled with errors and many pages contained blanks to be filled in later.\nIf you have the option, take this class with Varzi.  \nWorkload:\nWeekly assignments if he gets around to writing them.  Two midterms and a final.\n"
        },
        {
            "course_name": "Introduction to Symbolic Logic",
            "review_date": "January 04, 2005",
            "review_content": "\n  Simply put, many Philosophy majors left Symbolic Logic with very mixed feelings about Professor Collins.  I tried to talk to as many students as I could before writing this review, and will try to stick to the consensus, although it does seem to me to be much the same as my personal opinion.\n  Professor Collins has a killer sense of humor and is an engaging lecturer.  I could imagine many Porfessors under whom the course could easily become another dry, bureaucratic hurdle for those students who don't have a peculiar affinity for First Order Language.  I don't think that telling any of his jokes over CULPA will demonstrate the robust flavor of Collins' quick and playful wit, and so I suppose that you'll have to trust that he, better than any Professor I've had yet, is able to get an entire class of us aspiring intellectuals to erupt in giggles and knee-slaps.\n  There were problems, however.  For one, Professor Collins does not seem able to make Symbolic Logic intelligible to the uninitiated undergrad.  He will rarely stray from the formal definitions of terms, and tends to misinterpret or not comprehend at all even the simplest of student questions--unless they are posed using the language of FOL flawlessly.  The students, understanding the posed question better than the Professor, often had to act as interpreters in order to clarify issues we all would have liked to ask about, if only we knew how to properly phrase our questions.  Collins has an impressively lucid understanding of the material (which is a good thing), but simply cannot convey it very well.    For example, during one of the most difficult lectures of the course, which happened to be perhaps the most important, he wrote an incredibly involved sentence (for a definition of truth-value in FOL).  The class was immediately baffled.  Sensing this, Collins said (perhaps 90% sincerely), \"Look, the first thing to do is to realize that this all makes sense.\"  That one, I believe, got the biggest laugh of the semester.\n  There were other problems.  Hardly anyone ever saw either of the two midterms after they had been graded.  I tried to email Collins in order to see and go over my midterm, and I never heard back.  Collins only posted the first six of ten homework scores online, though he promised all ten before the final exam, and after digging through a drawer in the Philosophy Department's office, I found that online five of my assignments had been graded and returned to me.  This was particularly problematic for the students, given that the average homework grade was around 70%--we never got to find out what we'd done wrong.    Most baffling of all, I think that the undergraduates and graduate students were all graded on the same curve.  Now, I'm not 100% sure of this, but all evidence points there; for example, some undergraduates had unknowingly signed up for the graduate section of the course, but Collins told them that since the grading standards were exactly the same, it didn't really matter.  Maybe I shouldn't be so upset over this, but it does seem odd that my exams were subjected to the same grading standards as my TA from another philosophy course, who told me later that she'd already taken a Logic course like this one as an undergraduate, and that Collins' course was just a review. \nWorkload:\nThere are homework assignments given almost every week, and they take anywhere from twenty minutes to six hours to finish.  They are graded with unbridled wrath on the part of the TAs, but I think that in the end Collins may have curved the homework grade.  The two midterm exams and final exam are pretty difficult, often involving content not gone over before.  That is, if you're like me, you might flex your brain for ten hours of study for each exam, arrive at the exam, and still not have much of a clue what some questions are asking of you.\n"
        },
        {
            "course_name": "Introduction to Symbolic Logic",
            "review_date": "January 02, 2005",
            "review_content": "\nSymbolic logic has the potential to be a great class.  Collins is OK.  He often looked for ways to spice the class up, maybe not always successfully, but at least he tried.  There were people in the class who were grad students in philosophy, but there were also people who were just looking for a non-science way to satisfy the science requirement, and I think Collins did a commendable job in presenting the material to students of all backgrounds.  Some of the homework and exam questions definitely gave math majors an advantage, but overall, he's pretty fair.  One complaint about Collins: he really is not very organized.  Lectures rarely matched with the reading, which was somewhat of a nightmare since our book is impossible to understand.  Also, don't ever expect to get your homework back within a reasonable time frame (if you get it back at all without him losing it).  The discussion sections are also quite worthless, especially if you get a disinterested TA.\nWorkload:\nAs long as you keep up with the readings and do the weekly problem sets, it's pretty straightforward.  The questions are never very difficult, but the instructions are often vague.  That makes some exam problems very annoying.  Exams are curved though.\n"
        },
        {
            "course_name": "Introduction to Symbolic Logic",
            "review_date": "December 31, 2004",
            "review_content": "\nIf you are wondering if this teacher's class is worth taking, just take it. I don't find him a great teacher, but okay. What I didn't like about him/his class were: 1) he is bad at understanding and answering students' questions 2) he lost some of my homework 3) he was disorganized about handing back hw and posting up our grades online. But at any rate, I liked going to his lecture. He made jokes (although sometimes pretty lame, usually laughable) and presented the material clearly, especially as the semester progressed. I found the class challenging, but maybe only because I'm a first year with no background in any kind of philo/logic class. \nWorkload:\nReading for every class and weekly hw assginment. Managable amount I guess. \n"
        },
        {
            "course_name": "Introduction to Symbolic Logic",
            "review_date": "December 23, 2004",
            "review_content": "\nCollins is hilarious.  His lectures were always engaging, usually funny, and sometimes resulted in him paying students for his mistakes.  If you pay attention and do your work, he'll guide you to a firm grasp of elementary logic.  If you don't, you will suffer.  Weekly assignment deadlines were strictly enforced, and all work was scrupulously graded.  If you were at least good at math in high school, you'll do fine and probably even enjoy the homework.  If you don't keep up, however, your grade will drop, and Collins will not feel sorry for you.  This class is good for anyone who likes puzzles and is looking for non-sciency way to satisfy the science requirement, or for anyone just looking for a break from the usual paper crunch.\nWorkload:\nWeekly problem sets, two midterm exams, and a final.  Homework and exams sometimes got tricky, but were usually pretty straightforward and doable.  Weekly homeworks rarely took more than an hour of my time, if that.  Also, there is a weekly recitation, but you don't really have to go if you're not in the mood.  I never was.\n"
        },
        {
            "course_name": "Metaphysics",
            "review_date": "January 11, 2004",
            "review_content": "\nHaving taken classes with most of the professors from the philo department, I can say without reserve that Collins is one of the better ones.  The material covered in Metaphysics is extremely interesting and mind-boggling.  The subject of metaphysics was novel to me.   Most of us are more acquainted with theories of logic, epistemology, classical philosophy, etc.  But metaphysics truly takes philosophy to a new level.  With that said, there is virtually no reading material to this class, which can be a blessing or a curse.  To do well in this class, unless you are David Armstrong himself, you should definitely attend every lecture and take notes.  Collins presents arguments in a very dynamic fashion.  The topics are interesting.  But in the end, it's up to you to sort out all the theories and come to the conclusion yourself which theory is most viable.  He will answer questions and will often take your opinion into consideration.  A very challenging subject, taught be an experienced professor.  One of the better courses at Columbia.\nWorkload:\nMidterm, Final, 5 Short Written Assignemnts, 1 final paper.  Grading ranges on the tougher side.\n"
        },
        {
            "course_name": "Epistemology",
            "review_date": "May 21, 2003",
            "review_content": "\n...For all the reviewers who think he is a \"brilliant philosopher\" try taking a real philosophy course with a real philosopher not someone who simply tries to speak and act like one. If you want to do well in his class, you have to sort out what's really going on from his mess and actually learn something. To Collins: try thinking from now on and not going out of your way to create non-sense out of something intelligble. The former not the latter is what philosophy is all about. \nWorkload:\nA few writing assignments, a paper, midterm, and final. All easy if you have a brain.\n"
        },
        {
            "course_name": "Epistemology",
            "review_date": "May 07, 2003",
            "review_content": "\nAh, Collins. ItÂ’s like being in class with Socrates. He will construct a beautiful argument over the course of days, meticulously leading you by the nose through the finer points of modal logic or what have you, and then, just as you are feeling good that you can actually claim to Â“knowÂ” something, He counterexamples himself and sends you back to the drawing board. But isnÂ’t that just the way theory of knowledge is? You just know more about why you know nothing. As for CollinsÂ’s presentation of it, it could use some organization. But he more than makes up for that in charm. \nWorkload:\nMidterm, Final, Final paper. There were supposed to be a number of short writing assingments, but they fell by the wayside. Collins is a fair grader of philosophical content, though he could care less about how many references to Kant you can make in a page. Midterm and Final require actual original thought (gasp).\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "February 05, 2002",
            "review_content": "\nAhhh yes Â… the enigma that is John Collins Â… Some years ago I had him as professor for CC. It was a good experience. Collins is very knowledgeable about the texts, and challenging, though he tends to dominate discussion. Professor Collins also provided the single most memorable classroom moment in my Columbia experience when he turned up to teach the class on Simone de BeauvoirÂ’s Â“The Second SexÂ” wearing a pleated skirt and camisole, sheer black pantyhose and high-heeled boots. This was a challenge to fashion sense as well as gender stereotypes. The total effect was something like the slightly dissipated wife of a corrupt southern politician. The boys in the back row squirmed. Professor Collins does have rather nice legs, and we noticed for the first time how tiny his feet are (like size 7). The most interesting thing though, was that (s)he was actually much nicer to us that day, didnÂ’t cut us off, listened more to what we were saying, and brought us cookies instead of giving us a quiz! \nWorkload:\n5 minute in-class quiz every day, two 5 page papers, midterm and final. Fair grader.\n"
        },
        {
            "course_name": "Metaphysics",
            "review_date": "February 01, 2002",
            "review_content": "\nI took three classes from John Collins in my four years at college, and I would not hesitate to claim that a few hours a week with him ought to be required for any undergrad claiming to think logically, and certainly anyone considering philosophy as a major or concentration. The man is brilliant. There are those in his classes who think he is smug and disorganized, but they usually make up the vocal minority. Philosophy students, including MA and PhDs, seek out his classes in order to soak in his rants and observe his methodical process of thinking. Classes are engaging, extremely enjoyable, and John is always willing to offer further explanation to the confused mind. I took Metaphysics as my first philosophy class, and did fine without Methods and Problems, which seems to be the class people complain about. The real reason people complain is that they are not philosophers and are intimidated by the process of becoming one (lots of thinking, not much doing).\nWorkload:\nVaries from class to class. He doesn't give away As, and sometimes it is hard to figure out what you did wrong, but intellectually, the classes are gold mines. You come out smarter.\n"
        },
        {
            "course_name": "Methods and Problems of Philosophical Thought",
            "review_date": "January 31, 2002",
            "review_content": "\nCollinÂ’s proclaimed idea was to teach us philosophy by teaching how to do philosophy. I donÂ’t think it worked very well at all. The class was too big (100+ students) for any genuine feedback and the discussion board was pretty much a waste of time. I would have liked the opportunity though to take this class with 25-30 students maximum. Then it might have been quite good. But to be fair, the things that the writerÂ’s of the previous two reviews complain about are things that Collins himself warned us about in the very first class which was devoted to Â“reasons not to take this courseÂ”. And if these reviewers had listened to what the prof was actually saying instead of chatting with the girl/guy next to them they might have realized that he wasnÂ’t just repeating himself at the beginning of class, but usually revising and completely reversing what he had said in the previous lecture. Anyway itÂ’s clear from the complete hash that the previous writer made of the quote on higher order vagueness that any subtlety is lost on them and they werenÂ’t really listening very carefully. I wouldnÂ’t recommend CollinÂ’s class either, but I think itÂ’s ridiculous to stoop to the level of criticizing his hair. Sure, the pony-tail screams mid-life crisis, but Â“prematurely baldingÂ”? YouÂ’ve got to be kidding. Collins told us that he was in graduate school in the 1970Â’s, so unless he was some kind of child prodigy, he must be pushing 50 now which would make his balding totally age-appropriate. \nWorkload:\nAs described above, but somewhat deceptive. The midterm lulled me into afalse sense of security and the the final bit me on the butt.\n"
        },
        {
            "course_name": "Methods and Problems of Philosophical Thought",
            "review_date": "January 20, 2002",
            "review_content": "\nWhen you first start the class, you  think you've hit the jackpot: there's  no syllabus, no textbook, no reading.  Professor Collins is funny and all  that's required of you is to show up  and take notes. However, as the  class went on it became boring at  times. You begin to realize that he  repeats himself for the first 30  minutes of class, which is why  people started showing up to class  15 minutes late. Because the exams  are straight from the lectures, you do  need to attend, but it's alright if you  zone out a little. The class is in a  lecture form though he sometimes  entertains comments or questions,  and when you hear some of the  ridiculous things people say, you're  almost relieved that it isn't a  discussion class. \nWorkload:\nMid-term and final which are straight  forward and come right from lecture  plus your best 5 posts to the online  message board.\n"
        },
        {
            "course_name": "Methods and Problems of Philosophical Thought",
            "review_date": "January 16, 2002",
            "review_content": "\nDisclaimer: Do not expect to delve too deeply into whatever it is that you've always thought constituted \"philosophy.\" Instead, expect to delve far too long into the psyche of John Collins. In my unfortunate experience, this lecture class was essentially an exercise in futility. Dutifully taken notes would end up consisting of nothing more than Collins' somewhat bland lexicon of logic and common sense; and at the end of a day's class, I wouldn't be surprised if the only philosophical conclusions or \"knowledge\" he/we had come to consisted of, for instance, \"things can be vague and therefore possible penumbral regions are infinite.\" Everything this man \"taught\" was just a thuddingly blatant fundamental not of philosophy but of existence as a whole. And sadly, many of the students in this huge class were first-years--many of whom that experience with Collins discouraged from seeking a philosophy major. Granted, there was a small batch of kids who were constantly tossing shameless praise and innocently curious \"philosophical\" questions Collins' way, but everybody I ever spoke to in that class (at least, of the two-thirds or so who regularly showed up) was as unenthused and turned-off as I. \"Progress\" during each hour-and-fifteen-minutes proved itself a concept apparently foreign to Collins; you could show up forty minutes late and he'd still musing self-contentedly about the same damn topics. In every class, it was quite obvious that Collins was just talking off the top of his head, except toward the end of the semester when he adopted a strangely avid and hurried attitude (which left me wondering what he was ever trying to accomplish in the first place). But for god's sake, in that case, couldn't the man at least have had some compelling philosophical topics sitting there on the top of his severely ponytailed, prematurely balding head? Admittedly, occasional amusements would present themselves in the form of convoluted (and obviously intended-to-amuse) philosophical \"examples\" and quotes. (For instance: \"Man, Mother Theresa was a selfish bitch,\" used to illustrate egoism; also, an ebullient declaration of \"I've got tenure!\" used for no apparent reason at all.) But for the most part, this class comprised nothing but a vocabulary lesson in common sense, taught by an obnoxiously smug little man with a tendency to strut shamelessly and proclaim his every \"um.\"\nWorkload:\nYou're supposed to contribute five posts to the web discussion board in addition to completing the in-class midterm and final. He never graced any of us with the knowledge of what in hell those seven assignments would entail, but even so, whatever worries you have are probably excessive. (Note: Practices such as reading other books during class, skipping class entirely, and making discussion-board posts about completely unrelated and un-philosophical topics have little or no bearing on your final grade in the course. Just know, somehow, the logical gist of whatever he chooses to lecture on during his classes or be able to bullshit your way around it. If you can prove him wrong or make some other adequately logical argument, he's willing to concede.)\n"
        },
        {
            "course_name": "Methods and Problems of Philosophical Thought",
            "review_date": "January 01, 2002",
            "review_content": "\nFirst of all, there is no reading and no papers for this course, which is definately an awesome thing, but there are annoying consequences. 1) you have to either show up to every class or get good notes from someone who does and 2) your grade is comprised of the midterm, final, and your postings on the class' discussion board--a stupid component of the class, since he never lets you know what separates a good posting from a bad one and never grades them until the end. as a result, while you don't have to do much at all for this class, what you do have to do is so ambiguous that you could screw it up and not even know. the lectures vary from fun and interesting to awful, since collins does not prepare before class and often confuses himself while trying to figure out what he means to teach. the topics are arranged like improv comedy-he chooses the first one and from there he goes on tangents. in the end, you come out learning some interesting things, but suprisingly little since without reading and/or organization on his part you don't cover much ground.\nWorkload:\nno reading, no papers, a minimum of five postings on the class discussion board, most of which range from 1/2 page to 2 pages. it's hard to find a class with less of a workload\n"
        },
        {
            "course_name": "Methods and Problems of Philosophical Thought",
            "review_date": "December 30, 2001",
            "review_content": "\nJohn Collins is, to say the least, a unique man. His lecture style is random and disconnected, and you get the sense that he's telling private jokes to himself as he chuckles his way through the classes. For those who like structure, a syllabus, and any sense of the importance of what one is studying, this class is not for you. Professor Collins enjoys making things up as he goes along and going off on endless tangents, and yet it's hard not to enjoy it: he certainly knows his stuff and covers interesting topics, whatever they end up being. However, the unpredictability and confused nature of the course makes it very frustrating at times to follow his logic or stay awake. But, overall it is an enjoyable elective and provides some good food for thought.\nWorkload:\nAbsolutely none, well, almost. The only requirement was to post 5 messages to a class discussion board, responding to any philosophical issues one chooses. Also a midterm and a final that are a breeze if one understands the major concepts of the class.\n"
        },
        {
            "course_name": "Methods and Problems of Philosophical Thought",
            "review_date": "November 12, 2001",
            "review_content": "\nThis is basically Intro to Philosophy. Collins taught it very well. Although he didn't follow a fixed syllabus and let the course progress naturally through discussion (but not completely arbitrarily; he did have the big bullet-points in mind), he explained the ideas very clearly and repeated each of them at least three times. He lectured on interesting and representative problems in different topics in philosophy, which I found highly inspiring. And they really gave me a taste of what philosophy is really like.\nWorkload:\nMinimal. Each of us was supposed to post at least 5 messages on the bulletin board (not that 5 messages is a lot of work) but I don't think he actually bothered to count. Since he repeated the materials many times and since the exams were extremely easy, even attendance wasn't that important if a student was just in for the credits.\n"
        },
        {
            "course_name": "Metaphysics",
            "review_date": "December 31, 1999",
            "review_content": "\nA competent and interesting lecturer, with few demands on the students save their interest. The photocopied readings were extremely short but insightful. For god's sake, remember that there is no right answer in philosophy.\nWorkload:\n1 paper (short), Midterm and Final exams.\n"
        },
        {
            "course_name": "Metaphysics",
            "review_date": "December 31, 1999",
            "review_content": "\nMore utterly engrossing than one of those crazy episodes of Nova where they travel through black holes, every single lecture this man gives is gold. Complicated and esoteric problems in metaphysics find realization in simple, ordinary examples (time travel, clones, severed feet) that will have you arguing with Collins, your neighbor and (when you get home) your mother. Light readings too; this is not a history class. The readings are narrow, extremely dense, and to the point. And for the illiterate, he recounts all the arguments in class anyway. One complaint: the annoying kid in the front row who asks too many questions gets way too much airtime. Collins is not brutal; he's jovial. Watch out for the second paper. He always falls way behind (due to annoying kid) and the last paper is practically assigned the day before the final.\nWorkload:\ntwo papers that really challenge you to say something more than simple regurgitation (though that will do too) and an in class final.\n"
        }
    ]
}