{
    "prof_info": [
        {
            "prof_name": "Michael Tuts",
            "prof_id": 387,
            "total_reviews": 20
        }
    ],
    "reviews": [
        {
            "course_name": "Intro to Electricity, Magnetism and Optics",
            "review_date": "May 23, 2014",
            "review_content": "\nThough Tuts is a passionate teacher and tries to make every point clear, most of his attempts are futile since he only derives formulas and rarely goes through examples. Therefore, his lectures and exams are very different, and you end up teaching most of the topic to yourself by looking at solved examples. However, most of his exams include questions with calculus, which require more time since they are unique and haven't been encountered before. He covers too many topics and ends up not asking questions from most of them. The best way to study for exams would be to look at the main types of questions, though he tends to be unreliable and ask things like 'Newton's rings' on a final. Do not be fooled by the simplicity of the lectures; midterms and finals are usually very difficult.\nWorkload:\nProblem sets each week - most questions are pretty tough\n"
        },
        {
            "course_name": "Intro to Electricity, Magnetism and Optics",
            "review_date": "May 21, 2014",
            "review_content": "\nProfessor Tuts accomplishes all that is required of a physics professor in terms of teaching: to teach an introductory physics course by writing things on a chalkboard. However he fails in many other aspects: to teach material that will enable students to complete homework assignments and test questions. The material learned in class has absolutely no correlation with homework problems or test questions. Every single one of Tuts' tests will leave you feeling horrible about yourself and like you don't know physics. You will then receive an A- on this test.\nTuts does give practice tests but these practice tests are for his 1200 physics class even though I was taking the 1400 physics class. The lack of difficulty and concept in the 1200 physics class test questions make these practice tests unrepresentative of the 1400 physics tests that we would be taking. Since the practice tests are unrepresentational of the midterms that you will soon be taking, you would then expect that the homework problems would be of comparable difficulty and material examined. Wrong: the homework is completely unrelated and is extremely difficult compared to the test. I would recommend just learning how to do the practice tests, going to his review sessions and trying your hardest to do the homeworks without the solution manual, as the solution manual became a crutch for me towards the end of the semester. \nThe curve for the tests is generous but it doesn't change the fact that the average grade curved to a B+ is often equivalent to a 50 on the test. The demos are interesting.\nWorkload:\nWeekly problem sets that are easily able to be copied from the Jearl Walker 9th edition solutions manual. 2 midterms and a final. The homework percentage of the grade is not quantified and I believe that it is used as a reason to shift grades up if you did the homeworks, although this is never clearly stated.\n"
        },
        {
            "course_name": "Introduction to Mechanics and Thermodynamics",
            "review_date": "January 22, 2014",
            "review_content": "\nProfessor Tuts is a very clear and succinct lecturer who's lectures are worth going to for more clarity on the important concepts. He is excellent at explaining concepts, and usually covers all loopholes. Sometimes the lectures can be boring and its easy to forget the big picture while Tuts goes into details or while solving problems, but in general, he's one of the better science teachers out there. \nGrades are based solely on two midterms and the final, so take care. Do not procrastinate, skip homework, or skip class unless you are extremely familiar with the concept(and probably shouldn't be in the class). \nWorkload:\noptional homework, two midterms, one final, no dropping any grades\n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "December 25, 2010",
            "review_content": "\nHe does NOT drop any grades! 2 exams, both of which count and they are pretty much the only things that go into your final grade (the prob sets can sometimes make a difference between C- or C+, but that's only if you've done almost all of them correctly).\nHis lectures seemed straight forward. I could not figure out why I could not do well on the exams and the problem sets until the final came around. Too late for me. I would suggest supplementing his notes with thorough readings of the textbook, especially if physics is new to you (I have never taken physics before until now, so it's extra tough for me). Keep up with the problem sets he assigns every week(due every Wednesday after class). Go to TA sessions. My TA was Ali. He did extra sessions ever week, even though he wasn't getting paid for them. He was pretty nice and really willing to help the students. Tuts was accessible, but that did not help me much. I spent a lot of time going over problems with him, but I didn't feel like they helped me much. He was very thorough when we worked on a problem, but by the time we got to the end of the problem I usually failed to see how it all came together. All in all, by the time you came to the end of the solution you would forget how you got there. This is partly because of the way he explains concepts(on a very basic level that seems far from the level of the problem itself) and because the problems he assigned and the problems he put on the exam were always very very VERY difficult. Even the TA tried to speak to him about giving us easier problems, but Tuts never listened to him. \nIf you don't have prior exposure to physics, AVOID signing up for Tuts. Do everything you can to escape. I wish I had. I kept telling myself if I keep trying things will get easier, but trust me, it's not me, its HIM!\nWorkload:\nproblem sets due every wed after class. \nmidterm and final (these two grades almost exclusively determine your final grade).\n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "December 22, 2010",
            "review_content": "\nPhysics 1201 with Tuts was pretty straightforward - two dimensional motion through waves. The lectures were thorough (and easy enough to follow even if you hadn't looked at that chapter yet) and clear. Given that Tuts is apparently a big-shot who works at the large hadron collider in Switzerland,  he's surprisingly accessible. He held review sessions on the weekends before all exams, makes time to meet with any student who has questions. The 1291 lab doesn't match up with the lectures for the most part, but you'd have miss a lot of labs to get a poor grade. \nWorkload:\nWeekly problem sets were optional, but a good idea if you want to be prepared for exams. Two midterms (25% each) and a final (50%) with a very generous curve. \n"
        },
        {
            "course_name": "Introduction to Mechanics and Thermodynamics",
            "review_date": "December 28, 2008",
            "review_content": "\nProfessor Tuts is, first off, not a good lecturer. I fell asleep at least once per class, with few exceptions. His lectures mostly consisted of putting up a few concepts and equations, going through three or four long examples, and then rushing a lot of good material in the last five minutes. Sometimes he would stuff a random demonstration at the end as well. He wasn't very good at getting concepts across. His material was minimally helpful in homework and tests, at best. If you have him, read every chapter he goes over thoroughly, and keep a list of often-used formulas.\nThe homework varied in difficulty; he only assigns problems with diagrams that are given. The only way I got through it was with two roommates also in the class, one of which had a full solutions manual. You could seek Cramster.com for help, the textbook used is there.\nThe homework was very similar to the tests. When reviewing, I actually found that the test questions had come straight from the textbook problems (not so on the final). He has a review session before each exam and the final, which consists of him going over practice exams. He posts two practice exams before each exam, which were sort of helpful. The tests were three questions long, and the final was six questions, with each question having three or four parts to it.\nHe puts up solutions to everything on Courseworks; homework, practice exams, and actual exams. His lectures are also up, but they're his messy handwritten notes. He created an optional recitation, but I hadn't heard of many people going to it (by the end of the semester, it was abandoned). He was very good about keeping his office hours, but again, I didn't hear of too many people using them.\nWorkload:\nWeekly problem sets, 8-9 problems each, 2-4 hours each. 2 problems are graded, but don't contribute to the course grade except in borderline cases. Two exams (100 points each) and a final (200 points). The first exam averaged 67.6%, the second exam averaged 68.3%, and the third exam averagec 44.5%. In each case, the average was set to a high B.\n"
        },
        {
            "course_name": "PHYS II",
            "review_date": "May 21, 2004",
            "review_content": "\nPhysics in Columbia is not easy, but it's easy to get a good grade if you take with Professor Tuts. I agree with some of the reviews that Professor Tuts gives  challenging exams and he does not really explain how to solve the problems. I never went to his office hours, so I don't know if he's approachable or not. But, his lectures are absolutely the repeats of the textbook. There is no point of going to the class because you would not learn how to solve the problem. I would rather prefer him doing more problem solving than repeating the textbook. \nOverall, take this class if you are too busy to go to class, and if you are desparate to get an A. \nI didn't go to class half of the semester, and still do above the average on his exams. If you are above the average, your grade is like B+ or A- . \nWorkload:\nOptional problem sets. ( I recommend that you do the examples from the textbook than the assigned problem sets--Textbook examples really helped me to understand the concept better) \n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "May 19, 2004",
            "review_content": "\nI completely agree with the previous several reviews. Professor Tuts' lectures dumb down the information but are often very roundabout and cursory. Most of the material he covers in class is explained in a much more precise and presentable manner in the book. Instead, he needs to spend class times working on problems and applying the concepts to situations. On the rare occasions he does do examples, you go back to your book and find that they are already explained there. His problem sets are very selective - they start with a few easy problems in basic concepts but jump suddenly to challenge problems requiring a deep understanding of all the concepts, which can only be obtained (i think) if you do every problem in the book. Go to his study sessions and you'll see that only his grad student TAs are able to do them. You often need to know some key equation outside the scope of the class, and be able to make those connections. \nHis tests are very hard - going to lectures, doing problem sets is not enough. He seems very comfortable with the fact that the mean is usually around 50, a B. Sure, do everything and you'll be guaranteed a B- or higher, but I worked very hard in this class and did not feel like all my effort was worthwhile. In the end, you just feel stupid, but Tuts pitied you and gave you a decent grade to make it all better. Yet, if he had done a better job teaching, going over the material he was going to test, maybe our class mean would be higher and we'd feel better about the grade we got. Sure, I'm a premed, but I'd rather get a C and learn the material well, then get raped by the tests and pull off a B+. What a crappy class.\nWorkload:\nProblem sets, 2 tests and a final. You'll spend as much time as you want studying but there's a limit to how well you'll score.\n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "May 13, 2004",
            "review_content": "\nProfessor Tuts is a great teacher. He presents the material in a very clear way which is easy for the non-physics minded (which most of us are, even if we don't want to admit it) to understand. He is approachable and his office hours are very helpful. His exams are tough but not impossible. In response to one of the reviews above, he is not an ass. He is actually very funny and friendly if you get to know him. I have never seen him turn a student away. He will sit with you for hours until you understand the material. He received a teaching award this year, and I definitely think that he deserved it. If you have the opportunity to take a class with him, do it. You will not regret it.\nWorkload:\nWeekly problem sets; do them because they may show up on exams!\n"
        },
        {
            "course_name": "General Physics Lab I",
            "review_date": "April 12, 2004",
            "review_content": "\nWhat to say about Professor Tuts. I will say that he is a good lecturer, I absolutely hate physics but Professor Tuts was able to make the class fly by with his little jokes about his bald spot and whatnot. In the beginning of the semester, I actually believed that he was probably the greatest science professor I ever had because for someone having 2 Ph D's, is a graduate of MIT, and is a brilliant physicist, he was able to \"dumb\" down the material and present physics on a level that everyone could understand, which for someone like me, was great. All the changed after our first exam, which was brutal.  No matter how hard you study, do practice problems and ace the problem sets, you will not be prepared for the exam. The exams are so beyond the scope of the course that  you will feel like you're a moron and have no right to either be a science major or a pre - med. And Professor Tuts seems to take the stance that we are a bunch of retards, even though most people that I know in the class, know and understand physics (including myself) but can't do his exams. That's just plain unfair. This year, his exams were brutal in comparison to the past two years.  Also, just one side note, when the TA's look at the exam and can't do the problems, something is wrong. \nThough I have to say, Tuts is very generous when it comes to grades and even if you score about 15 to 20 points below the mean, you still have a B-, which is nice and I do feel that I am prepared for the MCAT because I've suffered through his \"Physics Olympics\" exams and MCAT physics is not bad when compared to Tuts. Also, Tuts is willing to hold office hours and I hear he is very helpful, but Tuts is also aloof and a bit of an ass. He once looked through a student's test after the student handed it in, and laughed at it, which I thought was pretty cruel. If you're really good at physics or totally clueless like me, I think Tuts is a good match because his explanations and derivations are very clear but be prepared to be a little sore after the exams are over. \nWorkload:\nAnnoying: There are problem sets every week, some very difficult and long and others are short. 2 exams and 1 final.\n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "January 24, 2004",
            "review_content": "\nI completely disagree with most of these reviews.  Tuts is extreemly hard.  Even if you get a grasp of the material during class and homeworks, the exams are just ridiculous and do not in any way represent the material being taught.  (Tuts himself struggled answering one question on the second exam)  If you have previous experience with Physics, youll most likely be fine, but if this is your first physics class...GOOD LUCK.  Youll need it.\nWorkload:\nFair.  I reccomend doing the problem sets.\n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "December 16, 2003",
            "review_content": "\nPre-Meds should be thankful for Tuts' business-like approach to teaching Physics.  His lectures include a few jokes to keep the mood light, but he does not pretend that all the students are Physics majors.  He knows that his course is a requirement for many students, and he tries to make it as painless as possible.  40 out of 100 is the mean for most tests, making an A very doable and a B fairly easy. \nWorkload:\nProb Sets (Go to Recitation for help), Midterm, Final\n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "May 07, 2003",
            "review_content": "\nyou know what, he sucks. Okay, so he explains stuff fairly clearly . . . he never, and i mean NEVER gives you any hint as to how to do a problem, and then the test comes around, and hello, you get totally raped. Both of the means for the midterms this semester were a 45. That is insane. most people answer the questions in \"essay  form\" wherein they write down every frickin formula and physics concept they know in order to get some partial credit. it works. \nWorkload:\nweekly problem sets, two midterms, final. I did the problem sets the first half of the semester, stopped the second half, and did a point better on the second midterm. there is no rhyme or reason. \n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "September 04, 2002",
            "review_content": "\nProfessor Tuts is both incredibly brilliant and a great professor. He has an amazing ability to elucidate everything he teaches. He is also very approchable and often goes out of his way to help students during office hours. GO to them! The homeworks are reasonable in length, and if done with care, can pay off on test day. DO them!! Exams are reasonablly difficult, but are graded on a curve. Overall, Tuts makes physics a great experience at the end.\nWorkload:\n1 hw set per week, 8-10 problems\n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "August 15, 2002",
            "review_content": "\nTo accompany the above glowing review of Professor Tuts, by popular demand here is a note about EXAMS and GRADING. It is an impressive system that worked well for us to be rewarded for our efforts. First, a big relief to many is that the professor provides a list of physics formulas to accompany the exam questions, so you don' t have to worry about forgetting them and you can concentrate on doing the problems. There are two in-class tests that covers material from the previous month's classes, and a 3-hour final that combines the last month of classwork and a cumulative test for the whole semester. Exams are reviewed by grad students under the supervision of the professor, and they can be fairly generous in giving partial credit for work done, so it is a good idea to show as much work as possible on the tests. So even if an exam is tough, in this way you can still achieve significant points toward your grade - by showing what you do know about a physics problem. If you are dissatisfied with your exam grade, you can resubmit the exam to the professor for a regrade. Letter grades are assigned to our scores on a curve, so we learned in class after the test what letter grade our score would represent. The class average is a B. Finally, the final grade may be adjusted by the professor, he said: if you are on the line between letter grades, a positive homework report (homework is also reviewed by grad students) can make the difference to get the higher grade. We really appreciated the professor scheduling special review sessions before each exam to go over practice tests and any of our questions. We felt pretty positive about the whole thing, that if we prepared and applied ourselves, we would be rewarded for that, and that encouraged us to work at it even more. It is a great class with a great professor.\nWorkload:\nExams and grading as above.\n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "August 08, 2002",
            "review_content": "\nHighly recommended. An excellent professor. Totally professional, Prof. Tuts is fully committed to his class, and he treats his students with friendly respect. He is obviously a very experienced teacher (and very smart) and doesnÂ’t miss much. He has a sense of humor, and can be good fun (especially in demos). The professor comes to each lecture prepared with detailed notes, and often uses demonstrations and/or graphics (posted on website later). As other reviewers have noted, Prof. TutsÂ’ lectures are wonderfully clear, and he works through the material step-by-step, giving students time to take notes. ItÂ’s remarkable how well he communicates to such a large class and successfully engages both advanced students and those less fluent in physics. Some students who found high school physics difficult were relieved that the professor was able to make physics understandable - even interesting - for them; others felt his was an enjoyable challenge. His demonstrations of problem-solving can be mind-boggling at times, and are beneficial, if not inspiring, examples. Prof. Tuts is well organized, and takes advantage of the course website to manage the class with a minimum of paper, not only posting announcements, weekly problem sets due and then their solutions, but also providing useful information, such as special class notes, that ordinarily would be too logistically difficult to prepare and distribute. (Check out also his Physics Dept. website for personal background and research information and physics links for students.) Studying about one-and-a-half textbook chapters a week and doing the problems is a lot of work. Developing problem-solving skills is one goal of the course; therefore unless you already know all about it, the homework - although not obligatory - is essential practice in these skills, which are tested in exams. (ItÂ’s hard to categorize exams; it depends where you are at. The class average is a B.) Go to Recitation. Take advantage of the team of graduate students in the Help Room for assistance; maybe find one or two you find most helpful and meet with them regularly. If youÂ’ve read this far, here is something worth waiting for: the professor is an extraordinary guide to creative problem solving - and he will work with you at your level. If you take your question about a physics problem to him during office hours, which can be a group event, he will likely set you up at his blackboard and explore with you approaches to that physics problem, while you write everything down on the board. ItÂ’s valuable personal attention, and also helpful to watch. A visit not to be missed! So, all in all, for the prepared student, physics is possible; if you think you are an advanced student, you may still learn a lot; but for a dedicated student at whatever level, here is the possibility for an outstanding learning experience with - as another reviewer has aptly stated - a full professor who cares. \nWorkload:\nWeekly problem sets from about one-and-a-half chapters of textbook subject matter to cover. Getting comfortable with good methods of solving problems is key. (When in doubt, write it out. ) In practising using these, some of us therefore benefited from doing a few more problems than the set homework. \n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "May 08, 2002",
            "review_content": "\nProfessor Tuts was a truly phenomenal teacher. He is extremely knowledgeable and what is even more rare among science professors, is able to effectively communicate the information to the class. His lectures are clear and thorough, and though you may not be smiling after his tests, you will certainly leave the class with a solid understanding of the material. Unless you aced the AP, go to class, and recitation's not a bad idea either.\nWorkload:\nOK - optional and very difficult weekly problem sets. If you don't do them though, you won't do well on exams.\n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "January 06, 2002",
            "review_content": "\nTuts is a real phenom for the Physics department. He's a full professor who really cares about an entry level class. His love for physics really shows in the lectures, although it often lead to some lengthy descriptions that went into minute detail. Great use of examples and extremely accessible outside of class... wish I could say the same for the T.A.s.\nWorkload:\nWeekly problem sets, which take about that long to complete. Also, remember it's a pre-med course so the other students are eager to please.\n"
        },
        {
            "course_name": "General Physics I",
            "review_date": "December 19, 2001",
            "review_content": "\nProfessor Tuts did a great job of presenting the material in a coherent and approachable fashion. The lectures were interesting; on the whole, this class smacks of none of the pre-med insidiousness that I've come to expect from intro-level science classes.\nWorkload:\nQuasi-optional problem sets, two midterms, final.\n"
        },
        {
            "course_name": "Physics I: Mechanics and Relativity",
            "review_date": "December 31, 1999",
            "review_content": "\nPossibly the best professor I have for this semester. He really knows his physics, and he explains it so well -- I am amazed at how good my notes are! Granted that this understanding doesn't always translate to the problem sets, but he's happy to answer questions during the lecture. The best is when he does demos -- he has that rare ability to laugh with the class when something goes wrong!\nWorkload:\n8-9 problems a week, and they're pretty tough problems. Start early and go to recitation.\n"
        }
    ]
}