{
    "prof_info": [
        {
            "prof_name": "Chee Wong",
            "prof_id": 2530,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Mechanical Engineering Lab II",
            "review_date": "May 31, 2011",
            "review_content": "\nJust like all other lab courses, this one too was pointless. The experiments are very flawed, and most of the times you are just sitting there pushing buttons, waiting for a number to come up on the screen, and recording that number without the slightest idea of what it represents. What makes this class slightly better is that you are testing cool shit, like the Carnot cycle, drag/lift on an airfoil using a wind tunnel, supersonic flow, etc. Also, although it sucked at the time, we were given very little instruction on how to analyze the results. Therefore, we were really forced into learning everything well and understanding what every number meant and how each result is obtained. \nI have no other comments for the class itself. Lab classes are flawed and poorly organized - we all know that. My problem was with the lack of organization of the professor and the TAs. We would get our graded lab reports back 3-4 weeks after they were turned in, and by that time we had already turned in at least one more lab report, so we really had no time to change a recurring mistake. Also, it has now been 5 weeks since the final, and we have still not gotten our grades back. That was my first final and grades were officially due 3 weeks ago, which is a testament to how disorganized the instructor is.  \nThe TAs barely spoke any English, which became a problem since we didn't get detailed step-by-step lab instructions but we depended on the TAs to explain what we should be doing. They talk you through the experiment in the beginning, you stay and do it (mostly push buttons and record numbers), and then you go home and try to make sense of everything.\nThere is a final in this course - 5 questions covering each of the 5 experiments. You have to know everything in order to do well - from performing the experiments itself, to the equipment, to data interpretation, etc. It was somewhat difficult since there was nothing to study from - you just Wikipedia the concepts and hope that what you are studying is enough. \n\nWorkload:\n5 lab reports for 80% of the grade. very time consuming due to the limited instruction from the professor\none final 20% of the grade\n"
        },
        {
            "course_name": "Heat Transfer",
            "review_date": "May 11, 2005",
            "review_content": "\nProf. Wong is a great guy and a great professor. He's a very good lecturer, not amazing, but definitely very good.  More importanty, he seems to actually care about the students more than any other professor i've had in any department in three years here.  If you go to his office hours, he's amazingly helpful and patient. He also actually responded to the mid-semester evaluation.  Most of the students must have pointed out the the problem sets were too hard (not whining, they were significantly harder than problem sets in any other engineering class) and he started giving more reasonable homeworks.  Then after the final he sent out an email telling us he liked teaching the class and he seemed to mean it.  To be entirely honest, I'm not writing the review for students because, for the most part, if you're signing up for a SEAS class, it's a requirement or you know the prof, I'm writing this in the hopes the Professor Wong sees it and knows we appreciate him.  \nWorkload:\n1 prob set a week, 2 midterms, final\n"
        }
    ]
}