{
    "prof_info": [
        {
            "prof_name": "Macalester Bell",
            "prof_id": 3115,
            "total_reviews": 19
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Moral Problems",
            "review_date": "November 20, 2013",
            "review_content": "\nAlthough the semester is not over yet, I feel it is apt to write a review for this class. I appreciate the cheerful comments about Professor Bell, but I do want to warn any philosophy majors or prospective ones out there that this class is not worth taking. I probably should have adhered to her warning at the beginning of the semester that this class is not intended to be philosophical. Well, this fact was testified again and again in the course of this class. Rarely are the readings aspirational. For most of them I constantly sense the lack of depth in the issue it was trying to address. For some strange reason, while contemporary ethics has invoked numerous foundational work over the last century, applied ethics in general seems to lack a basis of theoretical work. A lot of readings were either interpreting bits of the utilitarian or deontological school of thoughts or simply indulging in their own poorly defined theories. This becomes especially problematic when it comes to class where most speakers are apparently and rightfully confused by authors' theories but unable to pinpoint the roots to their confusion. A class often fell into victim of a few speakers who are fundamentally confused but somehow persistently inclined on their equally confounded opinions about certain argument. The vagueness would have been cleared if the class was conducted in a way that each author's theoretical ground is carefully dissected and vigorously (dis)proved. (Well, that would be a Kitcher's class.) But Professor Bell deliberately refrains from exploring those hard concepts, which would again confuse most students in class who would later complain this is just another boring philosophy class. Now this dilemma ultimately finds me, for most of the time, struggling to stay awake during the class. All in all, for serious philosophy majors, take my word and Bell's word, do not take this class. As for others, I am not sure how much you can get out of this class. If you decide to renounce all your personal wealth after reading Peter Singer, then you are much closer to moral sanity, which would for sure cheer the philosophers immensely. \nWorkload:\nVery light. Midterm, 1 6pg paper, take-home final. The average for midterm is 91. So...\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "November 18, 2013",
            "review_content": "\nProfessor Bell is one of the few GOOD CC professors. \nShe actually understands the texts, actually has a philosophy background, actually can facilitate meaningful discussion, and actually teaches - qualities sadly lacking among many of the CC professors....\nShe will point out any flaws in your argument in a nice way, and encourages participation. Discussion will lag based on the quality of your peers (I was fortunate to have good/great peers in my section. Bell dubbed us her \"second favorite CC section ever\") + if a text is boring + during midterm season when peers are sleep deprived, as it does in all classes. She also took out a dumb reading and added a good one. \nA good indicator of the quality of a professor is the # of students that stay in the same section from Fall -> Spring. If I remember correctly, only 3-4 students switched sections in the Spring - either they didn't like Bell or they had scheduling conflicts. \nAlso a fair grader. Not the toughest that I've had. For those complaining about their grades, work on your writing and go to her office hours - she's very nice and genuinely wants to help you learn.\nProfessor Bell is probably better than 90% or more of the CC professors, is worth your time, and is a professor that you will appreciate. \nWorkload:\nreasonable. \n- 1 six pg essay on anything you want\n- 2 out of 3, or 3 out of 3 one-page responses. If you don't do the 3rd, she'll take the average of the first 2 responses.\n- midterm with short answers explain quotes/concepts/ideas + essay pick a prompt\n- final is same format as midterm, with more short answers + whole course is fair game for essay\n\n"
        },
        {
            "course_name": "Contemporary Moral Problems",
            "review_date": "December 19, 2012",
            "review_content": "\nProfessor Bell is a real gem. She is the only professor I've ever had that facilitated a true discussion. She is enthusiastic about the material, and it shows. She also knows how to lead a wonderful, focused, and well organized discussion--which is particularly admirable in a class of 40 people. She loved it when a bunch of hands would go up, and she was diplomatic in how she called on people. I was most impressed with her ability to present polarizing issues and controversial material without ever even hinting about her own position. She generally just defended the argument we had read and tried to anticipate how the author would respond to our concerns. \nI looked forward to going to this class, and I'm not that interested in Philosophy. The philosophy-ish parts of this class were minimal. We weren't bogged down by jargon, but we did learn to make sound arguments and think critically. Articles were easy to read. The issues we discuss are fascinating and relevant. I changed my mind on issues I thought I was dead set on. You will be able to discuss abortion, porn, animal rights, affirmative action, our obligation to the world's poor, and punishment in a sophisticated way. I can't think of a single negative thing to say about Professor Bell or her class, and I will miss it.  \nWorkload:\nNot bad. You can get away with either not going to class or not doing the readings. Just go to class. Midterm, paper (5 page MAX) and final. 30, 35, 35%. This class is not \"hard\" but it also isn't a joke class by any standard. \n"
        },
        {
            "course_name": "Contemporary Moral Problems",
            "review_date": "December 09, 2012",
            "review_content": "\nProfessor Bell is a real gem. She is the only professor I've ever had that facilitated a true discussion. She is enthusiastic about the material, and it shows. She also knows how to lead a wonderful, focused, and well organized discussion--which is particularly admirable in a class of 40 people. She loved it when a bunch of hands would go up, and she was diplomatic in how she called on people. I was most impressed with her ability to present polarizing issues and controversial material without ever even hinting about her own position. She generally just defended the argument we had read and tried to anticipate how the author would respond to our concerns. \nI looked forward to going to this class, and I'm not that interested in Philosophy. The philosophy-ish parts of this class were minimal. We weren't bogged down by jargon, but we did learn to make sound arguments and think critically. Articles we read were easy to read. The issues we discuss are fascinating and relevant. I changed my mind on issues I thought I was dead set on. You will be able to discuss abortion, porn, animal rights, affirmative action, our obligation to the world's poor, and punishment in a sophisticated way. I can't think of a single negative thing to say about Professor Bell or her class, and I will miss it.  \nWorkload:\nLight. Midterm, 5 page (max) paper, and a final. I think participation might help your grade too. We have an article or two to read for each class, and you can get away with not reading them and still make an A, but they are so interesting you might want to do it anyway.\n"
        },
        {
            "course_name": "Seminar: Ethics",
            "review_date": "April 25, 2012",
            "review_content": "\nDue to previous negative culpa reviews of this professor's seminar, I was not looking forward to this class. HOWEVER, I found this class to be my most engaging and fascinating class of my final semester (and I'm not prone to hyperbole).  \nIn previous philosophy classes, the tendency to table discussions of emotions as a distraction from capital-p Philosophy, I was skeptical as to whether our emotions should have anything to do with philosophy.  I found the topics of emotion to be, not only a thoroughly philosophical matter, but at the core of understanding any robust account of morality.  \nIn the intimate setting of a seminar, real discussion and exchange took place, and I left each session (regardless of how annoyed or tired I was at the beginning) invigorated by the debates from class.  She entertains the class with a brand of humor that is harmless and always self-depricating.  Prof Bell facilitated such fruitful exchanges in her charitable interpretation of a students position that would keep our discussions focused.  If she's ever been accused of being \"mean\" or judgmental to a student (as I fear she has been accused of in the past), I would venture to say that said student perhaps takes themselves to seriously.\nShe is empathetic, approachable and gives detailed comments on papers.  She pushed back the date of our final papers so that we would have the weekend to write them... I should only wish I had more \"mean\" teachers in college.  \nIn summary, I recommend taking this seminar if you can get into it.   \n \nWorkload:\nminimum of five short responses to readings, one 5 pg response paper, and one 10-12pg final paper\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 20, 2011",
            "review_content": "\nNot a bad professor in the classroom.  But she's not very easy or pleasurable to communicate with.  And you will not get a good grade.  As she says herself, her grading policy is old-school. So if you feel like taking a class with the toughest grader you will ever have (and keep in mind that this class is mandatory so even science-y people adverse to philosophy must take it), then go ahead. Otherwise, RUN AWAY!\n(However, take this course with her if you want to hear her get personally offended at, and quote this Culpa review in class. As if every other professor didn't have some student criticism too.\nGeez.\nWorkload:\nStandard midterm/final, 4 short assignments each 1/2-3/4 of a page single-spaced. One ~5 page essay.\n"
        },
        {
            "course_name": "Contemporary Moral Problems",
            "review_date": "May 17, 2011",
            "review_content": "\nConsider yourself warned. Professor Bell is very intelligent, and considered by some of her peers to be a good philosopher. However, she often seems to be more in the business of making (rather harsh) moral judgments upon her students rather than teaching them and helping them explore ideas about ethics and morality.\nHer ethics seminar was structured pretty well, but she was frankly just unprepared for class most of the time. Rather than engage with the class on the readings, she distanced herself by making handouts and reading from them. Contemporary Moral Problems was better because she was more prepared for the class, having taught it many times before. The material being significantly more difficult in the ethics seminar, she was unable to really make clear the central points of the readings.\nIn general, though, Macalester tends to have rather extreme views on certain issues, and is unrealistic in her expectations of students to adopt said views. This is perhaps her most dangerous and unpleasant quality as a teacher of ethics. In a large class like Contemporary Moral Problems, it is less noticeable -- but stay away from her at all costs in the more intimate seminar-level.\nWorkload:\nEthics Seminar: 7 Courseworks posts, 1 4-page response paper, 1 12-page final paper\nContemporary Moral Problems: 3 1-page assignments, midterm, 5-page paper, final exam\n(very manageable on both counts)\n"
        },
        {
            "course_name": "Contemporary Moral Problems",
            "review_date": "January 10, 2011",
            "review_content": "\nProfessor Bell is a wonderful teacher absolutely deserving of a silver nugget. For those inexperienced with Philosophy, the course can be a difficult adjustment, as the writing expectations and material coverage will be different than what is expected in other humanities fields. However, Professor Bell is willing to discuss any of the material and is easy to approach.\nHer defense of authors, which came under criticism in other reviews, is just part of her teaching style. I agree that her defense of certain pornography criticisms seemed specious at best and failed to convince much of the class. The classroom atmosphere is generally relaxed, and while there are a lot of people (around 60) it's possible to get one or two comments in per class.    \nSome of the readings in the textbook were a little boring and straightforward, and others outside of the textbook were extremely long/difficult and contained information we didn't need to know for the tests or discussions. However, the majority of her reading selections were extremely thought-provoking and rewarding.  \nWorkload:\nThe readings vary in difficulty - usually readings in the textbook are simple and relatively straightforward, while those taken from outside can be complicated and time consuming. Grading seemed very harsh at the beginning and got easier as the course progressed. I'm not sure if this was because of the grader arbitrarily leaving the course.\n"
        },
        {
            "course_name": "Contemporary Moral Problems",
            "review_date": "December 31, 2010",
            "review_content": "\nMacalester is great, but be careful arguing with her about pornography- she'll quickly respond to you negatively. Her philosophy is sound in other areas, but on this issue she starts making absurd behavioral claims that would require a million studies to be proven, using her catch phrase for the topic \"it seems that the best explanation is...\" when it reality- it isn't. She'll essentially claim that the existence of porn is the cause of rape, and that all porn is violent. A scientist she isn't.\nHowever, overall I enjoyed the class, even if the grading was weird and differed depending on whether it was her or the TA grading. But a gold or silver nugget? hardly.\nWorkload:\nShort assignments, paper, midterm, final. easy enough.\n"
        },
        {
            "course_name": "Contemporary Moral Problems",
            "review_date": "December 28, 2010",
            "review_content": "\nThis class was advertised as a bit of an \"easy\" class.  I would disagree--especially if you are a philosophy major.  The topics were interesting but the class discussions were sophomoric at best--Bell does not really control the discussion and many tangential things are argued for the most of the class time.  Bell thinks any criticism of the readings or topics is acceptable while in class--nothing is wrong to say in her class even when it reveals that the person talking has not done the readings.  She is an extremely nice person but she is a bad teacher, in my opinion.  She did not grade any of my work except the final and the TA often gave me contradictory interpretations to what Bell was teaching.  Additionally, the grader dropped the class in the middle of the semester and gave no explanations for his grading of the midterm or short assignments.  Bell was often behind in the syllabus and cut any review sessions to teach new material before exams.  Overall, if you are seriously interested in Ethics, I would take a more advanced, in depth lecture class.  \nWorkload:\n3 short assignments, 1 paper, 1 midterm and 1 final\n"
        },
        {
            "course_name": "Contemporary Moral Problems",
            "review_date": "December 20, 2010",
            "review_content": "\nI thought Professor Bell was great. She's really nice, and does a lot to help you learn philosophy if you've never taken it before. The class is mostly discussion based, even though it's a sixty person lecture, which is nice. My only criticism would be that the topics got a little monotone by the end, there seemed to be two sides to issues like capital punishment, and we've heard all of those arguments before, so it got a little tedious. Overall though, I thought it was interesting, and Professor Bell makes sure to challenge you in discussion and on the assessments.\nWorkload:\nThree short assignments, one paper, midterm, final\n"
        },
        {
            "course_name": "Contemporary Moral Problems",
            "review_date": "November 08, 2010",
            "review_content": "\nTotally gold nugget worthy. Funny, fascinating, knowledgeable, and just a cool lady.\nJust to edit the below review, for contemporary moral problems this semester:\n6% of grade = short assignment #1\n7% of grade = short assignment #2\n7% of grade = short assignment #3\n25% of grade = midterm exam\n25% of grade = paper\n30% of grade = final exam\nThe short assignments are short. Literally, half a page to 3/4 of a page single spaced. Not that difficult, as long as you follow the directions and read the readings very carefully.\nMidterm isn't that bad at all, except the TA's grading is way too harsh. He/she wasn't giving out tons of D's, but the overall consensus is not such a happy one.\nPapers are no more than 5 pages, double spaced.  \nFinal exam is final exam. Good luck!\nAnyway, philosophy majors or non-philosophy majors: take this class!!! MB is amazing. you will become smarter and cooler. \n\nWorkload:\nmanageable, and if you're interested in the topics (you will be, they're really cool) then not that bad at all. Pretty enjoyable, in fact. Check above for the breakdown.\n"
        },
        {
            "course_name": "Contemporary Moral Problems",
            "review_date": "December 17, 2009",
            "review_content": "\nMacalester Bell is a delight, an absolute joy of a professor. Although young (compared, I think, with most professors in the Philosophy department), she is equally intimidating in intellect and argument as the most venerable among them, although graceful and charming both within and without the classroom to boot. Professor Bell does not often reveal her own positions on the subject matter at hand, preferring to encourage debate among students by herself remaining apparently neutral, and eager to challenge one on any argument one makes to ensure that one has thought it through. She is a sharp-tongued and entertaining lecturer who attempts, even in classes of forty students or more, to have class most often conducted via student response and discussion. I would highly recommend her classes to any and all.\nWorkload:\nFor Contemporary Moral Problems, two five-page papers, a midterm and a take-home final.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 24, 2008",
            "review_content": "\nThere's something about Macalester. We (yes, five students) have convened after a CC dinner and four hours of post-CC dinner contemplation to write our first ever CULPA review. With her Midwestern charm and Southern grace, Macalester (call her Professor Bell! she doesn't take well to newfangled informality) rules the class with her lace-gloved fist. \nGranted, she is a tough grader. This is especially apparent first semester, before her sunny side shows through. But her grading is fair; she gives balanced and detailed reviews on each paper (2 per semester) and short assignment (5 per semester) you turn in. You don't need to read everything, but you ought to read what you write about, because she has a decently atuned bullshit sensor.\nNevertheless, she does allow the ramblers to ramble, often to excess. But no one feels alienated or silenced in the class, and even the incoherent, excessively passionate talkers are endearing because in Macalester's class, each student is somehow beloved to the other.\nTruly, she encourages class cohesion. Students voluntarily type up and distribute review sheets that are super helpful for the midterm and final. She really drives the points in; she is all about clarity. And hilarityâ€”she is eminently quotable, but don't quote her! She googles herself and doesn't like to see her name appear on the BWOG. Also, her Minnesotan accent is adorable.\nWe apologize for the peculiar tenor of this reviewâ€”but a mysterious lady like Macalester demands such treatment.\n\nWorkload:\nMidterm, final, 2 5-page essays per semester, 5 short assignments (half to a full page, single spaced). She timed the papers well, so that they weren't during busy weeks.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 28, 2007",
            "review_content": "\nProceed with caution!\nOn the surface Professor Bell seems like an extraordinary professor. And in all honesty, she kind of is. Yet at the same time she is probably one of the worst professors I've ever encountered. \nI started the semester completely in love with CC and Professor Bell's class. However, once I realized how deadly she would be to my GPA I realized that despite liking her as an instructor and as a person, she was actually doing more harm than good to her students. \nProfessor Bell is a bit old school in her grading philosophy. She seems to believe in grade deflation to compensate for her abysmally incorrect perception of grade inflation at Columbia. By holding low grades to higher values (entirely her philosophy) she really does damage to a GPA. She warned us on the first day that we would love her but hate her grading; I didn't realize we should take her so seriously at the time. \nI hate that I have such a distaste for Professor Bell. As a person she is wonderful, but she doesn't realize the harm she is doing by grading so harshly. \nWorkload:\n2 papers, Average CC reading, 5 Short Assignments, Participation is important. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "November 11, 2007",
            "review_content": "\nI think I remember Professor Bell once said that her CC students never wrote reviews of her on Culpa...so I'll be the first! \nMacalester Bell is a Godsend for CC students. Not only is she one of the nicest people you'll ever meet at Columbia, she's super-smart and makes the class pretty fun and definitely interesting. \nWorkload:\nIt's about what you'd expect for CC\n"
        },
        {
            "course_name": "Philosophy of Art",
            "review_date": "March 07, 2007",
            "review_content": "\nProfessor Bell was a great professor, and the phil-art class is a good class for anyone who is interested in philosophy or art, and doesn't want a terribly demanding philosophy class. Her teaching style is a little simple, just reads her powerpoints right off the projector, but she showed a few films as well. That being said, you definitely learn a lot about aesthetics, and you can hold your own in a conversation with someone about \"what exactly is art\" after the class is done.\nWorkload:\nMaybe 40 pages a week, easy reading, and you don't have to do it because she covers everything in the lectures. 4 2-page papers, but they're easy and pretty creative. Midterm and final are pretty much right out of the class notes.\n"
        },
        {
            "course_name": "Philosophy of Art",
            "review_date": "December 31, 2006",
            "review_content": "\nGreat course, great professor. She designed the course, and this was the first time it was taught (at Columbia, she's taught elsewhere before). It is an intro level course, so no background in philosophy needed. The positive side to this is, well, if you've never done philosophy before, you can still take this course and not be left in the dark. The downside is that most people tended to be freshmen or sophmores, so the rigour of the the ideas and level of discussion in class was  never very deep, and sometimes even a little frustrating for those who did have some background or were upperclassmen. \nBut, seeing as it was an intro level course, it's hard to complain about that. Everything else about the class was great. The readings  were overall awesome, very interesting. Lectures were well organized, and usually didn't spend as much time on the less interesting readings. Discussion, though often obvious and superficial, was forthcoming, so class never dragged and there were few awkward pauses. \nThe professor was great as well. She was super-organized, and knew her stuff very well. The one time she forgot her lecture notes, she did the lecture extemporaneously, and you could hardly tell the difference. What was most surprising to me, was that in a class with over 40 people showing up every day, she managed to both generate a decent discussion with pretty good participation, and not let the discussion override her lecture and keep the class moving. The clear interest she showed in getting her student's opinions was refreshing, and made her very approachable. She was very open to talk during her office hours, so when people had questions that went deeper than the class covered, she was very willing to discuss an idea outside of class. \nOverall great class, great professor. Highly recommed both.\nWorkload:\nreadings for every class--not heavy at all, 1-2 hours at the most. 4 two-page argument papers assigned throughout the course (pretty straightforward, once you get the hang of them). Mid-term and final. overall pretty light. \n"
        },
        {
            "course_name": "Philosophy of Art",
            "review_date": "December 31, 2006",
            "review_content": "\nProfessor Bell is amazingly friendly.  She's very organized and spent a lot of time preparing for each lecture, which showed in her powerpoints and prepared comments.  The great thing about the class (30 person+ lecture) was that she was still able to elicit helpful dicussion from such a large group.  She effectively handled everyone's comments and knew whether to move to the next point in order to finish on time, or to save a few points for the next lecture.  I never went to her office hours or emailed her for help, but I expect that, given her continuous in-\nclass offers of help, she would be more than willing to spend some time with students on an individual basis.  I highly recommend her for any class: she kept teaching despite a hacking cough and near-death illness!!!!  As for the material itself, the class is based on a series of readings from two anthologies of essays on aesthetics and art.  It covers the basics: what is art, who decides, etc. \nbut also delves into some more fun and interesting stuff: the art of food, horror, photography, public art, etc.  We watched some war movies and Moulin Rouge (she even gave away an extra copy she had..she LOVES this movie for some reason).  In short, take this class if it's offered.  If not, take another class with her.  She's reallllllllllly nice.\nWorkload:\nModerate amounts of reading: usually two articles per lecture, some of which are pretty dense.  Four short papers (no more than 2 pages), short midterm and short final (about an hour each if you're quick and you studied).\n"
        }
    ]
}