{
    "prof_info": [
        {
            "prof_name": "Jesus Suarez-Garcia",
            "prof_id": 1212,
            "total_reviews": 19
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "January 09, 2017",
            "review_content": "\nJesus is one of the best teachers I've ever had. He is extremely compassionate and enthusiastic. He puts everything he can into his work, and it is extremely admirable. The class is not difficult, but do not take it with him if you do not intend to put in any effort. He deserves better students. \nWorkload:\nWorkload is simple. He will never check your homework, but you should do it anyways because he can tell if you don't do it and it breaks his heart. We had 3 short essays throughout the semester, and one final project. Nothing overwhelming. \n"
        },
        {
            "course_name": "Spanish for Heritage Speakers ",
            "review_date": "December 23, 2016",
            "review_content": "\nI took this class as a first-year my first semester of college. I can't say anything bad about Professor Suarez-Garcia; he is definietly deserving of a silver nugget. This class is specifically designed for heritage speakers, which means that the class is composed of Latinos and Hispanics. You will be required to speak Spanish during the entire hour and fifteen minutes, but since you would only be taking this course as a native Spanish speaker, speaking it fluently shouldn't be an issue. However, Professor Suarez-Garcia does not grade you based on how you speak the language, in fact, he openly states that even though he is from Spain, he does not believe that Spanish from Spain is best, which is incredibly comforting. The course itself is focused on grammar and learning how to perfect the language so that it is spoken \"formally\" instead of \"colloquially\". Even though grammar was a large part of the course, Professor Suarez-Garica also incorporated topics that had nothing to do with grammar, which was the basis of three short essays that we had to write. Throughout the entire semester, the Professor was always willing to answer our questions. He is also very flexible regarding due dates and grades. Overall, he was an amazing Professor and I would totally advise anyone who is willing to take this class to take it. \nWorkload:\n3 short essays (1st 250 words/ 2nd 500/ 3rd 750) -- Gives you an opportunity to correct mistakes for a better grade after each one \n4 exams (3 \"midterms\" and one final) -- These are based on grammar \nDaily homework (doesn't take more than an hour and some of it can be skipped or put off) \n"
        },
        {
            "course_name": "advanced language- cultura",
            "review_date": "May 13, 2013",
            "review_content": "\nI had Professor Suarez-Garcia when I took Adv. Language through Content (Cultura) and I initially wasn't sure how I felt about it. I exempted my language requirement and took this class the second semester of my first year and I can't tell you how much I feel I've improved my writing, speaking, and reading skills in Spanish as someone who has been fluent since 1st grade. He really encourages students to be aware of their learning environment as one where they shouldn't be afraid to fail, and he really genuinely wants students to learn through experience. The class was entirely conducted in Spanish (obviously) and that immersion alone was helpful in addition to his always speaking to us in Spanish. Grammatically, it surprises me how much I learned, and he balanced gramatical practice and study with cultural discussion and research. An amazing class, made me decide to minor in Spanish. \nWorkload:\n3 short 750-1000 word essays (one of them for final project), homework for almost every class, final project that included a presentation and paper. 3 exams\n"
        },
        {
            "course_name": "Elementary Spanish I",
            "review_date": "April 12, 2012",
            "review_content": "\nI'm surprised he doesn't have more recent reviews. Professor Suarez-Garcia was my teacher for Elementary Spanish I last semester. I didn't realize how fortunate I was until Elementary II; my current professor is great but here's what makes Professor Suarez-Garcia stand out:\n1) He's a very experienced teacher, so no matter how bungled your Spanish phrasing is, he actually understands what you're trying to say and gently corrects and helps you. Additionally, his English is also very good, so at least for my class, he always knew the Spanish translation for any English word we asked about.\n2) I don't know if this is common for Elementary I, but he conducts his classes entirely in Spanish, except for the first day when he explains the syllabus. Though this was quite intimidating at first, it's extremely helpful. And I doubt it's easy to do, considering he had to repeat and rephrase things a lot for us.\n3) He is incredibly encouraging. He'll be sure to praise you for your struggles throughout class, and he is actually sincere about it. This aspect may not seem that important, but particularly for beginners, it can really benefit your mindset towards Spanish.\n4) On the first day of class, he said that he wouldn't make us participate, but he actually does--this is good because you end up with a lot of practice, which is helpful for the exams. \nI highly recommend Professor Suarez-Garcia for this class.\nWorkload:\nWe had homework assignments most nights, but he didn't check or grade them--we just went over them in class. I think he prepared us very well for the department-wide midterm and final (based on how much separate studying I needed to do). The rest of the grade is determined by a project (which is not too time-consuming, and you get a partner), the oral exam, homework, and participation, all of which seem standard for the Elementary classes. \n"
        },
        {
            "course_name": "Intermediate Spanish I",
            "review_date": "January 03, 2010",
            "review_content": "\n  I liked Senor Suarez a lot.  He obviously loves teaching kids and has fun with it.  His class, though, requires a lot of busy work before every class, and on top of everything else there are daily postings on this facebook like site called edmodo.  Also, there is a final project with parts needing to be done weekly, so that builds up as well.  In class can be slow from time to time, but there are a lot of presentations and conversation.  My biggest qualm is that the midterm and final were mostly grammar based, and we spent very little time in class going over grammar.  Also, Jesus doesn't believe in worksheets for extra practice with grammar and tense mixers, so its hard to study for the departmental tests.  On a ligther note, he helps you become more fluent and a better speaker, as well as teaches you a bit of spanish culture.  Overall, I'd recommend Jesus' class.\nWorkload:\nMidterm, Final.  Final project.  Hw assignments daily.  3 essays.  Oral exam.  Postings on edmodo (daily).\n"
        },
        {
            "course_name": "advanced language- cultura",
            "review_date": "May 21, 2008",
            "review_content": "\nThe good thing about this class is that you don't have to buy any books- everything you need is online.  The course is on this way-too-painful-to-navigate website called a wiki, and its basically a forum you write in back and forth with students from the University of Leon.  Its good practice in speaking and writing, but I don't feel like it helped my grammar at all (which is what I needed).\nWorkload:\nThis class is a ridiculous amount of work for a 3 credit Spanish course.  There are a couple of essays, two difficult tests, and a final project.  With that, there are posts in the forums and grammar assignments every day.   I don't recommend this class, but if you take it, make sure you keep up with your work, because it will swallow you if you leave it all to the last minute.\n"
        },
        {
            "course_name": "advanced language- cultura",
            "review_date": "May 21, 2008",
            "review_content": "\nThe good thing about this class is that you don't have to buy any books- everything you need is online.  The course is on this way-too-painful-to-navigate website called a wiki, and its basically a forum you write in back and forth with students from the University of Leon.  Its good practice in speaking and writing, but I don't feel like it helped my grammar at all (which is what I needed).\nWorkload:\nThis class is a ridiculous amount of work for a 3 credit Spanish course.  There are a couple of essays, two difficult tests, and a final project.  With that, there are posts in the forums and grammar assignments every day.   I don't recommend this class, but if you take it, make sure you keep up with your work, because it will swallow you if you leave it all to the last minute.\n"
        },
        {
            "course_name": "Spanish for Spanish-Speaking Students",
            "review_date": "December 05, 2006",
            "review_content": "\nIn short, he is amazing! People at this school seem to think if you speak Spanish at home then you really don't \"speak\" Spanish.  You will not run into those people in this class since everyone is a native speaker (this is so nice).   Even though Jesus is from Spain, he does not criticize your accent if you are from Latin America, in fact he told us many times that we spoke perfectly.  Not only was he supportive of our unique struggles as native speakers with spelling and accents, he was supportive when people had illnesses and/or personal problems.  The daily assignments did not interfere with other work for more challenging classes. The homework was easy, interesting, and helpful at looking and understanding our problems in our own lands. Take this course! If you are not a native speaker take one of his other courses, he is wonderful! \nWorkload:\nDaily assignments, class participation, two quick tests and three essays with rewrites, very doable\n"
        },
        {
            "course_name": "Intermediate (Spanish) Conversation I",
            "review_date": "May 11, 2006",
            "review_content": "\nJesus is a nice guy and he's funny and he certainly knows Spanish well.  With that said, this class was entirely useless.  It was worse than any high school Spanish I ever took.  A conversation course he let 20+ people into so no one ever got to speak, random useless assignments, a focus on \"debunking stereotypes\" that no one had in the first place... academic torture for anyone who's ever taken the time to think half-intelligently about other cultures.  On the plus side, they do offer a pretty cheap chance to go to Spain if you're interested.  I say, save your money and your time and skip this BS.\nWorkload:\nA little more than your average conversation course--and he doesn't give everyone As!\n"
        },
        {
            "course_name": "Intermediate (Spanish) Conversation I",
            "review_date": "May 11, 2006",
            "review_content": "\nJesus is a nice guy and he's funny and he certainly knows Spanish well.  With that said, this class was entirely useless.  It was worse than any high school Spanish I ever took.  A conversation course he let 20+ people into so no one ever got to speak, random useless assignments, a focus on \"debunking stereotypes\" that no one had in the first place... academic torture for anyone who's ever taken the time to think half-intelligently about other cultures.  On the plus side, they do offer a pretty cheap chance to go to Spain if you're interested.  I say, save your money and your time and skip this BS.\nWorkload:\nA little more than your average conversation course--and he doesn't give everyone As!\n"
        },
        {
            "course_name": "Intermediate (Spanish) Conversation I",
            "review_date": "January 16, 2006",
            "review_content": "\nSweetest man alive!!!  Hysterical too.  Definitely take the class.\nWorkload:\nNo Midterm or Final just random hw assignments.  Maybe a presentation.\n"
        },
        {
            "course_name": "Intensive review_content of Elementary Spanish",
            "review_date": "December 14, 2005",
            "review_content": "\nProfessor Suarez-Garcia is the absolute sweetest professor I've had.  He speaks and moves the class along slow enough for the people that need repeating yet fast enough to keep the rest paying attention. He's a native Spaniard and sometimes needs help with the English word he's looking for, but his Spanish accent makes yours so much better. I came out of HS hating Spanish, but Professor Suarez Garcia made be fall in love with Spanish again. Also, it's fun getting e-mail from Jesus :) The videos that you have to go watch are boring and slooow, but you actually don't have to go to the library to watch them, just google the ever-so-dramatic soap opera and you'll find a way to watch it sitting at your laptop with a cup of coffee. The final presentations on this soap opera will make watching 20 something episodes worth it. Don't worry about the exams too much, there's more to your grade than test scores. \nWorkload:\nA couple of episodes of a soap opera each week, work in the workbook every day, and reading in the textbook every day. A couple of short exams and a couple of longer exams, a final presentation, and a final exam. \n"
        },
        {
            "course_name": "Intermediate Spanish I",
            "review_date": "December 21, 2004",
            "review_content": "\nGreat class, great professor!  Highly recommended, best spanish class I have ever taken.   \nWorkload:\nCompositions, Quizzes, Homeworks, Final Oral, Departmental final (cumulative)\n"
        },
        {
            "course_name": "Advanced Oral/Written Spanish",
            "review_date": "September 06, 2004",
            "review_content": "\nAmazing professor & amazing class!  I loved this class.  Professor Suarez made me feel so comfortable speaking in class, and I really appreciated this because I had always been hesitant to speak in other classes.  The class involves discussion about topics that the class picks in the beginning of the semester.  As Prof. Suarez goes through each class, he assigns articles to read and gives us questions to think about.  Prof. Suarez makes the class as enjoyable as possible.  One of our assignments was to watch Pedro Almodovar movies.  We did group work as well, and we also had to participate in a cultural event in the city, which was very fun.\nProf. Suarez makes the class feel very laid back and casual, but at the same time, he provokes thought and allows you to improve your speaking and writing skills.  I cannot say enough good things about this class and professor.  Prof. Suarez is so nice, friendly, and approachable.  He is more than willing to answer any and all questions, and he is very knowledgeable about Latino culture and language.\nWorkload:\nWorkload is fair and interesting.\nHomework consists of reading the articles, commenting on the online discussion forum, and sometimes listening to online audio.\nThere were three writing assignments that were about 750 words each.  Prof. Suarez graded them fairly and allowed you to revise them, which was great.\nThere were two quizzes on grammar, which you should not have a problem with if you read the textbook, do the assigned textbook exercises, and pay attention in class when Prof. Suarez goes over the textbook material.  The textbook assignments are definitely manageable (usually around 10 pages + the exercises).  \nThe final consisted of a group presentation and an oral exam.  This might sound kind of intimidating at first, but it isn't at all.  The oral exam, or \"interview\" as he called it, was very casual, so it feels like you're participating in a regular class discussion.  The final group project was also a lot of fun.  You get to pick your own topic and then use whatever form of presentation you wanted.\nThis class is wonderful, so if you're trying to decide on a Spanish class to take, this is it!   \n"
        },
        {
            "course_name": "Advanced Oral/Written Spanish",
            "review_date": "May 14, 2004",
            "review_content": "\nWONDERFUL PROFESSOR!!!! so nice. so awesome!!! This course does have some annoying homework like online discussions, but all the work is completely manageable. Do not be fooled by the fact that it's called Advanced/Oral written. It's a fun class and Jesus is awesome. You can make all the mistakes you want and he always ALWAYS helps you. Great class to take if your other classes are really stressing; it's not that difficult but you still learn a lot. Would definitely recommend it. Whether you really like Spanish or jsut want to learn more, this class is still great to take. Jesus is a fabulous professor. I remember our class making the same mistakes in subjunctive like 5 or 6 times, and jesus was still really cool about it. \nWorkload:\nnot bad at all. Online discussions. small grammar tests that are not serious. some essays. some projects. you do a little bit of everything, which is good cuz Jesus tries to get you to learn Spanish in all different ways. YOu read articles and listen to video clips on line. He also makes you watch Spanish movies. It's great. \n"
        },
        {
            "course_name": "Intermediate Spanish I",
            "review_date": "December 25, 2003",
            "review_content": "\nToo bad he is not teaching Int. Span II next semester. He is indeed an excellent professor. He is down-to earth. Take this class if you really want to learn spanish, at least to learn how to speak in span somewhat fluently.  When you take this class you would have to speak in class, which is great b/c you dont really know a language until you speak it. I have been taking spanish since middle school and I have to say I spoke more spanish  in this semester than in all of my other yrs of learning spanish. Jesus is a great guy. He will defintely take the time to get know everyone individually. You would have to bear with him on his english, that is whenever he speaks in Eng. He speaks in spanish most of the time and will speak to u in english only when u really dont understand him. He is definitely understandable and approachable, both inside and outside of class. I highly recommend his classes. \nWorkload:\n3 class midterm, 1 cumulative final, 4 essays, workbook exercises, final project (skit), and some small exercises from the textbook.\n"
        },
        {
            "course_name": "Intensive review_content of Elementary Spanish",
            "review_date": "December 15, 2003",
            "review_content": "\nI can't believe there aren't more raving reviews about Professor Suarez! This guy is amazing, beyond amazing...despite my hesitance about taking Spanish for my language requirement since I got sick of in high school, Jesus has revitalized my love for the language. Jesus is very knowledgeable not only of the language but also of the culture. He's incredibly helpful in class and remarkably does not get annoyed when the class asks questions. In fact he is totally cool when we ask him to repeat something or to say it slower. I learned so much from this class at the same time I enjoyed this class more than any other. It was a small size, so we were able to get to know one another. Jesus is personable inside and outside of class. He is actually really interested in us as people, other than as just students. He has a great sense of humor which of course adds to the fun of the class. The material wasn't too hard but I really have to credit that to the professor and of course my fellow hard working classmates. There's a lot of grammar to review and it was required to watch a cheesy soap opera, but all in all I learned a lot. Jesus made it very comfortable for us to speak Spanish in class because he never scolded us for wrong pronunciation rather he helped us out and we were always allowed to tell ancedotes in Spanish and whenever we didn't know how to say a word Jesus helped us. The more speaking in class, the more we were able to comprehend the language. I highly recommend this class. I can not imagine taking this course with anyone else. \nWorkload:\nNot bad, not bad at all. There are excercises to do in a workbook (which you should do-because he will collect it on test days), 3 quizzes, 3 tests and a final. Plus the skit at the end based on the soap opera, but I found that pretty fun to do. Homework varies each night, he doesn't check it or anything but it's best to come to class prepared so you can contribute to class discussions...makes it all the more interesting. The tests will be no problem if you study your grammar and do the readings. Once again an AWESOME CLASS. \n\n"
        },
        {
            "course_name": "Intermendiate 1& 2",
            "review_date": "December 03, 2003",
            "review_content": "\nJesus is such a nice guy and a good teacher at the same time. He speaks Spanish the whole time since people can hardly understand his broken English. That's good though cause you learn a lot. he explains the grammar really well and often has better explanations than the book.\nWorkload:\nNot too bad. A few exercies for each class. A few papers. Overall, you should be able to get a good grade easily.\n"
        },
        {
            "course_name": "Intermediate Spanish I",
            "review_date": "September 11, 2002",
            "review_content": "\nProfessor Jesus Suarez-Garcia is a nice guy. From Spain, so he has a lisp when he talks but it doesn't hinder you from understanding him. You have to speak spanish in this class, but he's real nice about it. He helps you out. Overall, a good guy. \nWorkload:\nNot unreasonable. Few exercises per night. He doesn't collect them but he does notebook checks.\n"
        }
    ]
}