{
    "prof_info": [
        {
            "prof_name": "Sergey Levchin",
            "prof_id": 2772,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Second Year Russian I",
            "review_date": "June 28, 2006",
            "review_content": "\nI hate Sergei, I'll be honest. BUT, I also grew to respect him as a teacher. There were times that we were both incredibly frusterated by eachother, but in the end, I think I actually managed to learn something. Yes it's a lot of work, and yes sometimes we have long awkward silences in class, but in the end I think it somehow worked out. It's one of those classes that the entire year you swear you aren't learning anything and it's all a waste until you get to the end and realize that you actually did learn...\nWorkload:\nlots. hours of homework a night (for me at least). but also occasionally gave us a weekend or a break off, which was nice.\n"
        },
        {
            "course_name": "Second Year Russian",
            "review_date": "December 31, 2005",
            "review_content": "\nWith all the fantastic teachers in Columbia's Slavic Languages department, it's difficult to imagine why anyone would want to endure the abuse and aggravation of a semester with Sergey Levchin. Having immigrated to the States sometime during high school, he speaks both English and Russian perfectly and is therefore is able to be really lazy while managing to appear competent. A good foreign language teacher, I've always felt, should work to foster a environment where students feel comfortable using their imagination. During class, not only does Sergey make his students feel as if all their sentences are boring and stupid, but God forbid you should make a mistake of case by saying x instead of y. He'll cut you off mid-discourse with a scornful \"Pochemu x?!\" rather than tactfully slipping in the correction sidewise. \nTo his credit, his assignments tend to be very useful and entertaining, such as having us translate short poems from English to Russian while preserving the rhyme scheme. He'll also occasionally try to get an informal linguistics debate going, which could have been interesting, if it weren't for the fact that he would rather dismiss a student on the grounds of some semantic quibble than hear anyone criticize his own pre-established opinions--talk about insecurity!\nIn conclusion, if getting a good grade and practicing your grammar is all you care about, then I suppose there's nothing wrong with taking Sergey's class. But if you're taking Russian for Russian's sake, and are looking for a good classroom experience, then by all means steer clear.\nWorkload:\nBe prepared to do the entire workbook--which, i'm sorry to say, doesn't hold a candle up to the masterpiece that was \"Nachalo\". You'll also have to memorize lots of poems and do an occasional journal entry, but all in all it's lighter than russian 1. \n"
        }
    ]
}