{
    "prof_info": [
        {
            "prof_name": "Jonathon Kahn",
            "prof_id": 689,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": null,
            "review_date": null,
            "review_content": null
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "April 03, 2005",
            "review_content": "\nWell, Jonathan Kahn won't be here next semester, so this is more of an homage to him, but these things just need to be said.\nJonathan Kahn--the man just keeps it real.  There are incredible professors at Columbia, like say Janaki Bakhle, who will deliver eloquent flowing sermons that leave you gasping at how awesome and intelligent they are, and no doubt these professors are awesome.  Probably the reason we all go to school here.  But there is also something to be said, especially in a seminar class like CC, about a professor who can engage with his or her students, and I have never had a professor do this as well as Jonathan Kahn.  No doubt part of the reason students love him is because he's very accomating;  he's always willing to push back paper dates, we're having class at restaurants while the grad students strike, and I have no doubt that when it gets warmer we'll have lots of classes outside..\nBut the real reason students love Jonathan Kahn is because their relationship to him is not student to professor, but rather inquirer to fellow inquirer.  Kahn has no problems admitting when he's not an expert on a text, but he is excellent at using rational discourse, and eliciting rational discourse from others, in order to get at some idea of what these texts are saying, which really, when you think about it, isn't that easy.  He is always willing to listen to other viewpoints, no matter how inane they are, but is equally willing to disprove such inanities with reason.  I want to stress here that he doesn't scoff haughtily and proceed to talk down to students, but just uses reason and, gasp, common sense to tell them why he thinks they are wrong.\nJonathan Kahn's goals for CC are, to me, the goals of a true \"academic\":  having students gain and improve their understanding of texts, and, more importantly, the issues the texts bring up.  Thus he cuts back on the insane reading load so that students will actually do it.  He assigns extra texts that wouldn't be assigned in any other CC class, not to be radical or conservative, because they help students to better understand the philosophical topics of the class, even if, omg, they're not extremely dense philosophy or, OMG, a secondary source, explaining some of that philosophy.  He creates a comfortable class environment through humor and honesty so that the class ceases to be a class where you come out with a grade, and instead becomes the orignial purpose of a class, of a university: a gathering of friends intent on coming to a deeper understanding to what is really at stake with these texts, with life.  He assigns brief articles that force his students to really consider all sides of an issue:  maybe there was something to larry Summers' comments, even if he phrased them poorly.  maybe race isn't entirely a social construction.  Kahn doesn't take sides on these questions, or if he does its obvious that its his plain opinion,  but brings them up because he's a true academic who really cares about understanding, and doesn't come at the questions of the class with prejudices of any kind.  \nI would feel really weird calling Jonathan \"Professor Kahn\"  That's because he's something that previously I wasn't sure even existed at Columbia, or in academia.  A normal person, an honest, warm, funny fella who tries to tell it like it is, or find out what \"it\" is really like, which is the freaking purpose of academia, without trying to sound pretty or smart, or prove a particular point of view, or to show why you're right and the other person's wrong.\nSorry for the Jonathan Kahn love-fest but the man deserves it.  He's a breath of fresh air in the stale, endlessly self-reflexive circle-jerk that academia can become.  He's down-to-earth, funny, honest, and  biased only towards what is commonsensical, rational, and true.  He's just like you.  Ask about his life, about grad school, about the post-collegiate world, and he'll just shoot it straight.  I think that's incredibly rare these days, and he deserves credit.   One student described our class as \"gangsta.\"  Here take gangsta to mean without any of the lifeless ritualistic rigamarole that sometimes plagues academia and it describes Jonathan Kahn perfectly.  If somehow he ends up back here, or if you transfer to wherever he goes,  don't miss out on a rare \"academic\" experience.\nWorkload:\nlighter reading than almost any CC class.  three papers(4-8)  with lots of choices for the topics, including decide your own.  Kahn is a pretty tough grader, but frankly he's just honest.  He considers how well you construct your argument and whether what you're saying is interesting.  That's how things should be graded.  So deal with it.\n"
        },
        {
            "course_name": "Exodus and Politics",
            "review_date": "January 02, 2005",
            "review_content": "\nJonathon is a zealous new teacher who is young enough to remember exactly what a good teacher is and is smart enough to do it.  With that said, he grades hard (over-enthusiastic), but is more than willing to help you out.  Relates well with students, truly knowledgeable.  Also likes to host make-up classes at his apartment.  He may be a tad arrogant.\nWorkload:\n2 8 pg papers, be very prepared to discuss weekly readings, which are hefty\n"
        },
        {
            "course_name": "Exodus and Politics",
            "review_date": "December 29, 2004",
            "review_content": "\nI'm writing a review even though I don't think this course will be offered again, as Prof. Kahn probably won't be here next year.  Still, if you end up in one of his classes or he is around next year, consider yourself lucky.  He is a great discussion leader, and the readings he chose for this class were (almost) across the board incredibly interesting.  I myself am not a religion major nor do I wish to be, but I found the readings and the issues we discussed fascinating.  I could talk about some of the students, but I won't...just be forewarned that my guess would be in any religion class that you are going to run across some people who are so firmly entrenched in their views that it limits the discussion a bit.  Still, this was no fault of Kahn's....I wish he was going to be around next year, because I would take anything he was offering.\nWorkload:\nLoads of reading.  One medium-sized 5-7 page midterm paper and one 8-10 page paper.  Overall, not bad in terms of writing for a seminar, and no outside research is required.  \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "August 21, 2004",
            "review_content": "\nJon Kahn, as some students referred to this professor, understands that more work does not always equal a better education.  While the course contains a fairly large amount of reading, Professor Kahn made sure to highlight the most important aspects through his detailed questioning of the works in class.  Professor Kahn demands the attention and energy of his students, and class participation seems to be a fairly large factor in the grading (ie: speak up in class, or you will be marked down).  While he did tend to grade the essays toughly, he was committed to improving our writing over the course of the year, and he made himself available for one-on-one discussion sessions.  He weights the later essays more heavily, and I did not feel as though the final semester grades were unfair.  Be prepared to spend a lot of time thinking about your essays, and actually proving your thesis.  Besides the work, Professor Kahn always made class enjoyable (and sometimes comical).  We had class outside and sometimes at local restaurants, in addition to taking a trip to the MET.   We also had a class discussion about whether or not to have a final, and we were able to negotiate our terms for the take-home final.  While some people complained that the papers were too harshly graded, i thought the standard was fair and challenging.  Overall, a great class.         \nWorkload:\nModerate.  A few short 1-2 page papers, and 2 longer papers.  Both semesters, one significant test was dropped from the schedule, so that we only had a take-home essay, instead of a midterm or final.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 10, 2001",
            "review_content": "\nProfessor Kahn is a pretty good professor. He leads the discussions in good directions, allowing the students to do most of the talking. On the other hand, I wouldn't say that he's an easy grader- far from it. His assignments are unclear, so beware of stagnating somewhere in that awful place we call the B range...\nWorkload:\n2 5-7 pagers, 2 1-2 pagers, a midterm and a final.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "August 14, 2001",
            "review_content": "\nIt was a true pleasure to be in his class. Interesting, stimulating, and not too difficult. He makes a tremendous effort to meet with the students at their convenience, and is genuinely interested in improving their writing.\nWorkload:\nAverage workload, easy grader.\n"
        }
    ]
}