{
    "prof_info": [
        {
            "prof_name": "Anne Holt",
            "prof_id": 9563,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Lit Hum",
            "review_date": "June 09, 2015",
            "review_content": "\nAnne Holt is great. If you get assigned to her section for Lit Hum, you're going to love the class (which I can't say is the case in most other sections). She takes the time to talk to everyone about their essays/assignments, knows a lot about the texts we read in class, has a sense of humor (seems insignificant, but is surprisingly important in a class like this), and understands that life sometimes inhibits things like completing assignments right on time (to a point, of course). She'll do a great job preparing you for the final, and is a very fair grader overall. \n\nWorkload:\nThe workload isn't really bad, there are the standard LitHum essays + online book discussion posts (remember to do these, and try to read through some of the ones other people post). The posts are what you will all discuss in class the next day, so as long as you at least half-try you'll have something to say in discussion.\nParticipation in class is important! If you're a naturally shy person and really don't like talking in front of people, make sure your discussion posts are great (but still try to talk in class every now and again).\n"
        },
        {
            "course_name": "Literature Humanities",
            "review_date": "May 13, 2015",
            "review_content": "\nAnne is hands down one of the best professors I've had. She made lit hum such a great experience, and is a knowledgeable, friendly, helpful professor and really just an inspiring person to be around. She was more than happy to help discuss essay topics, thoughts on the books or anything at her weekly office hours, and she is extremely skilled at mediating a productive discussion. Our classroom discussions were in no way dominated by Prof. Holt, but she made sure to gently steer us in the right direction  when we strayed off topic, and would always bring up something interesting so that there wasn't the awkward silence that often happens in Socratic discussion settings. \nEach book, she would start off our discussion with some background info on the author, novel, and historical context, and she would track down experts to answer any questions we had that she couldn't answer herself. Her grading is extremely fair, and her criticism constructive. Highly recommend taking a class with Anne if you have the chance!!\nWorkload:\ndiscussion board post for each class (~200-250 words), usual lit hum reading, 2 papers per semester, midterm, final\n"
        },
        {
            "course_name": "Literature Humanities",
            "review_date": "November 20, 2013",
            "review_content": "\nOne of the brightest people I've met in my time here. She's amazingly familiar with the texts we study and leads the class along incredibly insightful and interesting thematic threads. Sometimes discussions take strange tangents (reading the Iliad and talking about Trojan condoms--would you really trust condoms named after the Trojans?), which are rather refreshing...Need I say it's one of the most memorable classes I've taken here? \nWhen Annie is not successfully guiding apathetic freshmen through texts of times gone by, she also runs Morningside Opera and works on her thesis. How she remains sane is one of life's greatest mysteries. \n\nWorkload:\nIt's lit hum--expect to read (and write). That being said, she freely gives extensions for papers (better a thoughtful paper, albeit late, than a shitty one on time). Relatively lenient grader. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "December 17, 2009",
            "review_content": "\nAmazing professor.  She is extremely helpful, truly cares about all of her students, and is very approachable.  She doesn't teach you to be a formulaic writer; she teaches you to be a good writer.  Her office hours help a lot, and she is able to help with developing a good thesis.  There were many in-class group/partner discussions and revising sessions so it helps to have enthusiastic peers (which I did, my classmates were all very involved and had a lot to contribute).  Regarding grading, although she is not easy, she is definitely very fair.  If you put in enough time and effort, you will do very well.\nWorkload:\nLens, conversation, and research essay, each with a project proposal along with other smaller assignments.  Coda/revision assignment was optional.\n"
        }
    ]
}