{
    "prof_info": [
        {
            "prof_name": "Matthew Sakakeeny",
            "prof_id": 2948,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "May 21, 2006",
            "review_content": "\nIf you're lucky enough to get Matt as your music hum prof., don't switch! Matt is an amazing prof., and in comparison to stories I've heard of other music hum classes, will make the class really enjoyable. Instead of making the curriculum only about classical music, he incorporates all kinds of music (including contemporary radio hits, the beatles, you name it) into his lectures, while making it clear that he really hates britney spears. \nInstead of making you listen for very small details and drilling techincal terms, he has a very relaxed class structure that stresses listening to any kind of music objectively. This is a really great approach, and everyone in the class was enthusiastic about it. Matt even brought his guitar into class and sang a Christina Aguilera song once, which was hysterical! This class is very worthwhile -- you will learn about music theory basics, and you will definitely get a clear understanding of music history and its development. However, Matt will also give you music from many cultures, from many genres, and will let you contribute the music you like as well. Each class, one person plays a song they like for the class, and Matt asks a few basic questions or comments on how elements in that song might tie into classical music or music theory from the class. It's really a fun way to learn the stuff, much better than sitting in a dark room falling asleep to music with someone pontificating on the harmonic structures that go over your head!\nWorkload:\nTwo concert reports, each about 4 pgs. The first is on classical music only, the second can include jazz. Midterm and final, with no identifications like other sections. \nReading is very optional.\n"
        }
    ]
}