{
    "prof_info": [
        {
            "prof_name": "Jessica Merrill",
            "prof_id": 13433,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "February 01, 2018",
            "review_content": "\nJessica was a great Lit Hum teacher, especially considering she's relatively new to teaching the course. She was clearly very knowledgeable about the texts and was great at mediating the conversation, without dominating it. Jessica was also very reasonable, and if for whatever reason an extension was required for a valid reason, she was happy to give one. She also takes a lot of time to critique papers and blog submissions, and is genuinely interested and invested in your progression as a thinker and a writer. She also clearly values participation, and if you participate regularly and put in a little effort in your papers, her grading is completely fair. I thoroughly enjoyed Lit Hum with Jessica, and would definitely recommend her.\nWorkload:\n2 papers (4-6 Pages), a weekly blog post, a midterm and a final. Not overwhelming at all.\n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "September 15, 2017",
            "review_content": "\nGreat Lit Hum Teacher. Does a good job of making allowing the discussion to flow, and interjecting whenever she had something interesting to say. My class was one of the first she ever taught, and she did a really good job of making Lit Hum both enjoyable and rewarding.\nShe really appreciates people who participate meaningfully and will give you a good grade, even if your papers aren't great, if you try and participate. Her grading is not necessarily easy, but is very reasonable. She also goes out of her way to give you feedback on your writing, and really enjoys seeing students progress. Would highly recommend her class, as it made Lit Hum really enjoyable.\n\nWorkload:\nStandard Lit Hum Readings, 2 Papers, 1 Midterm and 1 Final, and a \"blog post\" about each text. She also does sometimes have reading quizzes but those essentially count for nothing and are merely a means of preparing you for the midterm/final.\n"
        }
    ]
}