{
    "prof_info": [
        {
            "prof_name": "Irene Hueter",
            "prof_id": 6359,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "SIEO 4150 - Probability and Statistics",
            "review_date": "May 29, 2013",
            "review_content": "\nI can speak for most of my classmates when I say that we were in disbelief about how much of a mess this class truly was.  This was definitely the most unfortunate disaster of a class that I've witnessed at Columbia.  It's really disappointing that so little care is put into a course that is required for so many majors.  \nIn terms of what you'll get from the class, most of the previous reviewers have done it justice.  This class was ran with the mentality that people are taking a probability and statistics class solely to fulfill a degree requirement, and they will never need this material in future coursework or careers.  This is not a mathematical treatment of the material, but a plug-and-chug cookbook approach.  If there is any chance you will need any of the material taught in this class later, do not take this class under any circumstances.  After this class, I feel that if I ever want to do anything that requires probability or statistics, I'll need to take another intro course that actually teaches me the material.\nThe incompetence of Irene Hueter was probably the most mind boggling part of this entire miserable experience.  She posted a welcome letter to us on Courseworks before the class started, \"I will post my lecture notes after the class that should cover the essence of the class.  Occasionally there will be additional examples and illustrations covered in class not contained in the notes. If my lecture notes are not yet posted prior to the class, the reason is that I often prepare my presentation slides only last minute before class, without having any chance to post them.\"  I was kind of shocked that she'd put those words in writing to the class before the first lecture, but after seeing a few minutes of her \"teaching\" that triviality was quickly overshadowed.  There was no way she had any teaching experience, so it appeared.  She also seemed confused about the material she was reading directly from pdf files that were projected in front of the classroom.  Basically, everybody figured this out, and after two weeks, 10-20 kids would stay for class out of an enrollment of 160 students.  Essentially, Havemeyer 309 could've been replaced with a homework drop box.  That's all this class ever was to most students.\nTowards the end of the semester, a large number of our homework assignments mysteriously went missing.  If this happens to you in this class, contact the TAs and professor as soon as you realize you don't have a grade, and if you don't get a response, contact a dean ASAP.  I'm not kidding.  Several students were shut down when they complained to her about missing homeworks because they waited too long to do so, and therefore they received 0s for assignments that the TAs lost.  \nThere was also a strange incident when 20 students lined up after class to ask the instructor to ask why they received points off for a problem that they solved correctly.  Irene eventually looked at the posted solutions, and realized they were incorrect, and all the students lined up had the correct answer.  She later told students that she wasn't sure if  the graders ever took a course in probability!\nIrene definitely loved blaming the TAs and graders for everything that went wrong in the class, while she never stopped wearing that fake smile (which by the way is the only reason any of the reviews on here are less than completely negative).  In all fairness to Irene, she wasn't the only horror this class.  The TAs and graders were also awful.  Responses to emails were either nonexistent or too delayed to be of any use (such as two week delays).  Irene definitely loved throwing them under the bus, but they really did suck.  Grading on homework assignments was usually quite harsh - basically make sure you have the right answers, because they usually seemed to just look at the answers.  Don't ever bother disputing a grade - nobody will be there to listen.  \nWorkload:\n30% Homework Assignments - Best 10 out of 14 counted.  Remember that assignments that go missing count as a 0.  \n30% Midterm Exam\n40% FInal Exam\nThe average on both exam was around an 80.  When preparing for the exams, don't waste your time trying to actually understand the material at any level of depth.  Simply make sure you know how to do the practice problems she distributes beforehand, as the exam mostly consists of the exact same problems with different numbers,\n"
        },
        {
            "course_name": "SIEO 4150 - Probability and Statistics",
            "review_date": "May 27, 2012",
            "review_content": "\nTake it if you want an easy A and maybe learn a little bit of statistics.  As someone who is not majoring in stats, this class wasn't difficult and was surprisingly useful in that it taught me a few formulas and the big picture for how statistical methods work.\nOn the other hand, do not take this if you need a firm understanding of statistics later in your academic life.  It will woefully underprepare you for that.  that is, if you are a stats or econ major, take something else.\nI did not go to a single lecture and put about an hr a week into the HW.  that was enough.  For the exams, you are allowed a cheat sheet.  Just take the practice problems and answer key and print it on your cheat sheet.  As long as you know how those work, you should at least get the avg.\nBottom line.  This is a class where you are expected to take formulas verbatim from the textbook and blindly apply them to problems.  That is all you will ever need to do.\n\nWorkload:\n2 exams, 14ps (she takes the best 10)\n"
        },
        {
            "course_name": "SIEO 4150 - Probability and Statistics",
            "review_date": "May 16, 2012",
            "review_content": "\nThis might potentially have been the worst class, with the worst professor, that I have ever taken not just in college, but in my academic career. While Professor Hueter is nice, and appears to care for her students, she is not only incompetent, but entirely unprepared and unqualified to teach this class. I went to the first few lectures of this class, and was not only blown away by how boring and unengaging they were, but also by their lack of content or presentation of new material. She presents the material straight from the textbook, with no new or interesting information, only the occasional application that appears to have no relevance to the course whatsoever (it is also the worst textbook I have ever used). \nShe uses some color coated system in her lectures that appears to have a pattern, but as I reviewed the slides over and over, I realized that there was no logical order to her lectures, and that they were merely COLORED. This example just about sums up her class. Trying to apply order, to something that is completely void or order, reason, or logic. She is a terrible lecturer, often appearing to not understand the questions herself, and she always seems wholly unprepared, as she solves many of the practice problems INCORRECTLY. At our review session for the midterm and final, she legitimately got half of the problems wrong...she didn't know how to do them herself, and for a teacher to an introductory statistics and probability class...INTRODUCTORY...I felt that this was unacceptable.\nHer accent was extremely hard to understand, and her explanations of subject matter or answering of questions often ended in a \"i don't know why the answer is this, but my sheet says it is this, so it is.\" I feel bad saying all of this because I know she is very nice and I am sure, very smart, but she is a terrible professor, and if you are hoping to really learn statistics and probability, I would not recommend this class.\nDon't get me wrong, it is a very easy class, as if you teach yourself everything from the book, you can do extremely well on the exams. The problem sets are all questions from the book, and you can of course, get the answers to those fairly easily. In comparison to other introductory statistics classes that i have heard about, this is much easier, but if you are really looking for a solid base understanding of the material, stay away from this class. You can get an A very easily (she says on first day of class that the mean is an A-), but you learn almost nothing, and will never go to her lectures because they are entirely useless. Easy but useless, take it at your own risk.\n\nWorkload:\n14 Psets (from book), Midterm, Final (cumulative)...midterm and final have 6 questions each, often resemble review problems that she gives you for each\n"
        },
        {
            "course_name": "SIEO 4150 - Probability and Statistics",
            "review_date": "April 18, 2011",
            "review_content": "\nAll that said, Prof. Hueter is very very generous and friendly. She would come to class and smile for every single lecture. Although I did not attend the classes most of the time (I do not mean Prof. Hueter is a bad lecturer.. I just prefer studying myself,) she would always upload any necessary materials for you to catch up! Lectures in pdf  (also separated in Chapters version available.) Homeworks with extra problems for you to get stronger and more confident (not graded, but solutions later provided.) This Spring, the text edition 9th was released, and a lot of students purchased 8th edition. She did not even force them to buy the expensive 9th edition, but rather, a set of scanned pages from 9th edition would be uploaded for you to work on HW problems! All that said, this class is not too hard (if Prof. Hueter is an instructor), even though you are not an engineer. All you need are just catching up with whatever are covered in classes, doing your HWs, and making your own cheat sheets. That's it. No extra effort or preparation for fancy exam problems required. After all, I like Prof. Hueter not because of her teaching style, but because of her true spirit as a college teacher--letting students decide whichever way they feel comfortable with studying, accompanied by her consistent support.\nWorkload:\n14 Homeworks, about 7 hours each (study + pSet.. remember you need to submit only 10 of them.)\nOne midterm.\nOne final.\n"
        },
        {
            "course_name": "SIEO 4150 - Probability and Statistics",
            "review_date": "May 29, 2010",
            "review_content": "\nFor the first several weeks of the course Prof. Hueter typed up notes and taught using the projector and I found it pretty confusing, but not any more than most technical classes taught this way.  However, after week 6 or so she stopped typing notes and started lecturing old school style using the blackboard.  I found the lectures to be much improved when she did things on the blackboard.  She is kind of awkward when she lectures, but she is EXTREMELY friendly in class and in office hours and is very generous with any help you need.\nThe review complaining about the lack of proofs is not representative of the attitude of most of the class.  When Hueter actually did a couple of really short proofs, most of the class started hyperventilating, \"OMG, ARE WE EXPECTED TO KNOW THOSE PROOFS ON THE EXAM?!?!\"  (I guess they forgot that they get a cheat sheet anyway even if we did?)  Still, she derived a lot of the formulas in lecture (at least when she was using the blackboard during the stats portion of the class) if that's what you're into.\nThe class was very late (7:40-8:55pm) and as such the class demographic was a real hodgepodge: 18 year old SEAS and comp sci undergrads, engineering grad students, MBA candidates from the business school, and a few middle aged guys in suits who looked like they just got of work at the Morgan Stanley trading desk.  And those were just the ones who showed up (I'd guess on a typical night there was 25-30% attendance.)  I showed up regularly to lecture and I liked the atmosphere of the class and mix of people (not too many whiny kids.)\nWorkload:\nI don't know how anyone can complain about the homework.  There were 7-12 problems from the book assigned every week, half of which have answers in the back of the book.  Honestly, you don't even need to know what you are doing when you do them, just look at the examples in the book that are similar to the problem and use whatever formula and method the example uses.  This has nothing to do with Hueter or the course, it's just the structure of the book (the book is meh.)  14 homeworks are assigned and she drops the lowest 4.  Let me repeat, she drops the lowest FOUR.  Homework counts for 30% of your grade.\nThere is one midterm worth 30% of your grade.  You get a one sided cheat sheet that you can put anything on.  The exam is straightforward, and graded fairly generously.  You can get a question wrong, but still get a lot of partial credit for using the right formula or just showing some semblance of knowing what the hell you were doing.  The average was very high.\nThe final is worth 40% of your grade.  It is \"cumulative\" but weighted more toward the later material.  Very similar to the midterm in format and you are allowed a two sided cheat sheet.  I imagine it was graded the same way as the midterm and I imagine the average was very high again since the level of difficultly was about the same.\nI really don't know how she determines the final grade.  She claimed that she \"has never curved\" - that there is a fixed score required for each letter grade and whatever your final weighted score is will determine your final grade according to each fixed score requirement.  However, she also said that the \"fixed\" score required for each grade could be \"adjusted at end according to the overall performance of the class.\"  I thought this was the definition of a curve.  Who knows; you shouldn't care about your grade anyway, just that you learn the material, right?\n"
        },
        {
            "course_name": "SIEO 4150 - Probability and Statistics",
            "review_date": "April 12, 2010",
            "review_content": "\nI strongly disagree with the previous review--if not in the specific facts, then certainly in the overall assessment.  YES, ABSOLUTELY take this course, because Prof. Hueter is one of the nicest professors you can imagine.  She is wonderfully generous with her time outside class and is one of the few faculty members who is actually excited about being with Columbia students.  The fact that she feels this way gives the class a delightful atmosphere.  Plus, she's an inspiring person with a compelling life story: http://www.agnesscott.edu/Lriddle/women/hueter.htm\nThe materials Prof. Hueter discusses in class are indeed in the textbook and are reviewed rather quickly, so class is most useful when you've already done the reading and some practice problems.  Most people don't come to class, do just fine and learn stats just fine.  The exams and homeworks are not too difficult, and the grading is generous.  My main criticism, if it could be called a criticism, is that the course is \"plug and chug\" and does not teach the proofs that would help us understand the concepts better.\nWorkload:\nNot bad at all--at least if you're an engineer.  Probably OK even if you're not.\n"
        },
        {
            "course_name": "SIEO 4150 - Probability and Statistics",
            "review_date": "May 13, 2009",
            "review_content": "\nIrene is new to Columbia, and as a full time statistician she devotes little time to her Intro to Prob & Stats course. That being said, I highly recommend that you do NOT take this class. Her lectures are awful, plan on learning absolutely nothing from her pitiful lectures, and learn everything from the book.  I regrettably went to every lecture this semester, and learned next to nothing. Literally about 6-7 people showed up for an 80 person class.  \nAt least she is approachable and nice. But going to her office hours is pointless too, because she hardly understands the material herself. I certainly left with more questions then I did going into her office hours. During the lectures, it seems like she's trying to prove to the class that she understands the material, so she'll photocopy the example problems straight from the textbook and rewrite the solution EXACTLY on the bored.  There is zero room for learning on the class's part and when students have questions, she doesn't have good explanations.  She doesn't understand that nobody in the class understands the material, but moves on to new topics regardless. What she really needs to do is spend some time preparing lectures, and explain equations and how they're used. Instead she just copies her \"notes\" straight to the blackboard and moves on.\nIf this course is required for your major, find another section.  Let me repeat, do NOT take this class, you will regret it.\nWorkload:\nWeekly homeworks come straight from the textbook, fairly challenging because it's all self-taught. Plan on spending at least a few hours on them.\n1 Midterm and 1 final - both difficult and unfairly graded, but you'll get a cheat sheet to bring in\n"
        }
    ]
}