{
    "prof_info": [
        {
            "prof_name": "Phillip Penix-Tadsen",
            "prof_id": 2728,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Hispanic Cultures II: Enlightenment to the Present",
            "review_date": "December 22, 2006",
            "review_content": "\nPhil is a great instructor and a really nice guy.  He is not an easy grader, but definitely gives out A's (if and when you deserve one).  He is a little stand-offish about absences, so don't register for this course if it is an inconvenient time.  His teaching style is a good mix of the Socratic method and introduction to the various facets of Hispanic cultures from 1500-2006.  Half of the class covers Spain, and the other half covers Latin-America (alternating weekly).  Likewise, it is mainly half History and half Arts.  Too much prior knowledge of the subject area is not necessary (I am not a major), but fluency in Spanish IS necessary, so don't register otherwise.\nWorkload:\nLight weekly readings, 2-page weekly assignments, 3 2-chapter tests.\n"
        },
        {
            "course_name": "Intermediate Spanish II",
            "review_date": "December 19, 2005",
            "review_content": "\nIf you can get Phill, you are definitely a lucky person. He is one of the sweetest Professors I have ever known, even if you get a question wrong in class, he will never outwardly embarass you, just nicely inform you of his own answer. He does not force you to speak, and therefore you learn how to speak not out of force but because you want to, and your spanish speaking skills definitely benefit. Even if a certain unit seemed difficult, he would present it so clearly that everything seemed to be easy to do. He is very approachable and available whenever you need him, before a test or just for review. His classes were always interesting with group in-class assignments, debates and discussions. A new addition to the Spanish and Portuguese department, Phill is a great, inspiring professor, and a really nice person!\nWorkload:\nHomework every night, very short usually about 5-10 minutes, quiz every other week, (very easy), four compositions about one page each a midterm and a final. \nBoth were a bit trickier than the work we did in class, but still doable. \n"
        }
    ]
}