{
    "prof_info": [
        {
            "prof_name": "Bhawani Venkataraman",
            "prof_id": 1353,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "General Chemistry I",
            "review_date": "December 25, 2003",
            "review_content": "\nClass is extremely boring.  Lectures move fast, b/c they are done through Powerpoint slides.  Don't expect to be able to write everything down by hand.  There are three midterms, which, in my opinion, got progressively harder.  To ensure that there are no surprises on the exams, make sure you go to class.  I've never had to approach her personally.  Overall, a decent, if dull, study of GChem which is not extremely difficult, but neither a complete walk in the park.  You're grades will reflect how much time you put into the class.\nOn the final:  very long, and expects you to extrapolate on a lot of basic concepts.  Not a regurgitation of basic facts, but rewards those who think more deeply\nWorkload:\n3 midterms 15% each, 1 final 55%No graded homework\n"
        },
        {
            "course_name": "F1403/1404",
            "review_date": "September 15, 2003",
            "review_content": "\nI'm glad it's over. It was more torturous than a year in prison with Saddam's bodyguards as cell mates. As dull as a sack of potatoes. Her overhead power point slide presentation, monotonous voice, and lack of humor combined for a truely hellish nightmare of a year.  But what is worse of all is that 55% of this ridiculous class is based on a final exam which you are not permitted to see for months after it has been administered. How fair is that? I took her final exam in May and was not allowed to view it till October. \nWorkload:\nNot bad although nothing will help you with final; it is random and 55% of your grade is based on it. Good Luck! Take another class.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "May 04, 2003",
            "review_content": "\nIf you have taken AP chem in high school this class will be a breeze for you.  Better yet, if you took the first semester of Gchem w/ fine or adams, it will be even easier.  I have not gone to class since the first midterm because the coursework all overlaps w/ gchems first semester.  My average is great and this class is definitley going to boost my GPA.  The exam problems are short answers and are exactly like the HW problems, unlike Fine where the exams are impossible theoretical multiple choice questions.  I didnt find teh teaching to be too bad, i actaully enjoyed the lectures that i went to.  But this may vary from studnet to student because I took AP chem in high school and got a 4 on the exam.  THe best thing though about this class has to be the fact that there is no recitation of chemwrite.\nWorkload:\n3 midterms, one final, NO CHEMWRITE OR RECITATION!\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "January 19, 2003",
            "review_content": "\nA very poor professor, she teaches solely with Microsoft Powerpoint which is a regurgitation of the textbook and makes the lessons seem even more unwieldy. Also, because of the fact that she uses Powerpoint, the lectures move extremely fast leaving little time to grasp the material and it is virtually impossible to take handwritten notes. Students must print the notes either in Powerpoint or HTML format from the website. She does not demonstrate a thorough understanding of Chemistry which is evident when students make inquiries about various topics and she is either unable to answer them. She claims that she is always around for help, and she is, but she does not adequately assist students when they show up to her office hours claiming that it is best for them to work through the problems on their own. This may have some truth, however, it is an impossibility for students to work through problems on their own when they have no clue about the material. There is no multiple choice on the tests and most of the problems on the test are very different from the homework problems in the textbook. In addition to being \"different,\" they are also much more involved. Sure, you may get partial credit but due to the high point value of many of the problems, partial credit helps minimally. Moreover, many of the problems require an understanding of Chemistry far beyond a General Chemistry course. It is very possible to encounter problems that require a very arcane thought process which is not only time consuming, but a skill that most do not have in the class. Furthermore, she has a pronounced accent and at times she can be difficult to understand. She is not sympathetic to problems/difficulties that people may have with the subject matter and she will grade harshly at the end of the semester. Although the tests are curved, many are not even close to the curve---which demonstrates a widespread inability of students to comprehend the material as she presents it. \nWorkload:\nA bit heavy if one attempts to do all of the homework. For each chapter, she assigns an average of 25 problems which are neither checked or graded. There are three midterms, each counting for 15% of the final grade, and a cumulative final exam which counts for 55% of one's total grade.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "December 15, 2002",
            "review_content": "\nNice alternative to Fine. The class is extremely boring, like you want to cry sitting through it, but she is a really sweet woman who wants you to understand.  The tests are pretty hard actually, and you really have to be willing to study, but they are not multiple choice and partial credit is given which makes it better than Fine's class. I would recommend this, however, it was difficult and you must be willing to invest a lot of time in learning the material in detail.\nWorkload:\n3 midterms, 1 final. Final is worth 55 percent of the grade which really sucks. Homework not collected, but needs to be done to do well in the class. lots of on your own work to learn the material, but this is expected in any gchem class.\n"
        }
    ]
}