{
    "prof_info": [
        {
            "prof_name": "Naofumi Tatsumi",
            "prof_id": 12676,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "First Year Japanese I",
            "review_date": "December 23, 2016",
            "review_content": "\nIf you spend a little time on this class each day there is no reason why this shouldn't be an easy A, I was told...by the professor. I thought to myself, sounds good to me, I am interested in learning Japanese and I am more than willing to put in the work every day to learn. Boy was that statement wrong. What it should have said was, \"If you have already taken multiple courses in Japanese, know all the Kanji, and have an exceptional talent for learning eastern languages, you will surely be just fine.\" That is quite a shame really, because this is touted as an introductory Japanese course for people that have little to know experience with any part of the Japanese language. \nI'm sure if you came into this class having a good grasp on the introductory parts of the Japanese language you would do just fine. By that I mean, you know your hiragana, katakana, some Kanji, and basic sentence structures and particle usage. However, if you know none of this you are in for a rude awakening. Having known only words like sushi, sashimi, and teriyaki, I wasn't exactly well versed in Japanese. So that simple work load each night was more like 2 - 4 hours a night, every single night just to keep up. Not to mention that you had to memorize a list of vocab and sentence structures for a quiz every single day at the start of class. After the first month or two the whole class was basically begging for the course load to slow down. We even let our professor know that we just couldn't keep up and we felt that our Japanese language learning was suffering because of it. By two months in, nothing slowed down, and it become quite evident that people were beginning to be overwhelmed. Constantly relying on the textbook in class just to remember basic words and sentence structures. Many people, my self included, saw a noticeable decline in the amount of time spent on other classes because of the time required for this class. Tatsumi-sensei, specifically stated that the Columbia Japanese department specifically tries to go 1.5 times faster than the average college. Why? Is there research stating that, that helps us learn? I'd venture to say not, but they seem to like that arbitrary rate of learning because, \"it's an elite college\". Great, elite college, that's fine and dandy but I would sure love to learn something. \nOverall, despite the class being completely at the whim of the department as a whole rather than tailored to the pace of each class, Tatsumi-sensei did his best. He is not a bad professor by any means, and really does care about his students. If you get a mid to low B on a test he will call you into his office to go over the test with you, which is nice, but also somewhat alarming the first time it happens. However, you better hope that you are an auditory learner because you will have little visual material to learn from and almost no time to take notes. However, as I said, if you are like the 80% of class that has already studied Japanese or knows a bunch of Kanji and similar languages, then you'll be fine. If that doesn't describe you, best of luck, you are going to need it!\nWorkload:\nQuiz Everyday\n3 Tests\n2 Midterms\n1 Final\n3 Compositions\nMany long homeworks\n"
        },
        {
            "course_name": "Elementary Japanese B",
            "review_date": "November 19, 2013",
            "review_content": "\nI found Tatsumi sensei's class very rewarding. He almost always speaks in Japanese during class. Lots of speaking practice in class: conversation or picture on the slides and the entire class or one person will read the conversation. Examples are usually standard, occasionally entertaining.\nWe had to make a blog with two journal-type entries and a fair bit of work on the katakana project. \nI found the katakana project tedious and not too useful. It consists of finding examples of katakana on ads, magazines, products etc and analyzing the katakana usage. We also have to make a literary work (manga, story or poems). It will take as much time as you want. \nWorkload:\nQuiz every class\n~45 min homework every class\n2 midterms\n1 final\nkatakana project (see above)\n"
        },
        {
            "course_name": "First Year Japanese",
            "review_date": "August 26, 2013",
            "review_content": "\nTatsumi-sensei is a new Japanese instructor at Columbia, and I had him for both semesters of 1st-Year Japanese, so if he is reading this, that will narrow it down to only two students...\nTatsumi-sensei is quite serious about the class and may come across as a little more stern than many of the other instructors at first, but he tends to make a lot of humorous gestures and jokes in class. He will answer any question about Japanese, no matter how off-topic or simple. And he is very quick in replying to e-mails and very open to classes during and after class. \nHe really wants his students to begin learning the language and continue into 2nd and hopefully 3rd-year Japanese and beyond. Eventually you will be looking forward to coming to Japanese class every day. \nThe first day of the course should tell you what kind of person he is (assuming he continues to give the \"surprise\" introduction every year to his first-year students, which I guess...is not really a surprise anymore if you are reading this before you take his class) and his general attitude on language acquisition.\nHe uses a powerpoint-style teaching style (as do the other instructors, I believe) and will ask pairs or groups to make conversation, something that that is very helpful especially when learning to speak a language (arguably the most difficult of the four main language skills). And he will call on you to talk in front of the class (in your chair) so if you are not prepared for class, the entire class will know! Do not think this is a bad thing, because it will help build your confidence over time.\nThe beginning is always a bit rough for everyone, unless you have taken Japanese elsewhere, but as long as you read the main yellow textbook, which has all the grammar and vocabulary you need (daily vocab. quizzes, but no grammar quizzes in the beginning), you should have little problems.\nJust make sure you don't fall behind on the vocabulary and grammar, but it should be apparent if your quiz scores aren't ideal or your in-class conversations are incoherent.\nWorkload:\nNot too much. You should be spending about 2 hours a day on average studying the next day's vocabulary, doing the homework assignment, and reviewing grammar (which should really not take longer than 10 minutes for most lessons)\nDaily quizzes (you can afford to miss a couple) that should be really simple. \nThe midterms are not too bad as long as you have been keeping up with the material consistently.\nHonestly, this class should be an easy A! \nI had no knowledge of Japanese before I took it (unless you count anime phrases...) and I got an A for both semesters without any stress at all. Just make sure you are not absent too many times, but even if you are, the material covered is straight from the textbook--you can just e-mail him or contact a classmate.  \n"
        }
    ]
}