{
    "prof_info": [
        {
            "prof_name": "Jack Snyder",
            "prof_id": 1208,
            "total_reviews": 24
        }
    ],
    "reviews": [
        {
            "course_name": "Nationalism and Contemporary World Politics",
            "review_date": "April 27, 2014",
            "review_content": "\nSo. \nProfessor Snyder has one of the most boring manners of speaking I've ever witnessed. I have an incredibly hard time following anything he says because each word is about 5 seconds after the previous word. He just talks all class and it's difficult to come out of the class and be able to say \"I learned X.\"\nThere was not one day that I was able to pay attention for more than 3 sentences at a time in class. Eventually, after spring break, I just stopped going. And I hardly read any of the assigned readings. \nHOWEVER. Snyder is prolific in his field. In writing my term paper for his Nationalism and Contemp. World Politics class, I probably read about 60 articles and 3 books, and Professor Snyder was cited in about 70% of the literature (and these were articles I found myself, he doesn't just assign things he's cited in). He is clearly a leader in the field of International Relations, which is great, esp if you decide to go to office hours. \nAdditionally, the mid-term, final, and obviously the term paper, are all take home. In the process of writing the exams, which are essays, and the term paper, I have learned SO MUCH. I spent about 3 weeks working on my term paper.  While I never went to class during that time, the process of researching, conferencing with my TAs, and having small group meetings with TAs and other students was incredibly interesting and educational. I have probably learned the most in this class, and I don't even go. Basically, you will get out of this class what you put into it. \nYou might not be able to pay attention in class, but if you are dedicated to the assignments, you can learn a lot. I can't even imagine what I would have learned if I actually paid attention and did the assigned readings before class. \nSide note, the TAs were great. The class is set up so that you have a lot of time and resources from the TAs and Snyder, so you don't feel lost. \nWorkload:\n2 take-home exams, three essay questions each. 25% each. one term paper, 50%\n"
        },
        {
            "course_name": "Introduction to Human Rights",
            "review_date": "December 11, 2013",
            "review_content": "\nWell..... to begin, DO NOT TAKE THIS CLASS WITH PROFESSOR SNYDER. I honestly don't know how to describe the horrendous teaching methods and non-engaging lectures that this man put me through. Every class, the attendance when down drastically. He cannot find a way to be engaging to save his life. I honestly was so saddened by this experience because, genuinely, the material should be extremely relevant and interesting, but Professor Snyder made me want to jump off a building. Seriously, torture would have been more enjoyable. His thought process makes no sense, and he goes on hour-long tangents that are incomprehensible. I can honestly say that I did not learn one thing from this lectures. Thank god the midterm and final were take-home, because you simply have to pick the readings that apply to the questions you choose. \nWorkload:\nTake home midterm and final, one 15 page term paper on a topic of your choosing, which can literally be on anything you want. \n"
        },
        {
            "course_name": "Nationalism and Contemporary World Politics",
            "review_date": "May 10, 2012",
            "review_content": "\nIf you're looking for a stimulating lecturer who discusses nationalism in the context of political events today, and who relevant case studies  through which we can better understand our world, then DO NOT take a class with Jack Snyder.  This man is the most boring lecturer I've had at Columbia so far.  His lectures are based around talking about writers' theories and little to no presentation of concrete evidence to back them up.  The class is easy, mind you, as you can pretty much talk about anything you want on the assignments that relates to nationalism, but is perhaps the most boring and anti-stimulating class you'll ever take at Columbia.  Trust me, its not worth it for the grade, b/c you'll listen to Snyder ramble on about theories and not once offer something concrete you can talk about.  He leaves it mostly to the readings, which are numerous and boring.  Though the subject \"Nationalism and Contemporary World Politics\" sounds interesting and stimulating, there is little to no substance you can't gain from reading a BBC or Al Jazeera article.  It's not worth it to take this class unless you desperately want an easy grade.  \nWorkload:\nOne Take Home Mid-term, one 10-15 page paper, and one in class final that's only 10%\n"
        },
        {
            "course_name": "International Politics Seminar: Political Development and International Relations",
            "review_date": "May 09, 2012",
            "review_content": "\nI took Snyder's seminar on Political Development and IR. Overall, I would say it was a decent class. Snyder is obviously a brilliant man and commands impressive name recognition. He really cares about his students and responds to e-mails almost immediately. He meets with every student in the class--twice-- to discuss their term papers.\nHowever, I would also say that the classroom experience was pretty hit or miss. On some days he would spend almost the entire class talking-- hardly what I wanted out of a seminar. Other days we will be engaged the entire class. It seems like towards the end of the semester he realized that the students wanted to participate more and started asking questions.\nThe syllabus was kind of all over the place. I can't really say that I learned a ton of new things only because the knowledge that I acquired through this class seems a bit incoherent.\nSummary: Definitely a good call. The classroom experience just wasn't as dynamic as I had hoped. Although he may be a bit awkward at first, Jack Snyder is a kind a brilliant man who cares about his students and, as a student of international politics at Columbia, you should definitely give one of his classes a chance.\nWorkload:\nOne 25-page term paper on almost anything you want. That's the entire grade.\n"
        },
        {
            "course_name": "Power and Progress in International Relations",
            "review_date": "January 05, 2012",
            "review_content": "\nThis was a pretty good class, I suppose. It serves as a logical extension/continuation of an introductory International Politics class, and is definitely a good class to take if you are a political science major who intends on international relations being one of your major subfields. Professor Snyder is a decent lecturer - he speaks slowly and clearly but also very eloquently, making the lecture relatively easy to follow along with, and making note-taking very easy, despite the fact that it was an early morning class. I also appreciated that despite the fact that Professor Snyder is clearly very accomplished in his field, he was always very receptive to comments and opinions expressed in his class, even when students sometimes interrupted him in the middle of his lecture. His lectures were also always very interesting (even if they did sometimes go unnecessarily in depth into more trivial details). \nContent-wise, the course was also pretty interesting, divided up into different themes weekly (e.g. human rights and transitional justice, international institutions, global economy). Perhaps one complaint I have is that Prof Snyder sometimes tends to over-extend his expositions on introducing the various subjects, to the extent that it feels that the crux of the lecture sometimes only begins close to the end of the class. We were also falling behind in the later part of the semester, and therefore had the lecture on China's rise in the international system (one of the more interesting themes, in my opinion) cut down to only 20 minutes. \nOne thing I really appreciated about this class, though, is that the readings were absolutely manageable for a political science class, and divided into required readings and supplementary readings - a huge plus that doesn't exist in other political science class syllabuses, as anyone who has taken Jervis' Intro to International Politics class can certainly attest to. That helped to cut down on the readings we had to do on a weekly basis, and gave us less stress when we had to study for the final, while also giving us additional options for further reading at the same time if we were interested in any given subject. \nWorkload-wise, this class was fine. Aside from weekly readings, we had a take-home midterm (comprising two 5-page essays), an in-class final exam, a 15-page research paper worth 50% of the grade, and discussion sections every other week. One slight gripe I had regarding this was that with only one huge paper to work on throughout the semester, with a topic of my own choosing, I wasn't really actively working on this class the way I would any other poli sci class, and therefore wasn't really learning as much - though this is probably a subjective sentiment. Kate, the TA I worked more closely with, was great - she was competent and really intelligent, and always really helpful whenever I had questions. She was also very adept at holding discussion sections. \nWorkload:\nTake-home midterm (comprising two 5-page essays, worth 20%), in-class final exam (one essay, worth 20%), one 15-page research paper (worth 50%), participation and attendance in discussion sections (worth 10%).\n"
        },
        {
            "course_name": "Conflict and Cooperation In World Politics",
            "review_date": "January 24, 2011",
            "review_content": "\nI had jack snyder for fall 2010. He is a really friendly and nice guy while also being very accomplished in his field. The man is highly approachable and accessible. Do feel free to drop by during his office hours. Every semester, he conducts a dinner session at his house where he invites around 12 students and the TAs to sit back and talk casually. It is a great chance to see another side of your professor and it also illustrates that he cares about his students and wants to know them better.\nRegarding class, he can be very boring and too nice a person; especially when he makes clear efforts to save students who asks weird and ridiculous questions from embarassment by desperately trying to quote from some random political scientist which he has read before and says that their point is in line with theirs.\nThere is a harsh load of readings but you do not have to do all of them. The mid term requires u to do 2 essays and the final is an in-class 1hr essay; both of which you have the liberty to choose out of maybe 7 questions, which ones u want to do. So basically just focus on one week's readings carefully and pick that question/theme on the mid term or final and u will do fine. There is a 15 page massive research paper that you have to either discuss with him or with your TAs.\nWorkload:\ntake home mid term. 15 page research paper- topic of your choice. in-class final.\n"
        },
        {
            "course_name": "Conflict and Cooperation In World Politics",
            "review_date": "January 24, 2011",
            "review_content": "\nI had jack snyder for fall 2010. He is a really friendly and nice guy while also being very accomplished in his field. The man is highly approachable and accessible. Do feel free to drop by during his office hours. Every semester, he conducts a dinner session at his house where he invites around 12 students and the TAs to sit back and talk casually. It is a great chance to see another side of your professor and it also illustrates that he cares about his students and wants to know them better.\nRegarding class, he can be very boring and too nice a person; especially when he makes clear efforts to save students who asks weird and ridiculous questions from embarassment by desperately trying to quote from some random political scientist which he has read before and says that their point is in line with theirs.\nThere is a harsh load of readings but you do not have to do all of them. The mid term requires u to do 2 essays and the final is an in-class 1hr essay; both of which you have the liberty to choose out of maybe 7 questions, which ones u want to do. So basically just focus on one week's readings carefully and pick that question/theme on the mid term or final and u will do fine. There is a 15 page massive research paper that you have to either discuss with him or with your TAs.\nWorkload:\ntake home mid term. 15 page research paper- topic of your choice. in-class final.\n"
        },
        {
            "course_name": "Nationalism and Contemporary World Politics",
            "review_date": "May 15, 2007",
            "review_content": "\nI have really mixed feelings about this class.  I took it so I could learn more about nationalism & how it operates in conflicts today.  I did not learn anything like that.  The class is totally theoretical & Snyder is probably one of the most boring lecturers ever.\nHowever, you only need to come to class if at all before the midterm.  The midterm is 2 5 page essays based on the readings, worth 30% of the grade.  It is also due back 5 days after it is handed out.   The final is a really annoying  one essay on the last day of class that is worth only 10% of your grade.  Class & the mandatory discussion section occur only sporadically in the second half of the semester as most of the time is given for you to focus on a 15 page research paper worth 50% of the grade (The other 10% comes from participation).  This is where Snyder is really at his best.  He divides the class between himself & the TA & holds two meetings with you in small groups to discuss the paper.  Snyder really reads through the proposals & drafts & provides useful & in-depth criticism.  His guidance definitely helped me write one of the best papers of my undergraduate career thus far.  The grading tends to be fair but a little lower than expected.  In addition to Snyder, the TA, & a grading assistant graded.  The grading assistant was definitely the harshest.  \nWorkload:\nan average amount of reading for a pol sci class (Do as much as you can for the midterm; pick only 1 or 2 sets to be familiar with for the final)\ntake home midterm: 2 5-page essays (a lot of work)\nfinal exam: 1 essay from a large number of choices on the last day of class\n15 page research paper (w/mandatory proposal & draft)\n"
        },
        {
            "course_name": "International Politics Seminar: Contemporary Issues in Int'l Security",
            "review_date": "January 08, 2007",
            "review_content": "\nI really enjoyed Professor Snyder's seminar.  He is extremely well-known and respected in his field, and because the material discussed in the seminar was about \"contemporary\" security issues, it was exciting to hear Professor Snyder weigh in on current events.  Although discussion could sometimes get boring, the readings were always interesting.  Also, Professor Snyder is a very nice man and is always willing to meet you outside of class.  He also responds promptly to emails.  He is also very hands-on when it comes to writing the paper, which can be an overwhelming task.  He schedules mandatory meetings to go over outlines and planning, and is very helpful about getting ideas out on the table and setting up a conceptual framework for your paper.  \nWorkload:\nPretty heavy reading, but certainly not all required--it's a seminar so you don't need to know everything, just know enough to make a comment in class.  One final paper, around 25 pages.  Standard seminar stuff.\n"
        },
        {
            "course_name": "Nationalism and Contemporary World Politics",
            "review_date": "May 17, 2006",
            "review_content": "\nProfessor Snyder is one of the most intelligent, learned men I have ever met. He is also truly committed to his students. If you reach out to him for help, he will make himself available in any way possible. I needed a book for my final paper for his class that was checked out of the library, so he responded approximately 5 minutes after I emailed him, at 10:30 at night, asking one of his Ph.D candidates if she could lend me her copy. He also met with me several times to review drafts, and to give me additional guidance. \nThat being said, this man's lectures could put a horny rhinoceros to sleep, however, the class is designed so that going to lecture isn't necessary to get an A. To do well in this class: go to section, do as many of the readings as you have time for before section, and before the midterm, and WRITE YOUR PAPER ON SCHEDULE. The participation grade for the class is based on optional section attendance, and also on whether or not you come prepared to the two meetings for proposal and draft before the paper is due. Snyder does not do this for fun, or to torture you, or because he thinks it is worth his while. The meetings are designed to help you write a better paper that's worth 60% of your grade (50% grade + 10% participation). Bottom line: do the readings, go to section, and write the paper on schedule, you're guaranteed a good grade.\nWorkload:\nparticipation: 10% STUPID final: 10% Midterm: 30% (two, five-page very topic-specific essays) Paper: 50% - a lot of work, but fun if you don't rush it\n"
        },
        {
            "course_name": "Nationalism and Contemporary World Politics",
            "review_date": "May 16, 2005",
            "review_content": "\nJack Snyder is a reknowned expert on nationalism and ethnic conflict, but unlike Jervis he is NOT an inept teacher.  Snyder actually IS likeable and responsive to questions, whether in class, after class, or by email.  He tends to be extremely boring on the second class of a given subtopic (they almost always come in pairs), so sometimes it's better to not go to those classes.  I still would recommend taking his class.\nWorkload:\n1 take-home midterm (2 essays, 10 pages total); 1 in-class final (only worth 10%); and a 15-page research paper (worth 50%!!).  He and the two TAs split up the grading so that everyone in the class has something graded by one of them.  The male TA is a bitch when it comes to grading, while Jessica and Snyder do a fair job.  Lots of reading, but after the mid-term you can pick-and-choose what's relevant to your final paper.\n"
        },
        {
            "course_name": "Nationalism and Contemporary World Politics",
            "review_date": "January 02, 2005",
            "review_content": "\nI wanted to be a Political Science major until I took this class.  Now, exactly how much responsibility Jack Snyder bears for this decision is unclear.  He certainly isn't captivating, and I ended up falling asleep constantly.  When I stayed awake, I don't remember feeling fulfilled.  When not on the podium, Snyder himself is a fairly friendly, as well as exceedingly smart, guy.  The material was summed up by a previous reader:  lots of theories, all wrong, see the countertheories.  A waste of time in general.  \nWorkload:\nLots of reading, 15 page paper, take home midterm.  Grading is a little tough but not unfair.\n"
        },
        {
            "course_name": "Nationalism and Contemporary World Politics",
            "review_date": "April 26, 2004",
            "review_content": "\nI like Snyder a lot, he's very interesting, well read, has a lot to say about the different theories presented about why nationalism arose and how to downplay its effects.  Plus he takes the time to help you with writing the big term paper (although he can really bite into you if you aren't prepared) and he always responded to my emails within 24 hours. \nThat said, you won't come out of this course with anything more than some political-science jargon about different ethnic arrangements and what not.  None of the theories are really correct because there's tons of counterarguments to them and case studies don't really prove anything.  Good teacher, but the class was just a big question mark in terms of what you learned and what the solutions to nationalism are.  If you're a hardcore identifyer with an ethnic group, or any group for that matter, maybe this course is interesting, but I have to give it a thumbs down.  \nWorkload:\nNot overwhelming, but still too much reading, 10 pg. midterm, 1 hour final, 15 pg. term paper\n"
        },
        {
            "course_name": "Nationalism and Contemporary World Politics",
            "review_date": "September 06, 2003",
            "review_content": "\nAgreed, this class is the most boring class in existence (just get the notes....shhh).\nHowever, for anyone who wants to know who to write a polisci paper, this class is a must.  Mandatory meetings with extremely helpful TAs are a great learning experience for poli sci paper writing.\nWorkload:\nout of control hugongous amounts of reading. take home midterm, final paper, final.\n"
        },
        {
            "course_name": "Nationalism and Contemporary World Politics",
            "review_date": "September 02, 2003",
            "review_content": "\nI love Jack Snyder like I love \"Queer Eye for the Straight Guy.\" I like him like Johnny Depp in \"Pirates of the Caribbean.\" He's funny, he's intelligent, he's humble, and he's an awesome guy to talk to after class. Don't mind the extra work, you'll be happy do it.\nWorkload:\nA little over average, but it's totally doable, and he's totally understanding. And he's a handsome man.\n"
        },
        {
            "course_name": "Nationalism and Contemporary World Politics",
            "review_date": "June 14, 2003",
            "review_content": "\nThere have been lots of conflicting reviews of Snyder and I honestly don't know how I feel about him either.  He clearly is a very intellegent man who does in fact have a sense of a humor.  In fact, once when he was trying to figure out how to turn on the microphone he muttered under his breath \"what is this, a f*cking spaceship?\" which really amused me since he seems rather unemotional in his lecture.  If you watch carefully though he really does get excited over certain areas.\nOne word of advice, I would not take this class until you are really going to committ yourself to do the readings and attend lecture.  I personally could not manage the reading and I feel like I missed out on a lot, although I did attend most lectures and did gain something from that.  I would advise this class only to students who have a firm grasp on political science and not those who just want to get a feel for the department.\nWorkload:\nLots and lots of reading each week.  A relatively easy take home midterm.  15 page paper with mandatory drafts and an in class final.\n"
        },
        {
            "course_name": "Nationalism and Contemporary World Politics",
            "review_date": "June 04, 2003",
            "review_content": "\nI really disagree with the negative reviews of Snyder. Yes he has a monotone voice, and maybe it could keep you away from his class - but that would be a big mistake. Snyder is brilliant, interesting, he does a fine job of blending theory with case studies, and YES he is even funny in his own subtle way. I recommend this class.\n"
        },
        {
            "course_name": "Nationalism and Contemporary World Politics",
            "review_date": "June 01, 2003",
            "review_content": "\nI do not know who wrote the last two reviews, but I can basically bet that he had someone do them for him.  Fact of the matter is, Snyder might be a respectable scholar, but he's a horrible teacher.\nNo, he is not funny, witty or whatever else was written--he is plainly and bluntly a bore, a professor who has gotten so arrogant on tenure that it is a pain to sit in his class.  Don't believe me, see for yourself.  I dare you to sit through a class without dozing off.  I personally had to drink one to two coffees a class just to stay awake.\nDo yourself a favor--buy his book for less than $20 and save yourself the close to $3000 for the class. It's a shame that tenure rules keep bad teachers teaching.\nWorkload:\nRidiculous.  Hhe not provide a reader, but he requires you read on average four articles per class, articles you have to fight for at the library for.\nWhen it comes to your grade, do not think your work really matters.  I've seen some people do shit, basically copy from his book, and get great grades, while original thought gets poor ones.  Just do not take this class--it's that simple.\n"
        },
        {
            "course_name": "Nationalism and Contemporary World Politics",
            "review_date": "May 24, 2003",
            "review_content": "\nI would not recomend this course.  It is too theoretical, and the theories would be intuitive if we looked at enough case studies to come up with our own answers. He asks good questions, is knowledgable, but he proposes answers to so-called puzzles. Students hardly know enough to propose their own answers, and there are no theoretical solutions to such problems. I would say,after the class, i have no greater understanding of history or the way the world works than i did before, minus a few interesting questions presented in the syllabus.\n"
        },
        {
            "course_name": "Nationalism and Contemporary World Politics",
            "review_date": "May 11, 2003",
            "review_content": "\nSnyder does have a monotone voice and is an extremely boring lecturer.  The readings tended to be pretty repetitive and dry, making the lectures pretty painful.  However, if you do finish the majority of the readings, you get a small feeling of accomplishment and a sense that you may have learned something-- not ideal, but less of a waste of time than it first seemed.  The majority of your grade is based on participation in your paper discussions and the paper itself, so that's pretty much all you have to worry about anyway.  Not a recommended class or professor, but you could do worse. \nWorkload:\n15 pg paper, in-class final, take-home midterm\n"
        },
        {
            "course_name": "Nationalism and Contemporary World Politics",
            "review_date": "May 10, 2003",
            "review_content": "\nNice guy, extremely intelligent, lots of good insight (in his book, not so much in class), too bad his lectures are boring and his voice is rather monotone.  The syllabus is fantastic and the readings are really interesting and pertinent to international relations.  It does change the way you look at world affairs, but only because of the articles and not from the professor.  Most people just skipped the lectures and read the articles/attended optional weekly sections.  \nWorkload:\none 15 pg term paper on a topic you choose (definitely the focus of the entire semester, small group meetings to go over topic and draft), 10 pg. midterm, in class exam \n"
        },
        {
            "course_name": "Nationalism and Contemporary World Politics",
            "review_date": "April 17, 2003",
            "review_content": "\nIf you want to learn something about modern nationalism don't take this class. This has to be one of the most boring polisci courses I have taken to date. Snyder speaks only in monotone about the Hutus and the Tutsies....who cares!! If you are looking for a good course with a good prof, this ISNT it\nWorkload:\ntake home midterm, final, final paper and participation grade\n"
        },
        {
            "course_name": "Nationalism and Contemporary World Politics",
            "review_date": "September 09, 2002",
            "review_content": "\nEven though it seems that Snyder wrote the preceding review, he's still an amazing guy. He's a tad Woody Allen, but a brilliant professor and genuinely nice. His thematic breakdown of the class is perfect. This is the kind of course that changes the way you read the newspaper. \nWorkload:\nNot bad at all. Easy grader too. \n"
        },
        {
            "course_name": "Nationalism and Contemporary World Politics",
            "review_date": "September 07, 2002",
            "review_content": "\nProf. Snyder is SOOOO funny! Not only that, but his class was fabulous! I learned more about the horrors of nationalism in one semester than I ever thought possible, and I laughed the whole way through! What a riot that Snyder is. \nWorkload:\nNot too shabby! \n"
        }
    ]
}