{
    "prof_info": [
        {
            "prof_name": "Sandra Genter",
            "prof_id": 920,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Applied Anatomy",
            "review_date": "April 29, 2005",
            "review_content": "\nOverall, I would highly recommend this class, as knowledge of human anatomy is crucial to improving dance technique.  The readings aren't very difficult and are truly interesting, but the class itself is a little boring.  Prof. Genter means well and is certainly interested in the material, but she hasn't quite figured out how to make her lectures engaging.  She is perhaps a little 'old-fashioned' in her style and sometimes awkward, but generally a nice person.  Occasionally she seems to lack the knowledge to properly address your question.  The course gets more interesting near the end, when you start to apply the information learned to your body and your dance technique.\nWorkload:\nUp to 40 pgs. of reading in the main text (mostly pictures), some optional coloring each week. A final 'research paper' in which you will investigate some aspect of human movement or your own body.\n"
        },
        {
            "course_name": "Kinesiology",
            "review_date": "December 15, 2003",
            "review_content": "\nThis was a very frustrating class.  Professor Genter has an old-school quality to her that makes you not want to ask questions.  She does a pretty good job at making you feel stupid if you DO ask one and she doesn't like it, or if you give a wrong answer.  If you give one wrong answer, she assumes you haven't done any of the reading and gets pissed.  Her requirements are beyond unclear.  Her study guide for the final looked like a copy of the syllabus--no help there.  The lectures are really only helpful when we do mat work, otherwise, they are equally unorganized and you are better off just memorizing the book (which is what she wants you to do).  Sometimes, she is very nice and very interested in her students and will even laugh and smile at you and be supportive.  Otherwise, this class was extremely aggrivating.  I'd say at least a third of the class failed or came close to failing the mid-term, as well, because she is unable to specify what she really wants you to study and learn.  I did learn a lot in this course, but that came mostly from the just doing the reading.  \nWorkload:\none mid-term, a final that covers the entire semester, one research project (5-7page paper on topic of your choice), an in class presentation.  Regular reading assignments.  Map work in-class.\n"
        },
        {
            "course_name": "Images of the Body (FYS)",
            "review_date": "February 25, 2003",
            "review_content": "\nThis was ridiculous. That's about all I can say. She is a dance teacher, first and foremost. There is NO way she should have been teaching this class.  There were a couple of papers, but honestly, I think that the grades were arbitrarily placed on each one... who knows if she actually read then. Take a dance class from her, but unless you want to hit your head against the table EVERY DAY, don't take this course.\nWorkload:\nWhat workload?\n"
        },
        {
            "course_name": "Dance in New York City",
            "review_date": "May 06, 2002",
            "review_content": "\nArright, Avoid this class at all costs. I mean seriously. Don't get me wrong. Prof. Genter is a nice person. She smiles at you sometimes and she's even approachable outside of class. It's just that she's really strict. Like witness her comment on my recent paper: My paper: \"And the dancers were wearing bright red suits for the second act.\" Prof. Genter (in big red letters): \"The dancers were wearing MAGENTA.\" I kid you not. Also, she gets upset if you chew gum in class. Also, this is DANCE and it's supposed to be a fluff class but I found myself going to Butler to research my papers---not cool. \nWorkload:\nWAY too much for, yes, that's right, DANCE.\n"
        },
        {
            "course_name": "Dance in NYC",
            "review_date": "April 02, 2002",
            "review_content": "\nAn exteremely arrogant person who talks about her \"quite fascinating\" encounters with well-known choreographers. She thinks that everyone is supposed to perceive dance from her point of view. Definitely not what i had expected from this class. If you want to take this class take it with some other professor! Her paper assignments are ambiguous but not hard. She has her favorites in the class. If you want to voice your opinion about dance and be appreciated for what you believe, then you should definetely look into taking this class with someone more personable. Unfair grader, because she wants you to write 'flowery' like, just the way she wants it!\nWorkload:\n4 papers (3-5pgs) and take home final\n"
        },
        {
            "course_name": "First-Year English",
            "review_date": "January 20, 2002",
            "review_content": "\nOk, Profesor Genter is a DANCE  instructor. What made her think that  she can teach English baffles me.  She can't even speak English  (honestly we had to finish her  sentences for her). Her grading is  unfair and the class is extremely  uninteresting. She should not, and I  stress not, be teaching this course.  Do not take any course that she  teaches unless it involves twirling  your body around.\nWorkload:\nRelatively easy.\n"
        }
    ]
}