{
    "prof_info": [
        {
            "prof_name": "Vesna Kuiken",
            "prof_id": 12570,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "January 09, 2014",
            "review_content": "\nI think with two years of experience under her belt, Vesna has become one of the finest teachers in the Lit Hum department. Not only does she have a vast and in depth understanding of the texts, but her analyses have a refreshing and provoking punch. Furthermore, she's HILARIOUS. When we got off-topic (and by off-topic, I mean relevant but not exactly about the text), our class learned some pretty crazy stuff about her life. For example, she used to smoke a lot as a teenager, stayed with a Mormon host family as an exchange student from Serbia, makes politically incorrect jokes that had our class in stitches, etc. \nYou don't always have to do the readings, nor do you have to participate in every class discussion, to get a B+ or an A-. Her first essay is graded harsher than the second, which most people aced. By the midterm and final, you should have read all the texts sans the History of the Peloponnesian War and the Histories because they're tedious and unnecessary. Her review session encompassed a broad outline of what we needed to know for the midterm/final. Additionally, we have this fun presentation that counts for 10% of the grade: basically on music/books/art/movies related to the assigned text. HINT: Vesna is a huge movie buff so she loves that shit. Also had 2 easy discussion posts that aided most students, quite a bit, for essays. If you study decently and take efficient class notes, you can definitely come out of the class with an A and Vesna's love. \nShe definitely deserves a silver nugget for this course. Our entire class was pretty obsessed with her.\n\nWorkload:\n2 discussion posts that take about 15-30 mins to write. 1 fun presentation. 2 essays. 1 midterm/final.  \n"
        },
        {
            "course_name": "Masterpieces of Western Literature and Philosophy (Literature Humanities)",
            "review_date": "December 27, 2012",
            "review_content": "\nShe has got to be the worst lit hum teacher ever. Her \"discussions\" often consisted of her lecturing us and being really boring. Not only that, but she's also a terrible grader. She grades so harshly and her comments don't even make any sense. In fact, they hardly give any justification for why you received such a poor grade. \nNot only is she a terrible teacher, but she is also a terrible human being. She decided it would be a good idea to change the format of the midterm the day of the midterm. In fact, she didn't tell us about the change until she handed the midterm out to us. I'm sure that was a great idea professor.\nOverall, worst teacher/class ever, got a B+ though.\nWorkload:\nmidterm, final , and 2 papers all unfairly graded imh,o\n"
        }
    ]
}