{
    "prof_info": [
        {
            "prof_name": "Michael Taussig",
            "prof_id": 16,
            "total_reviews": 33
        }
    ],
    "reviews": [
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "January 12, 2015",
            "review_content": "\nTaussig is bat-sh*t crazy, but it is not hard to get an A. He did indigenous dances, described in detail what it's like to trip on acid in the Amazon, and spoke at length that he believed our classroom was haunted (we consequently moved classrooms multiple times). I had Fernando as my TA, and the grading was relatively generous if you were decent at talking out of your a**. A few unbelievably pretentious hipsters ran the course and were thoroughly beloved by Taussig, almost to an inappropriate level. Overall, a hilarious lesson when a famous drug-addled anthropologist gets tenure at Columbia. \nWorkload:\nA lot of reading, but you don't really have to do much of it. About 5 papers + 1 ethnography that is semester-long and turned in at the end. No exams\n"
        },
        {
            "course_name": "Advanced Underwater Weaving: Making Baskets Fit For A Sea-King",
            "review_date": "June 11, 2012",
            "review_content": "\nMost difficult class I've taken at Columbia. However, Prof Taussig will give you back as much as you put into the course. The readings, discussions, and test demonstrations are intense (no oxygen tanks or snorkling masks allowed, only reeds) but well worth it! I had particular difficulty in the \"natural materials\" challenge. Hudson seaweed just isn't made for asymmetrical, post-modern baskets! However, this course reaffirmed my decision to major in Underwater BW. I know that this class will remain with me throughout my education and career as the fundamental foundation of my very being and intellectual reasoning system. \nSome people might call Underwater BW a \"joke major\" do not be disheartened by this! This is one of the most challenging majors at Columbia-- both mentally and physically! It combines environmental science, physics, chemistry, political science (negotiating with merpeople), and others! However, I would suggest that you begin breath holding/pressure/ oxygen absorption training ASAP over the summer as the high amounts of Pollution in the Hudson make it particularly difficult to absorb oxygen into your skin while weaving. \nWorkload:\nAT LEAST 2 coiled, plaiting, twining, AND split baskets by the end of the year, each created underwater without breaks in less than 10 minutes\nFor the final, one of these baskets must be made out of a material found in the Hudson-- I thought that Prof Taussig meant a natural item and used seaweed--what a mistake! Some other kid found an old tire and used that instead! He even got extra credit for recycling and using a lasting material. Whatever. If I'd known that that was allowed, I would've done it too.\n"
        },
        {
            "course_name": "Advanced Underwater Weaving: Making Baskets Fit For A Sea-King",
            "review_date": "July 22, 2011",
            "review_content": "\nUniversity is about transformation and in my opinion radicalizing the youth away from their ideologically paralyzed bourgeois commodified spectacularized work-ethic life. Down that line all you get is SEPARATION PERFECTED. We need more poet-philosopher-professors, what did Blake say? Improvement makes strait roads, but the crooked roads without Improvement, are roads of Genius. It depends on what youÂ´re looking for, what your orientation is, or more likely what youÂ´ve unquestioningly consumed from infancy and perpetuate compulsively. Im not innocent of this critical consciousness. WE LIVE IN AN ASPHYXIATING CULTURE. What are the secrets for changing life? You must change your life. What do you think estrangement is all about? Of course this is not for everybody, though i wish it were. ItÂ´d be an other world. \nWorkload:\nITS COLLEGE... FOR HELLS SAKE!!! READ AND DISCOVER THE LIGHT-BRINGER LUCIFER !!! THE REBEL AND PERFECT LOVER. \n"
        },
        {
            "course_name": "Taboo and Transgression",
            "review_date": "April 28, 2011",
            "review_content": "\nThe class was run by a few pretentious hipsters who fundamentally said nothing. \nThis course was an exercise in entertainment, excitement, and an exploration of our petty fetishes. We did not discuss taboo. We did not discuss genocide, poverty, oppression, murder, sex slavery --- real tabbos. Instead, we fixated on sex, feces and, lest I forget since it was so forgettable, some girl played a movie of her pulling her tampon out. That was her final project. EVERYONE APPLAUDED. I don't know why. \nI barely went. I found it infuriating. I was not called on once even though I raised my hand. My emails were not responded to. The class was a profound waste of money and time.\nThe last class involved rolling on the floor while listening to experimental \"music.\" \nso.lame.\nWorkload:\nwhatever. i got an A. so can you.\n"
        },
        {
            "course_name": "Taboo and Transgression",
            "review_date": "January 17, 2011",
            "review_content": "\nHe is absolutely the worst professor at Columbia. He SHOULD NOT be allowed to teach, not that his classes remotely resemble teaching. Taussig rambles on for hours without ever saying anything, continuously reminding his students of his overrated achievements. His class consisted primarily of his writings, and his horribly written narratives, as he vomits up new \"coined\" phrases that make little to no sense. It was an immense waste of money, and time. I rarely went to class, and assignments were almost never posted, yet I still managed to slide away with an A. Big Joke-- the prof, and the class. His ideas are as old and deflated as he is. I would not recommend Taussig's class TO ANYONE. Unless you enjoy endless hours of intellectual masturbation, hideous purple suits, and the never-ending array of Taussig's pathetic attributes, STAY AWAY. \nWorkload:\nTONS of reading that I could hardly afford, and most of the books were not even necessary. papers, and final project. the workload wasn't the issue. The horrible professor was. \n"
        },
        {
            "course_name": "Taboo and Transgression",
            "review_date": "January 17, 2011",
            "review_content": "\nHe is absolutely the worst professor at Columbia. He SHOULD NOT be allowed to teach, not that his classes remotely resemble teaching. Taussig rambles on for hours without ever saying anything, continuously reminding his students of his overrated achievements. His class consisted primarily of his writings, and his horribly written narratives, as he vomits up new \"coined\" phrases that make little to no sense. It was an immense waste of money, and time. I rarely went to class, and assignments were almost never posted, yet I still managed to slide away with an A. Big Joke-- the prof, and the class. His ideas are as old and deflated as he is. I would not recommend Taussig's class TO ANYONE. Unless you enjoy endless hours of intellectual masturbation, hideous purple suits, and the never-ending array of Taussig's pathetic attributes, STAY AWAY. \nWorkload:\nTONS of reading that I could hardly afford, and most of the books were not even necessary. papers, and final project. the workload wasn't the issue. The horrible professor was. \n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "January 09, 2006",
            "review_content": "\nFirst of all, I'll start out by saying that both the positive and negative reviews are \"right\" in a sense.\nYes, the man rambles. If he sets a class agenda for the day, he never finishes discussing all that he sets out to. \nThat said, you will read many of the fundamental texts of anthropology (Mauss, Malinowski, etc) and many interesting, but certainly off-beat texts (such as his own books, and others of his choosing such as Toward an Anarchist Theory of Anthropology).\nPersonally, I find his ramblings super-interesting. He is certainly not the kind of guy who lectures according to power-point presentation bullet points. If that's how you learn best, avoid this class. If bullet-point lecturing makes you want to kill yourself, you'll probably love Taussig; he's a storyteller. \nHe has lived on-and-off in Colombia (the country, not Columbia) since the 60's, and his specialty is looking at what the pervasive violence that both the successive governments and the FARC have wrought on the people. \nHe also knows loads about the cross-roads between indigenous, afro-colombian and Spanish cultures and talks a lot about their mingling. So if you are interested in anthropology and Latin America, Taussig is also a good bet. He loves students, so if these subjects, or approaches to anthropology interest you, feel free to drop by his office for a chat. \nWorkload:\nNo midterm, no final. However, you need to write a 5 page paper every other week or so (amounting to about 6 total) which are graded by TAs. I've heard these range from fantastic to awful, so do some scouting before signing up. \nIf paper-writing is not your thing, you can also submit art-projects (projects have ranged from sculpture to music-video) instead.\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "January 07, 2006",
            "review_content": "\nThis is a VERY easy class if you know how to bs your way through papers, and possess the skills to charm your TA. Just assimilate the post-modern lexicon from a few choice readings, and remember: There is NO such thing as Truth. Don't expect to learn anything about the science of Anthropology: it's no longer a science. (That's why the EEEB department was created.)\nPast reviewers are right, you don't have to go to lectures to get an A, but if you are thinking about experimenting with drugs, perhaps seeing Taussig once a week will deter you.\nWorkload:\nThat's not the point.\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "December 18, 2005",
            "review_content": "\nA wonderful class taught by a wonderful professor.  As other reviewers have said, this course is not a review of \"anthropology\" - but an introduction to actually studying anthropology. I guess you could call it \"meta-anthropology.\" My only qualm - the lectures took a dive in the middle of the semester, but Taussig is still brilliant.  If you get to read any of the full books on the syllabus, make sure you read the ones he himself wrote.  They're awesome.\nWorkload:\nlots of reading, get to what you can.  papers biweekly or so, the grading depends on your ta but all in all the grading seemed to be fair.\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "December 17, 2005",
            "review_content": "\nThe man's a genius, no contest.  The class, however, is beyond wretched.  If you really want to \"experience Taussig,\" I recommend you read some of his books (\"Law in a Lawless Land\" was good) and spare yourself the pain of this rambling, pointless course.  \nWith that said, attending his lectures is kind of like reading \"Naked Lunch.\"  So maybe if you like the Beats, you'd fare better than me.\nWorkload:\nNot bad.\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "December 10, 2005",
            "review_content": "\nI want my money back!  What a horrible excuse of a class.\nTaussig rambles, and rambles, and rambles, and rambles, and rambles, and rambles, and rambles, and rambles on about God knows what, but certainly NOT about anthropology.  The required books are as expensive as\nthey are confusing, and they are plenty expensive.  The class breaks into small groups, about 20,  in which a TA leads discussion.  However, even my TA was confused when confronted with basic questions.  Worst of all, the grading is completely subjective. You are at the whim\nof your TA.  You can write an absolutely knock out brilliant essay and get a C, which happened, or write a load of crap and get an A, which likewise happened.\nI would not recommend this class, or this instructor.\n\n\n\n \nWorkload:\nHeavy and dense non sensical reading assignments.  Six three to four page non sensical essays subjectively graded   by\na confused TA\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "December 10, 2005",
            "review_content": "\nI want my money back!  What a horrible excuse of a class.\nTaussig rambles, and rambles, and rambles, and rambles, and rambles, and rambles, and rambles, and rambles on about God knows what, but certainly NOT about anthropology.  The required books are as expensive as\nthey are confusing, and they are plenty expensive.  The class breaks into small groups, about 20,  in which a TA leads discussion.  However, even my TA was confused when confronted with basic questions.  Worst of all, the grading is completely subjective. You are at the whim\nof your TA.  You can write an absolutely knock out brilliant essay and get a C, which happened, or write a load of crap and get an A, which likewise happened.\nI would not recommend this class, or this instructor.\n\n\n\n \nWorkload:\nHeavy and dense non sensical reading assignments.  Six three to four page non sensical essays subjectively graded   by\na confused TA\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "November 03, 2005",
            "review_content": "\nGranted, the man has clearly done way too many hallucinagenic drugs and it shows (and not just in the shiny purple shirts!)--his tangents have tangents, he trails off frequently, and he often does this adorable pilsbury dough-boy laugh--BUT those who say he is a fraud in these reviews are clearly lazy students or just not interested in the subject of anthropology.  Not that this means anything necessarily, but he is at the forefront of his field (which I know at Columbia doesn't seem like a shocker, but even by this university's standards he's somewhat of an academic celebrity)--those who say he doesn't know what he's talking about obviously don't know what he was talking about. Taussig's class is unique, as is he, and if you love professors who are PASSIONATE about the material, are hilarious because of their quirkiness, and know freakin everything about their subject then check him out. Taussig hates the stereotypical Columbia do-it-for-the-grade-and-to-get-the-right-answer student--he really wants you to read deeply, THINK about the material and get something out of it.  Really, the best way to go is to sit in on a class--or even 20 minutes of a class!--and see for yourself.\nWorkload:\nLots of readings for section, many of which you don't need to do for the papers but they are good; NO midterm, NO final--grade is totally based on 2-3 page papers every other week.  Yea, it's that awesome.\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "November 03, 2005",
            "review_content": "\nThis was the first class I ever attended in my first semester at Columbia.. I was absolutely terrified that this was what I was paying money for.  I went to only a handful of lectures, most of them consisted of him rambling on in short shorts and unbuttoned shirts(this is the last prof you want to see in this state).  My notes often only had one or two statements per lecture- i'll admit every now and then he raised interesting questions, but he gave them no context and did not make any attempt to answer them.\nSection is where the class really is.  I liked my T.A.(Kiara if u have the choice), and often had great discussions in section.  The papers that were assigned(often), however, were such painful strange topics and graded so subjectively it left me at a complete loss.  The course packet is interesting but do not buy the other 10+ books, particularly his.\nSit in on one lecture if you want a taste of his madness- he is hysterical and very approachable, but that is NO reason to waste a semester with this man.  DO NOT TAKE THIS CLASS.\nWorkload:\na lot of reading that you dont have to do, 2-3 page papers every couple of weeks.  I spent more time agonizing over these mini-papers than any research paper.\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "November 03, 2005",
            "review_content": "\nThis was the first class I ever attended in my first semester at Columbia.. I was absolutely terrified that this was what I was paying money for.  I went to only a handful of lectures, most of them consisted of him rambling on in short shorts and unbuttoned shirts(this is the last prof you want to see in this state).  My notes often only had one or two statements per lecture- i'll admit every now and then he raised interesting questions, but he gave them no context and did not make any attempt to answer them.\nSection is where the class really is.  I liked my T.A.(Kiara if u have the choice), and often had great discussions in section.  The papers that were assigned(often), however, were such painful strange topics and graded so subjectively it left me at a complete loss.  The course packet is interesting but do not buy the other 10+ books, particularly his.\nSit in on one lecture if you want a taste of his madness- he is hysterical and very approachable, but that is NO reason to waste a semester with this man.  DO NOT TAKE THIS CLASS.\nWorkload:\na lot of reading that you dont have to do, 2-3 page papers every couple of weeks.  I spent more time agonizing over these mini-papers than any research paper.\n"
        },
        {
            "course_name": "Taboo and Transgression",
            "review_date": "May 21, 2005",
            "review_content": "\nI admittedly dislike Taussig more than most students, because I think he is a lazy scholar and a secret narcissist. That said, he is much needed in this University because he does not take himself too seriously, does a decent job of pretending to be humble, and assigns fantastic reading. I wish he didn't spend the whole class talking about what he wants to touch on during the class--it's like he is always revving up, adding to his thesis statement without ever delving into it--and I wish he gave more direction to class discussion, but he is kind and crazy, and thus a perfect antidote to overserious academia. Plus, if you are late to class or in handing in assignments, you are applauded for being Dionysian. \nWorkload:\nMaybe 100 pages of reading per week and a 2-3 page paper every two weeks. No midterm, no final (exam or paper). Glorious!\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "March 22, 2005",
            "review_content": "\nNo No No!!!! Do not take this class!!!   It has nothing to do with anthropology.  Taussig just rambles on and on in a \"whirlygig\" about whatever pleases him.  The lengthly and confusing readings are a complete waste.  Moreover, the books are darn expensive   (thirteen in all),  and are as confusing as Taussig himself.   It is such a shame, because anthro could be a fantastic course with properly assigned readings.  The class is subdivided into discussion groups in which the TA grades your assignments.  I did luck out and have a good TA, but that was not the case in all of the sections.  Accordingly, the grading is completely subjective, and does not reflect students work on an even playing field.   To sum things up, I am no longer an anthropology major because of this class.    \nWorkload:\nHeavy reading assignments that are often ignored in class.  Six three page writing assignments that are graded by a TA.  They can take days to write, because this whole course is a confusing mess.\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "March 01, 2005",
            "review_content": "\nMick Taussig is one of the gems of Columbia.  I'm a Comp Lit major and have no specific interest in anthropology, but I am so glad I took this course.  Prof. \nTaussig is passionate, eccentric, brilliant, and loves students and teaching.  \nWorkload:\n2-3 page papers every two weeks.\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "January 19, 2005",
            "review_content": "\nI have to agree with the previous review.  Your grade is determined subjectively by a TA, not by Taussig.  There were tons of readings, many of which were never discussed.  Furthermore, the cost of purchasing these books is enormous.  Although the course had little to do with antrhopology, some of the topics were interesting.  Overall, I propbably would not recomend it.\nWorkload:\nEndless amounts of dribble to read. Much of it makes no sense.  Six 3 to four page papers graded by a TA who either likes you or not.  Class participation does not count.\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "January 09, 2005",
            "review_content": "\nThis was the most frustrating and painful class I have ever had the displeasure of taking at Columbia.  It was not so much because of the Taussig, but because the course had very little to do with anthropology and much more to do with philosophy.  Taussig is truly zanny, but if your ideas don't match his, watch out!  His reading assignments were lengthly, and many simply did not make any sense.  Furthermore, several of the costly required books were written by Taussig.  After dumping a ton of money on them, we just read a few chapters.   The worst part of this class, however, relates to the TA's.  You are at the complete whim of who you get.   Personally, I have never written better papers for any class at Columbia, and I have never received such low grades!  I read every single iota, participated in every discussion group, and  never missed a lecture or a discussions group.  However, this was not reflected in my grades.  To add insult to injury, I read some of the papers that received A's.   Some of these students constantly missed class, and failed to do readings. This was reflected in mediocre papers, yet they received the hightest grades!!  This is astounding to me.  As someone who previoulsy had a perfect 4.0 gpa, I am regretful that I took this waste of a class.  About 150 people showed up for the first lecture.  Many left.  Be smart and do the same.\nWorkload:\nTons of reading assignments that have nothing to do with anthropology.  Supposedly, class participation in the discussion groups are a part of your grade.  That is what our TA stated on the first day, but it was a lie.  If you are a good student who cares about learing, don't waste your time with this one. \n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "January 05, 2005",
            "review_content": "\nMick is the only teacher who's words I thought about outside of class. Understandably, if you're a callow little freshman you will probably be scared at first, but once you move past the all the orthodox crap of what a professor should look, talk, and act like, you will love this guy. Half the time it sounds like he's just pulling stuff out of his ass, the the other half of the time you don't really know where he's going, but like an earlier review so eloquently put it, though Mick never goes quite where you expect, what he does touch upon is far more interesting.\nPlus, he will make far more sense if you actually read the stuff he assigns before coming to class, which I rarely did. Yes, you certainly don't have to do all the reading to get a decent grade, but the reading is so interesting that you really don't mind it.\nDEFINITELY take this class, if you don't mind that it's far more philosophy and psychology than anthropology of course. \nWorkload:\nan 2-3 page essay about every two weeks (I think we had 7 in all)\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "December 19, 2004",
            "review_content": "\nProf MT embodies the most positive elements of the academic experience: endlessly informative, brilliant, funny, engaging/engaged, always curious, passionate about being passionate--in short, he inspires my belief in the power of higher education.   If you need a list of \"right\" answers, do not take this class.  Taussig WILL leave you scratching your head...and thinking long into the night.\nWorkload:\nplenty of worthwhile reading--but don't buy all the books right away. Short essays every two weeks, no midterm, no final.\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "December 19, 2004",
            "review_content": "\nWhat a fantastic, crazy experience this class was!\nTaussig was the quintessential eccentric professor. His lectures reflect his personality: zany, twisting, full of stories and always interesting. While taking the class it felt like anything but a survey class, but at the end I realized we had covered Mauss, Boas, Hunt, Malinowski, et al. , pretty much the anthro canon.  \nI would recommend this class to anyone without hesitation.  Taussig is truly a rock star of social science.  From his crazy Australian accent to his crazy purple shirts to his crazy stories of his Colombian fieldwork, Taussig will never disappoint.  I still use his works on transgression in other classes, and it's really cool to piece things together using concepts learned in this class.\nTake this class, you won't regret it.\nWorkload:\nA 2-3 page paper every two weeks, no midterm, no final, no attendance taken during lectures(though I recommend you go anyway, just for your own enjoyment).  The essay topics come from Taussig, and they are always thought-provoking and fun to write.  The TAs grade the essays. so grading on the whole really depends on your TA.  LOTS of reading, but you don't really have to do all of it.  Tip: buy the coursepack and then buy books as they are assigned, because we didn't get to everything on the list.\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "August 28, 2004",
            "review_content": "\ndef. take class. just a caveat: don't buy all the (pretty expensive) books at the beginning of the semester. pick up the coursepack and by book by book as he actually talks about them in class. youll probably get to about a third of the assigned material. and if dean lukic is a ta, be in his section.\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "January 20, 2004",
            "review_content": "\nthis man is amazing. his class is pretty laid back and the workload is not back-breaking at all.  considering the size of and how leniant the class is, youd think that no one would show up, but a lot of people did. it just goes to say that people were genuinely intereseted in the class and what he had to say. yes, he went off on random tangents, yes sometimes the class had no idea what he was talking about, and yes sometimes we never got to most of the readings, but he is truly a well-learned, travelled, and interesting man who has interesting and important things to say.\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "December 01, 2003",
            "review_content": "\nTaussig is great.  He's funny, enthusiastic, and definitely a character.  I heard from many before enrolling \"you'll never have another professor like him, enjoy it.\"  And he does indeed have a shining personality: most likely a hippie  back in the day (frequently starts the class with Doors playing in the background, showed Apocalypse Now the first week of class), definitely opinionated and not afraid to share it, a non-conformist and proud of it, but not at all obnoxious or condescending.  His crazy shirts are always a joy.  The reading is interesting and the lectures, though sometimes convoluted and requiring close attention to understand, are always interesting and informative.  And consequently, Missing a class or three or four is no big deal if you keep up the reading and make sure to attend discussion sections.  There is no final or midterm, and the frequent essay topics are interesting and fun.  \nWorkload:\nheavy reading but it's not all necessary, 3 page essay, assigned and graded by TA every 2 weeks -- no final or midterm.\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "November 20, 2003",
            "review_content": "\nWhat a crazy guy.  He is incredibly disorganized and spends class ranting about economics... which in my opinion usually turns into \"America is bad.\" ....You read some interesting stuff, but he will never talk about it in class.\nWorkload:\nPretty easy:  6 3-5 page papers.  bunch of reading.\n"
        },
        {
            "course_name": "Anthropology of the War Machine",
            "review_date": "December 09, 2002",
            "review_content": "\nOK, whoever wrote the last review has very little credibility, because if he or she had read the syllabus it would have been clear that the course was intended to do half of what was complained about. No, this class is not an ethnography of war (although there were some really interesting readings that I think qualify as ethnographies.) On the syllabus, and in class on the first day, the Professor explained that the point of the class was to explore war as a concept, the attraction/repulsion people felt towards it, and to think about meaningful ways to resist war and explore the possibilities for anti-war art (the fact that the course title uses \"war machine\" not \"war\" ought to give some of this away). I do think there's something slightly disturbing about the abstraction of war, but I think in disucssing war conceptually people were usually expressing frustration with the lack of \"reality\"war has for many of us-- and I think it trivializes the real experience of war to pretend that reading ethnography of war would resolve this. While this class doesn't deal with much straight anthropological theory ,it is very much concerned with the symbolic and with social forms and structures, and with various questions of representation. Personally I was fascinated by the way material from different disciplines and historical circumstances was tied together conceptually and made relevant to major anthropological questions. Yes, this class was more lecture than seminar, and I think Professor Taussig could have done a better job facilitating discussion, but I also think you'd be hard pressed to find a professor on this campus who could make a two hour lecture as consistantly interesting as this one was. I didn't get the impression that he was at all closed off to alternate opinions, in fact class discussion was often dominated by one or two students who had vocal opposition to the view being presented, and while people disagreed with them they were never silenced or ridiculed. My biggest complaint was the constantly changing reading assignments-- not because I'm big on sticking to the syllabus, but because on occasion we did not know what the day's reading was until the morning of class, and it got confusing. I still enjoyed the class very much, and didn't feel like the flexibility seriously detracted from it. I understand how that the lack of structure and the interdisciplinary aspects of the course might frustrate some people, but it was pretty clear what they were getting into when they enrolled in the class. So basically, if you're very conservative, or if you can't deal with uncertainty in academic settings, or you just have a big stick up your butt like the previous reviewer, stay away fromt this or any other class Taussig is teaching, but if you're ok with randomness you'll probably learn a lot. \nWorkload:\nA lot of reading, but don't go by the syllabus because you won't get to all of it. A few short (2 page) papers graded generously. Some of the topics were better than others, but overall I thought the assignments were a good way to approach the somewhat difficult reading. Also, be aware that there's an unscheduled discusson section for this class, and it adds an extra hour per week. \n"
        },
        {
            "course_name": "Anthropology of the War Machine",
            "review_date": "December 08, 2002",
            "review_content": "\nThis class sucked like no other. To call it a class is a fallacy. To call it anthropology is ridiculous. To call Taussig anything but a giant self-important self-pleasuring intellectual fallace is... well... you get the point. Taussig has no structure to his rants and his content is void of intellectual merit. He doesn't question his own cultural assumptions or those of his students, and in a discipline based on examining cultural structures, world-views, and ASSUMPTIONS, his sloppiness is unacceptable. If I as a student can poke major holes in my professor's methodology and arguments, something's not quite right. Where's the ethnographic material of people who have actually engaged in warfare? Where's the synthesis of the ridiculously stratified readings we did? What got to me most was Taussig's completely unselfconscious bias. He presents one interpretation of our reality like it's truth, and that's just bad news in a discipline that examines multiple, culturally specific \"truths.\" Taussig's got knowledge, but he has neither the perspective nor the wisdom to balance it out. And what sort of professor makes up paper topics 10 minutes after class has finished? What sort of respect does that show for students, or the subject, for that matter? This seminar made me want to vomit. My ass could have taught a better class.\nWorkload:\nBuying coffee to stay awake in class. And a few B.S. papers. EZ.\n"
        },
        {
            "course_name": "Pirates, Boys & Capitalism",
            "review_date": "December 16, 2001",
            "review_content": "\nThe good, the bad, and the absolutely fabulous: Taussig is probably the most interesting and compelling professor I've had at Columbia. He doesn't think like your average academic, he doesn't talk like your average academic...he can make Walter Benjamin, Robert Louis Stevenson William Burroughs and Shakespeare all fit into a single class, and not only that, make sense. The readings were every which way, fun, shocking, and sometimes really difficult, and the lectures are the same. I learned a lot and I enjoyed it. The problems: his classes tend to be crowded and this is one seminar where you probably won't open your mouth much. Honestly, I say, all the better: Taussig can fill a 2 hour class and every last minute will be worth your attention. He is that good, every single week.\nWorkload:\n1 3 page paper every 2 weeks. Not bad for a seminar!\n"
        },
        {
            "course_name": "Primitive Communism: Gift and Fetish",
            "review_date": "July 07, 2001",
            "review_content": "\nFascinating man, less than fascinating teacher. Don't count on talking much in his seminars since he rambles pretty much the whole time. Some people find his lectures interesting, but I found them not worth following. If the class were bigger, I'd take out a copy of the Spec. Oh, and did I mention the mandatory weekly recitation led by his TA? \nWorkload:\n3-4 page paper every other week \n"
        },
        {
            "course_name": "Primitive Communism: Gift and Fetish",
            "review_date": "July 07, 2001",
            "review_content": "\nFascinating man, less than fascinating teacher. Don't count on talking much in his seminars since he rambles pretty much the whole time. Some people find his lectures interesting, but I found them not worth following. If the class were bigger, I'd take out a copy of the Spec. Oh, and did I mention the mandatory weekly recitation led by his TA? \nWorkload:\n3-4 page paper every other week \n"
        },
        {
            "course_name": "Primitive Communism: Gift and Fetish",
            "review_date": "July 07, 2001",
            "review_content": "\nFascinating man, less than fascinating teacher. Don't count on talking much in his seminars since he rambles pretty much the whole time. Some people find his lectures interesting, but I found them not worth following. If the class were bigger, I'd take out a copy of the Spec. Oh, and did I mention the mandatory weekly recitation led by his TA? \nWorkload:\n3-4 page paper every other week \n"
        }
    ]
}