{
    "prof_info": [
        {
            "prof_name": "Kevin Costa",
            "prof_id": 1178,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Fluid Biomechanics",
            "review_date": "August 31, 2008",
            "review_content": "\nThe Class:  This fluid biomechanics class was probably as interesting as it could get given the subject manner.  Lectures are presented with a qualitative analysis of what each organ/system does, followed by a mechanics based model that tried to mathematically simulate the body.  The class gets long since it's 2 hours and 45 minutes long, but it's important to go to since the lectures are clear and the examples useful.  The homeworks are usually difficult (although they can vary) but worth a hefty percentage of your grade (5 x 10% each).  The midterms (3 x 10%) were on the easier side of fair (slightly) and drew extensively from the homework and example problems.  The final was a longer and slightly easier version of the midterms, again on the easier side of fair (20%).  Overall the class is pretty useful, as interesting as it can be, the workload is very fair, and the grading isn't too bad.\nThe Professor:  Professor Costa was very friendly and approachable.  It was very refreshing to have a professor who seemed to view teaching as enjoyable, instead of an irritating distraction from his/her research.  Prof. Costa's lectures were well prepared, orderly, and clear.  He is very fair to the students and always willing to help.  In fact some of his best tips/explanations come during office hours.  Unfortunately, Prof. Costa may not be returning this fall, which is certainly Columbia's loss.  Although this  is a research oriented university, Columbia could definitely use more instructors of Prof. Costa's caliber.\nWorkload:\nFair: 5 Problem sets (hard) (50%), 3 midterm quizzes (very fair) (30%), and a final (easier than midterms) (20%).\n"
        },
        {
            "course_name": "Fluid Biomechanics",
            "review_date": "May 22, 2008",
            "review_content": "\nI don't think I've learned more in any class. Part of this is because of the volume of material that Fluid Biomechanics carries and part of it is because Costa really knows his stuff. There were sections (like Water and Solute Transport) that he was shaky on but included for the benefit of Cell & Tissue people, who could use that stuff. And although Professor Costa uses the outdated method of writing all his notes on the board for us to copy down, it proves to be beneficial, as the notes are something you'd want to keep for reference later on. All exams are open notes and open book and reflect what you saw in the homework.\nAlthough Costa probably isn't teaching at Columbia next year, I believe he deserved a good review. I feel very fortunate to have taken his class while I had the opportunity to.\nWorkload:\nA lot. Homeworks are a part-time job but each one is as much as an exam, so putting in the time is worth it, in the end. Costa's notorious for cheating -- don't even think about it. Besides, you'll be glad you put in the effort when exams come around.\n"
        },
        {
            "course_name": "Fluid Biomechanics",
            "review_date": "August 06, 2007",
            "review_content": "\nI heard some unsettling things about Costa's Biomech class, but I actually ended up enjoying the course more than many of the other BME requirements. I had to choose between a Transport oriented class and Biomech, and from what I heard from the Chem Es, the decision took no time at all. The beauty of Costa's class is that he rewards hard work from the students. His homework assignments are by no means easy; I distinctly remember working in Mudd or a computer lounge till 4 AM in the morning. Our class did exceptionally well on the midterms and homeworks, and so Costa decided to give us a really easy final. Almost everything on it we have done before. Fluid Biomech is not easy, but Costa does his best to explain every concept.\n"
        },
        {
            "course_name": "Quantitative Physiology I",
            "review_date": "January 11, 2003",
            "review_content": "\nCosta is a very nice guy and does a pretty good job of explaining some complicated material. He is incredibly approachable and makes extra time for office hours. The class is difficult and the book while good is not enough. The HW and tests are taught directly from the notes so make sure to get good notes and understand the material. Cannot stress enough the importance of doing the homework promptly so that you can ask him questions during office hours.\nWorkload:\n50% 6 problem sets20% MIdterm30% Final \n"
        },
        {
            "course_name": "Quantitative Physiology I",
            "review_date": "January 06, 2003",
            "review_content": "\nThis course started out nightmarish, but eventually became rather interesting.  This was not necessarily due to any fault of Prof. Costa, but just due to the nature of the first few chapters of the course; any professor would probably have difficulty making complex algebraic equation manipulations fun.  By the middle of the semester, though, the material was of a more tangible sort, so was more interesting.  Prof. Costa presented this latter material generally well - I didn't catch any awkwardness in his board manner (passable penmanship) or sense any resentment for having to teach this intro course.  The course follows the textbook (which is copied and distributed in handouts), generally, with some deparatures.  It's not a great book, but the later material is not too abtruse, so it's usable.  Prof. Costa was generally punctual and organized during my semester, so I suppose that he improved since his first time around.  The best characteristic about Prof. Costa, though, is his approachability; I felt very comfortable asking him questions about the material or the course.  He offered two office hours each week, and had the TAs show up for three more each week, for a total of 5.\nWorkload:\n6 problem sets (do *not* leave for the last day); midterm and final with a formula sheet provided and 1-2 pages of personal notes allowed.\n"
        },
        {
            "course_name": "Quantitative Physiology I",
            "review_date": "July 17, 2002",
            "review_content": "\nProf. Costa never seem enthused about teaching this class. This was the first time he was teaching this course after it had been taught by Prof. Clark Hung in previous years. One TA said to the class in recitation that Prof. Costa wasn't happy about receiving this teaching assignment (apparently Prof. Hung's seniority allowed him to teach a different course). Prof. Costa's research specialty is biomechanics so you'd think he stick to teaching those courses. The textbook was a poor choice, published by Springer which is notorious for dense texts not often used as course texts, but often found in college libraries (optional for the course not required); perhaps informative, but not well suited for the course. Prof. Costa doesn't have a good teaching style; he talks into the board, turns his back to the class, and his writing is like fine print. Later in the term, he was often 5 or 10 min. late (910am class) and did not have enough material for the standard lecture time. This course was disorganized enough that we didn't cover a large part of the latter portion of the syllabus. Still, it's shocking that he earned higher ratings in the SEAS Oracle for teaching this course than he's earned for his other courses.\nWorkload:\n6 fairly time consuming problem sets, lowest grade dropped, midterm, final\n"
        }
    ]
}