{
    "prof_info": [
        {
            "prof_name": "David Schiminovich",
            "prof_id": 3972,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Observational Astronomy",
            "review_date": "September 29, 2020",
            "review_content": "\nProf. Schiminovich has to be the most caring and kind professor I've had the pleasure of having at Columbia. The class is super interesting, held in the astro library where you can sit on couches during lecture, and he even provides cookies and snacks every once in a while. \nThe labs in the class are super interesting and you don't really need to have any experience with astrophysics to thrive in the class and get something out of it. You'll split the class between lecture time and lab time which usually involves going onto the roof of Pupin to use the domes or other stuff.\nThe highlight of the class is the trip you'll take a trip during Spring Break to MDM Observatory in Arizona where you'll get hands-on experience with the telescopes there which is super rad. Plus, you'll have plenty of opportunities to get Mexican food, In-N-Out, etc which is amazing.\nGreat class, super kind prof, amazing TA, and just generally a good time\n\nWorkload:\nMost labs are finished in class so maybe 2-4 hours a week if you don't finish it within class. No exams or homeworks outside of finishing the labs. Final project is a little more time intensive but very manageable \n"
        },
        {
            "course_name": "Observational Astronomy",
            "review_date": "September 12, 2014",
            "review_content": "\nIf you are not a science major, do NOT take this class. They say that high school level math and science is all required to do well-- NOT TRUE. I thoroughly enjoyed science/math courses in high school and always did fairly well. This class was so difficult. If you've taken an introductory astronomy class before that would definitely help. If not, the professor requires you to get an intro astro book to familiarize yourself with concepts and terminology. I did not understand a word either of the professors said during their lectures. I was so overwhelmed, I didn't even know where to start if I wanted to ask a question. There is a trip to Arizona for some observing that I was excited about, but when I saw most of the class didn't sign up for it (it's optional), I decided not to go either. The coursework is very minimal. He doesn't really care about grades-- barely talks about them until the end of the semester. I just stopped coming to the lectures because they were a waste of my time. I did the bare minimum work at the end of the semester and got a C. \nWorkload:\nNot much work. A couple of problem sets, telescope tests, lots of observing, and one project due at the end with presentation. \n"
        },
        {
            "course_name": "Life in the Universe",
            "review_date": "July 06, 2010",
            "review_content": "\nProf. Schiminovich is one of the nicest, simply intelligent and pleasant professors I've had at Columbia/Barnard. I had no prior experience in Astronomy, and I took the class for my core science requirement. I'll admit that the first lecture left me a little bit afraid and most of the material went completely over my head, but that soon changed after a few days. His lectures are abundantly clear, he will always take time to meet with you during office hours, and his syllabus and grading policies are such that you have plenty of extra credit and partial credit given for attempted answers. I recommend attending the lectures (even though some of them did put me to sleep...not many, but some) because they are infinitely helpful for quizzes, homework and the final. This man writes jokes for Futurama and The Simpsons while also building satellites for NASA. He is certainly a connected and experienced professor, and like others have said before me, he'll even bring you brownies and macaroons at some point during the semester! I learned quite a lot with having a very managable workload. The class is recommended to those of you interested in astronomy as well as those looking for fulfilling your science requirement.\nWorkload:\n5 homework sets, a few quizzes, some extra credit reports and a final. The HMW sets are fairly simply if you attended lectures. The quizzes are a bit tricky, but he drops the lowest grade. The final is long but clear and simple if you study (you get a cheat sheet too). Pay attention, and you'll be just fine.\n"
        },
        {
            "course_name": "Life in the Universe",
            "review_date": "April 19, 2010",
            "review_content": "\nEasy class to take for the Barnard Quantitative Reasoning requirement. It was a bit difficult for me in the beginning though because I have no background in physics and astronomy but Professor Schiminovich is readily available for office hours, as are his TA's. The lectures were always very clear and often interspersed with funny images of his cute son or himself working on some sort of space observatory. On the lecture before Thanksgiving break, he brought the class brownies and macarons that he had made (recipes from the French Laundry cookbook! Delicious). You learn the basics of the solar system, about the moon, tides, seasons. Pretty elementary stuff but I had no knowledge of this subject so it was endlessly fascinating to me. He always makes references to popular culture which is always fun. He wrote an equation that appeared in an episode of The Simpsons. You also explore the possibility of life on different planets, solar systems, galaxies... so fascinating. Also a look into black holes and all that weird, trippy, but frustratingly confusing stuff. A great class to take for fun.\nWorkload:\nReally not that bad. You get a lot of time to work on the homework assignments. There are quizzes which are easy if you pay attention in lecture--they are often the same problems/formulas presented in class, just with different numbers substituted in. Midterm was tough as was the final but you get to bring a sheet of paper with notes--though the process of making this \"cheat sheet\" was more helpful than it was during the actual test. He gives you all the necessary formulas for the tests. The curve saved my grade!\n"
        },
        {
            "course_name": "Life in the Universe",
            "review_date": "December 23, 2009",
            "review_content": "\nThis class was a really interesting way to fulfill the science requirement, and Professor Schiminovich is a really nice, helpful, and caring teacher. Though it is slightly hard to focus during lecture because he more or less teaches off his slides which he posts later online, the material is generally very straightforward and he is more than happy to help explain it to you during his office hours, which he holds every day. The math component of the course is not bad, more or less plugging in numbers into equations, but I would recommend having at least a small interest in astronomy before taking this course or else you will find yourself lost but, more importantly, bored out of your mind and wondering why you are suffering through such lengthy discussion of planets and stars. At times the material was quite odd and confusing but Professor Schiminovich was by far the friendliest professor I had this semester, which made it that much easier to handle even those parts of the course (read: astrobiology). Overall, a good class to take especially if you're in Columbia and only need one semester of science with no lab.\nWorkload:\n5 bi-weekly homeworks, 4 open-note quizzes (not difficult), a midterm and a final (both with one-page cheat sheets). Drops the lowest HW and quiz but the exams count for a lot of your grade. He also gives an extra-credit essay. No required reading whatsoever. In general, the workload is really light compared to most other classes.\n"
        },
        {
            "course_name": "Life in the Universe",
            "review_date": "April 22, 2009",
            "review_content": "\nThis professor was the most helpful and caring professor I've had at Columbia. Although, yes, his homeworks were difficult (pretty much all math), he held so many help sessions and really wanted all of his students to understand and succeed. His lectures were fun and SO interesting. And he even baked for us on the last day of class!!! It is easy to do well in this class if you put the effort in. His quizes seem hard at first, but after the first, they are easy to get the hang off... and he drops the lowest HW and quiz grades... The midterm and final both involve no math... all conceptual.\nWorkload:\nMidterm, Final, Extra Credit (4 page) Paper, Homework due every two weeks, Quizes every two weeks. \n"
        },
        {
            "course_name": "Life in the Universe",
            "review_date": "January 25, 2009",
            "review_content": "\nOy vey.  Do not take this class.  I repeat, do not take this class.  I wish I could go back in time and tell myself this!\nOk, I guess it wasn't that bad.  The prof is funny and cute, I think he's a great dad to his little boy and he does real research.  But the lectures have absolutely nothing to do with the homework, which in turn has nothing to do with the textbook.  It was enormously frustrating and I don't know what I actually learned.\nIt's incredibly easy to pass.  Even if the homeworks seem daunting, just *try* them and go to the help sections.  The exams are largely conceptual, so you're not screwed if you're not a math person.  It is not necessary to attend lectures but I recommend showing up for quizzes.\nI learned some cool facts, like if the sun burned out a couple minutes ago we wouldn't know it yet because it takes some time for the light to travel here.  But, well, I just told you that, so now you don't need to take the class!\nWorkload:\nehh.  Too much.  5 homeworks (looong), 4 quizzes, midterm, 1 four-page extra credit paper on the Natural History Museum, final.\n"
        }
    ]
}