{
    "prof_info": [
        {
            "prof_name": "Michael Drew",
            "prof_id": 2602,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "January 14, 2006",
            "review_content": "\nI don't often write reviews, but I felt somewhat obligated to in this case, as none of the previously written reviews on Prof. Drew truly illustrated how completely dull, disorganized, and awful a professor this guy is. I absolutely completely and totally dreaded every single one of his lectures from day 1. He seldom had intelligent answers to students' questions. When a concept is difficult, he'll refer you to the book rather than explain it himself- he'll actually say just that. I'm ashamed of Barnard for having hired such a professor, even if his issues are just a function of his age and inexperience. Please do yourself a favor and avoid this class at all costs. \nWorkload:\nthe test questions are completely arbitrary and nitpicky.\n"
        },
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "January 09, 2006",
            "review_content": "\nThe material is not particularly interesting. I found the textbook Drew used to be quiet dull and confusing. However, Dr. Drew, although nervous most of the time, is extremely engaging. He wants his students to learn, and he appears passionate about the subject. This is evident in always answering the very annoying, irrelevant questions asked by his students. I agree with the previous reviewer- Drew isn't that big on emails. However, I hear he is very helpful during office hours. His tests are NOT hard at all, as long as you read the book, answer the study questions, and use your common sense. Don't delay on answering the study questions. The best thing to do for tests is to read over the answers and use your notes and powerpt slides. I found that his tests were more lecture based than text book based. He does throw several trick questions on the exam, but you can probably those out. In fact, the only trouble I had with his tests was deciding which questions to throw out!\nSo, all in all, I did learn a lot in his class, although I struggled to stay awake to read the textbook. \nI did take the lab. The lab was entirely pointless. The assignments were all very easy, but the grading was very arbitrary. The grade from lab could decide whether you get an A or an A-. Even if you get all As on your  tests but receivea B on ur lab grade, that can bring you down to an A-.  \nThe median for the class was around a low B. I did not find the class or lab to be hard at all.\nWorkload:\nstudy questions, two midterms, one final... first midterm was easier than the second... final was tricky, but doable\n"
        },
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "January 03, 2006",
            "review_content": "\nProfessor Drew is rather dull and gives unclear and confusing lectures. His slides leave you confused since they usually only contain the questions he is asking rather than the results of the experiments. Since the book doesn't cover the experiments he discusses, you are somewhat screwed. Maybe he will become clearer as he gets more teaching experience. but right now I wouldnt suggest bothering with this class unless you absolutely need it for a requirement. \nWorkload:\n2 midterms, one final (with a cumulative section). He lets you discard 2-3 questions. Best way to study is to really understand all the slides and experiments discussed.\n"
        },
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "December 26, 2005",
            "review_content": "\nI agree that Dr. Drew was not as great at the beginning of the year.  I got the feeling that he's a new teacher and is still trying to figure things out.  However, as the year went on, his explanations and lectures got clearer, as well as his ability to answer questions and also to deflect the ones that threaten to take over the whole class period.  His inexperience is really the cause of people's dislike, but he definitely improved as the year went on.  He's also really good about giving examples and making powerpoints, etc, accessible.  \nOverall, the class could have been better, but I really think that it improved over the course of the semester as Dr. Drew sorted things out.\n\nWorkload:\nNot bad- optional study questions (which are a major help), two midterms and a final.  If you come to class, you'll do fine.\n"
        },
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "December 14, 2005",
            "review_content": "\nI think at the beginning of the year Professor Drew was really nervous about teaching and his lectures were all scrambled. He got better as the semester progressed but sometimes he still had trouble answering some of the students' questions. He's not great at answering his e-mail, but he's always willing to talk with you before or after class and to personally go over the exam with you. The second time around, he seems to be able to explain the topic better, so you may be a bit frustrated with him once he finally explains it to you in a way you can understand but AFTER the exam. All in all, he seems to be a fair teacher. I wasn't in the lab portion of the course, but I've been told that's a good thing since mice in the labs never did what they were expected to do, thus, confusing the students even more than the professor.  \nWorkload:\nAbout a chapter of a textbook each week and then a couple of articles. All 3 exams are multiple choice and he lets you throw out 3-5 questions. \n"
        },
        {
            "course_name": "Psychology of Learning (w/ or w/o lab)",
            "review_date": "November 14, 2005",
            "review_content": "\nBAD CLASS. So damn boring, I left lecture early or just didn't go at all. You can totally download the powerpoint slides and read the book on your own, which is way more entertaining as this guy. The lab helps if you sign up to take it, but be WARNED: Prof. Drew will confuse you more than he will help you understand a concept, SERIOUSLY!\n\nWorkload:\n2 exams, 1 final. Study the book WORD FOR WORD and you will do ok. Also, if you take lab with this, then there is a little less pressure...\n"
        },
        {
            "course_name": "Experimental: Learning and Motivation",
            "review_date": "August 23, 2005",
            "review_content": "\nBoring, unprepared, easily confused, not very motivated (rather sad, given the course title). In my opinion he is better off just doing research. Not only does he come to class unprepared and unable to answer any unexpected questions, but he does not even seem to feel bad about it. I might have been able to forgive his horrible teaching skills if he seemed even the least apologetic for wasting our time. By the end of class, we were a week and a half behind lectures and he still crammed in the last lab report with one week to go. The labs were even worse, especially the day where he was not even prepared to run the lab. As for asking the TA for help, there was no TA! She came in once to advertise her study and then told us she isn't very involved in the class. This class is a waste. Usually people warn against difficult or annoying professors, but I am warning against damage to your mental health. You will be so angry with yourself if you take this class...\nWorkload:\n2 Lab Reports, midterm, final, a few ab questions after each lab\n"
        }
    ]
}