{
    "prof_info": [
        {
            "prof_name": "Nicholas Chong",
            "prof_id": 11366,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 21, 2016",
            "review_content": "\nProfessor Chong is phenomenal. He's by far the best Prof. I've had at this school, and I'm almost done with my time here. Obviously, CC is what you make of it, but if you're the kind of person who is even marginally interested in the reading list, then you're in luck, because Prof. Chong's class will be amazing and give you exceptional insights into the texts. Prof. Chong is incredibly knowledgable (he's a music scholar but he knows more about philosophy than the philosophy department), and has the ability to elucidate crucial themes and explain them in a way that stays with you after the class is over (you're never going to forget what Nietzsche was trying to say after Prof. Chong's lecture about it). He makes you actually care about what you're reading, because he shows you why it's relevant for understanding the way our society works now, which is supposed to be the point of CC, even if the course usually doesn't seem to have that effect on people. His class is the answer to the \"why are all these dead white guys on the syllabus\" question, because he demonstrates the way that Western philosophical thought builds on itself, and he connects it to important historical events, as well as modern examples and broader moral questions. Basically, Prof. Chong can give you a more engaging and rewarding overview of why Western Civilization works the way it does than any actual history or philosophy class at this school. \nProf. Chong is also an extremely approachable, respectful and organized person, and he puts a ton of effort into his class preparation, so you feel like the workload for the students and Prof. is completely reciprocal. He's enthusiastic and humorous and makes class entertaining (the two hours never felt too long) but he's also a serious lecturer: he wants you to take something away from the course that will impact your life and worldview, and his teaching style turns a core class that could be tedious into an experience where you feel like you're actually investigating important ethical and historical topics. He strikes a good balance between class discussion and more lecture-based exposition, which is helpful since the texts can be dense and it's nice to have a guiding thematic outline of what's going on. He compiles useful handouts about the readings when they're challenging (Kant), and uses outside material like art and music to bring themes together (Wagner and Nietzsche on aesthetics, Hamilton for the American founding documents). He is always available to meet with students about papers, and will help you formulate a topic or a thesis if you make the effort to ask. He is also extremely flexible about giving paper extensions (if you ask him, he'll grant it, including extending it beyond the final exam). He's a fair and straight-forward grader, and will give you good comments and advice on your writing. He also meets with every student after the first paper to discuss how you're doing in class -- he definitely rewards effort, and will take into account people who are trying to improve. \nBasically, Prof. Chong will give you all the tools you need to succeed in his class, since he's clear about his expectations, (which are very reasonable and standard for CC), as well as the motivation to succeed, since his lectures are so dynamic that they make you want to put in the effort to actually understand (and read) the texts. He takes CC seriously and makes you want to take it seriously too, and I think he instilled in the class a genuine appreciation for what we studied and why it matters so much. I cannot recommend Prof. Chong highly enough.\nWorkload:\nIt's CC so the reading is what it is. But you'll be more motivated to do the reading in his class, because his lectures make you feel like the texts actually mean something\n2 papers (6-8 pgs) and one shorter paper that you have to read out loud in class (it sounds stressful, but it's not)\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "June 05, 2013",
            "review_content": "\nNick was a fantastic Music Hum instructor. I'm surprised he doesn't have a silver or gold nugget! It was clear throughout the semester that he takes teaching very seriously, and that his goal was just for us to learn about classical music. These are always good things in a core class.\nI was most impressed by how organized Nick is and how much material he manages to fit into each class. His classroom is truly a well oiled machine. He produces very comprehensive handouts for everything in the course (class content, guidelines for assignments), returns graded work promptly with copious comments, and responds to emails quickly. He was an engaging lecturer and I think, managed to capture the interest of even students who probably weren't inclined to like the subject matter that much. It's clear that he's really into the material, but understands that most people wouldn't normally listen to that much classical music. On another note, it was pretty cool that for the German vocal music we studied, Nick appears to have translated the texts from the German himself. \nWith regard to course content, there were a few live performances in the class, which were pretty exciting (Nick is a singer), as well as a trip to the opera to see La Traviata, and to Carnegie Hall for a Wagner recital. \nNick is serious about graded assignments-- he'll definitely point it out if you don't back up your arguments or don't organize them clearly. That being said, since this is a core class and all, I think he is fairly lenient as long as a good faith effort is made. Plus, there are many extra credit opportunities. I'm pretty sure that a large proportion of our class received As.\nI believe Nick is teaching CC next year, and I think he'll be great. I'm pretty sure he incorporated something about Kant and the noumenal and phenomenal when we talked about Wagner and Debussy (hurray for drawing connections between core classes!).\nAnyway, if you get Nick for CC, definitely take the class! It's guaranteed that he'll invest boundless energy into the course and make great efforts to ensure that you walk away from the class enlightened on some level.\nWorkload:\nAn ungraded worksheet for each class, four 1-page listening responses due over the semester, one short 3-4 page paper, one 6-8 page final paper, midterm and final exams. Lots of extra credit.\n"
        },
        {
            "course_name": "Music Humanities",
            "review_date": "January 13, 2012",
            "review_content": "\nNick is a great teacher for music hum! He's a singer so you'll be listening to a lot of that in this class. For a 9 am class he keeps you pretty awake with his energy. He is very clear in his explanations and is as nice and lenient as he can be. he's a grad student so he's really understanding and will give you paper extensions if you tell him in advance. Also a smart guy (Yale alum). makes sure the student understands the material and always makes himself available for office hours if you need any help.the workload was fair, we had weekly listening assignments that he went over thoroughly in class before he collected. as long as you put in the effort you'll do well! (class isnt graded on a curve, he says if everyone hands in A-level material, everyone will get an A :) ) All in all i loved taking the class with Nick! He's quite entertaining and I gained much appreciation and knowledge for music. also the trips to the met opera and carnegie hall were definitely worthwhile! So be happy if you have Nick for music hum :)\nWorkload:\nweekly listening, midterm, final\n3 papers - 2 short papers 3 pages each, and one 6-page review of Lawrence Kramer's book \"Why Classical Music Still Matters\"\n"
        }
    ]
}