{
    "prof_info": [
        {
            "prof_name": "Ruben Savizky",
            "prof_id": 4142,
            "total_reviews": 10
        }
    ],
    "reviews": [
        {
            "course_name": "C1403-C1404 General Chemistry",
            "review_date": "December 24, 2016",
            "review_content": "\nI took General Chemistry I with Professor Savisky in Fall 2016.\nThe lectures in this class are fine, but I didn't find them particularly helpful. Savisky generally just regurgitated all the information that was on the lecture slides, which he posts online. If he did add any additional information, it generally was not all that helpful. He does crack a few jokes though. Essentially, you don't need to attend lectures to get a good grade in this class.\nSomething that I found really helpful in this class was the amount of study material Savisky gave you (practice problems and previous exams). They really helped you get an idea of what the exams would be like and helped prepare you for the quizzes. I found using the solutions manual to check your answers for the practice problems to be a productive way to learn and practice the concepts taught in class. Just studying the practice problems from Zumdahl is sufficient. I didn't study any of the recommended textbooks, and it was fine. The lecture slides can also be a good way to review all the concepts, but I didn't use them as my primary source of information. Online resources (e.g., Khan Academy) were pretty good at explaining complicated topics.\nThe exams can be tricky, but they're quite manageable if you had previously practiced with previous years' exams. I didn't really attend office hours, but Savisky and the TAs hold them quite often, so you could ask them questions from the previous exams and practice problems if you need help or clarification. I think the difficultly of the quizzes varies with each TA. I found the quizzes my TA gave to be particularly easy, especially if you had done each week's practice problems, but they probably were harder in other TAs' recitations. The practice problems are never due for a grade.\nAll in all, this was a fine and fair class. Savisky explains how grades work during the first lecture, and I think his approach towards the curve and normalization is pretty fair.\nWorkload:\n10+ hours/week\nThis could probably be a lot less, but I really tried to fully utilize all the given resources. Also, if you've already adequately learned all the concepts taught in this class in AP Chemistry, this course shouldn't take you a lot of time. For full disclosure, I got an A+ in the course.\n"
        },
        {
            "course_name": "C1403-C1404 General Chemistry",
            "review_date": "August 22, 2015",
            "review_content": "\nI took Prof. Savizky for Gen. Chem II in the Spring semester.  The key to success in Savizky's class is knowing how to play the game.  I attended all lectures (after reading the chapter) but this is not strictly necessary -- he tends to just read the slides.  Importantly, and this cannot be stressed enough, he DOES NOT use Zuhmdahl even though he does not say this explicitly.  The recommended textbooks are the basis of the class, including where test questions are taken from.  Reading these books and completing their practice problems (esp. Atkins and Hill) is the key to success.  My exam grades improved 20% once I started preparing this way (I just wish I had learned sooner than after the first two midterms).\nTo his credit, Savizky is very responsive to email, and quite genuine in his interactions with students.  While office hours can be packed, he will meet privately and does take care to build relationships with those who demonstrate commitment.  The class may be boring and feel like a game, but he really is a nice guy.\nTAs are given very poor supervision and the quality of recitation suffers for it.\nWorkload:\nI put in serious time to reading and practice problems, 10+ hours/wk, but the reward was that I beat the curve.\n"
        },
        {
            "course_name": "C1403-C1404 General Chemistry",
            "review_date": "May 07, 2014",
            "review_content": "\nI took gen chem I and II with Savizky in spring 2013 and summer 2014, respectively. He's one of my favorite teachers at Columbia. He's very easy to talk to and friendly, and he gets back to emails very quickly. If you're in an opportunity to start the gen chem sequence in the spring as opposed to the fall, I would highly recommend doing so since you'll end up with Savizky. If you put in the time, you can easily get an A+ both semesters. Definitely buy OWL and do as many problems as you can. More importantly, Savizky prepared us VERY well for organic chemistry, especially spectroscopy! I am currently finishing orgo II and I still encounter basic fundamental principles that Savizky taught us very well.\nWorkload:\nUngraded homework problems and OWL assignments, but do every problem that you can and don't restrict yourself to one textbook. That's the only way to do well in any chemistry class.\n"
        },
        {
            "course_name": "C1403-C1404 General Chemistry",
            "review_date": "August 20, 2013",
            "review_content": "\nI've just completed two semesters of Gen Chem with Savisky. I agree with other reviewers about his low voice and his tendency to mumble, but he is responsive to feedback. The class just needs to remind him from time to time and Savisky will make an effort to speak more clearly. Or just sit closer. I found the audience thinned out quite a bit over the course of the semester so there's plenty of room in the orchestra section. He seems like a nice guy and always stops to take questions. The real problem is that his lectures are out of order with the course textbook. I didn't figure this out until second semester, but his class is really based on Petrucci and not Zumdahl. This is why he skips around so much and will do things like use U instead of E for internal energy. Do yourself a favor and get the \"real\" textbook for this class. That said, it isn't necessary to go to lecture. He posts his notes online and it's all pretty much straight from the book (Petrucci, that is). Grading seems relatively fair, he's very clear about how the class will be curved and he drops your lowest exam and quiz scores (2 dropped out of 7 in the summer semester). Really get comfortable with your algebra. At least half his exam questions are just long math problems and I found both his finals to be even more \"mathy\" than the rest of the exams. \nWorkload:\nWeekly problem sets not graded but recommended to do well on weekly quizzes. Weekly quizzes. 3-4 multiple choice exams (20-25 questions) with lowest on dropped. Final exam, also multiple choice.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "May 17, 2013",
            "review_content": "\nI just got my grades today, so I guess I want to say something about this class (chem 1403 Spring 2013).\nProfessor Savizky has a really low voice and likes to whisper his lecture fast, which becomes a problem for me. Combined with the bad acoustics of the classroom, sometimes students sitting in the back can't hear him very well. \nThe order of lecture and that of the textbook don't go together very well, and we are constantly jumping around different chapters. I have no problem with jumping, but sometimes the textbook will say something that I have no idea of (i.e. it's the material from a previous chapter that we haven't studied)\nThe lecture slides are not very well organized. I'm often confused about how different ideas are connected. I feel that prof. Savizky likes to introduce a lot of more advanced topics, but didn't explain it thoroughly, so it just leaves us with a lot of confusion.\nStudents are very competitive since it's mostly a pre-med post-bacc class. So don't be surprised by the high average. The exams can be tricky. \nOverall, the class is OK. BTW, it's also my first chemistry class so I can't compare it with other chem classes.\nWorkload:\nvery little. I didn't do any of the suggested homework because I have the old edition textbook. But I did his practice exams, which will give you a good idea of what his exams are like.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "May 04, 2013",
            "review_content": "\nProfessor Savizky made everything very simple - recitation quizzes and exams. Nothing else was graded (though homework should be done to prepare for the recitation quizzes). However, since the quizzes and exams were prepare by different people (TA versus Professor), they basically had nothing to do with each other. The exams were relatively easy - multiple choice test bank type questions (though sometimes, the difficulty depended on the luck of the draw). But since he works at Cooper Union and only teaches evening classes, most of the class were post-bac pre-med students and so the average tended to be very high. Recitation quizzes seemed to be relatively harder and very tricky. All quizzes are curved to the save average at the very end, so just try to do better than average. 2 quizzes are dropped and 1 exam is dropped. \nHomeworks were not turned in or graded. OWL was recommended but your choice whether you actually sign up or not. I never had that great of an experience with OWL in the past so I didn't bother to buy a pass for it. However, from past experience, it can be helpful for some people since it guides you through the steps of the problem and gives immediate feedback on whether you did it right or not (though since it's a computer, it can be annoying in saying you're wrong just because you didn't write the answer in the right format or something). \nIt was also confusing sometimes where we were in the syllabus since the schedule was tentative. It would have been nice to receive an email saying which chapters were covered that week (since the lecture often left out a lot of details and reading was useful).\nProfessor Savizky was very clear during lectures and went over what was he thought was important in detail. However, the slides could have been more detailed and there were a lot of stuff in the book and in the homework that he did not cover. He was also rather soft spoken and monotone. After my recitations, it was clear that there were parts that could have been explained more clearly. \nBasically, what he covered was good, but there was a lot that he did not cover and that we had to learn through the book and homework problems.\n\nWorkload:\nWorkload depends on how much work you want to put into it. \nOptional homework every week that is not handed in or graded. Reading from the book that can be helpful, but depends on the familiarity of the student with chemistry. \nRecitation quiz every week (about 10 total) - rather tricky and only worth 4 points each so points get lost easily. \n4 exams - 3 midterms, 1 final that was 50% the first 3/4 of the class and 50% the last 1/4. \n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "May 01, 2012",
            "review_content": "\nThis was a fine class. Savizky is nice enough, and cracks a joke every once in a while. This class is really not engaging in any way, and you don't get that much more from showing up to class than not attending. Exams were terribly hard- there were often retractions of grades, regrading, and some questions even the TAs were stuck on.  At this point I have no idea what my grade is going to be, and the lack of excitement in this class makes me almost not care at all. I feel truly ambiguous about the whole experience. \nWorkload:\n3 exams, lowest is dropped, optional weekly hws. \n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "May 20, 2011",
            "review_content": "\nA very nice professor for Gen Chem 1, keeps the lectures pretty simple and straight forward, makes occasional jokes, and seems like a pretty chill guy on and off the lecture stage. He stricts closely to models and simplification, but I think that is how most intro chem classes would keep it anywhere. Sometimes in lectures he will add much more complex topics and details that you do not need to know, just need to know the general principles/concepts. \nHe is also painfully patient, stopping for every single question regardless of timing. While this is a good quality to have, it was painful for the class because we had a few people that just asked questions every class and every couple slides.\nThe only negative aspect to prof Savizky's teaching was that he did not relate a lot of the material to real world concepts. I wasn't really aware of this, however, until Prof Valentini guest lectured while Prof S was gone, and he spent over an hour on 6 short slides, providing examples and connections that we wouldn't have learned otherwise.  \n The homework is not collected/checked, however, to prepare for the quizzes and tests it is highly highly recommended. The quizzes I think depend on your TA, however, ours was Emma Dell, and her quizzes usually had tricks in each of them that would take off easy points, either from not reading the question closely or not realizing some exception to a rule.\n \nWorkload:\nThe first three exams followed the exact format that an earlier reviewer mentioned, there are about 17 very very simple concept questions, 3 mediocre questions, and then 5 very difficult, either consisting of subtle tricks/concept checks. These last ones were very commonly questions with \"none of the above\" answers, or \"which of the following are true\". Make sure you read the question closely, and I'd recommend underlining what the question is asking.\nThe final was a lot harder, the average was 34/50, and it HEAVILY focuses on the material from after the third exam. It was all so rushed in for our class, we did not know exactly what we were required to know because he barely began his last lecture and there were fewer homework questions about the material. \n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "June 01, 2010",
            "review_content": "\nProfessor Savizky's lectures manage to make a fairly interesting subject painfully boring. They are slow, and straight from his slides. \nI'm not sure if the professor knew this, but all of us had to take a Chem placement exam to get into chemistry. We know what a mole is. Going step by step through how to convert from grams to moles was not a good use of our time.\nSpeaking of ineffective uses of student time -- we spent 4 lectures on naming! Naming molecules is the kind of thing that comes to chem students over time with practice, not something we should be forced to memorize. Testing us on naming conventions is a lousy way to separate students. My friends who took Beer and Valentini for Gen Chem 1 didn't spend time on naming conventions for organic and inorganic molecules. Going through and making us memorize the names of functional groups without giving us an idea of what they're for, how they work, how to use them, is completely useless. it's not even teaching! It's basically just reading a list for an hour. \nThough I had some problems with Savizky's lectures (see above), it was even worse when he stopped to answer student questions. He should have left questions for section and office hours. Oh, and speaking of office hours, Savizky doesn't hold them. \"come ask me questions before class,\" does not equal office hours, especially since he was frequently not around before class. \nThe midterms were both too easy and too hard. I found the first midterm especially troubling. It contained 19 gimme questions -- questions so easy that one of them was \"which atomic number does not go with which atom?\" Of the final 6 questions, 4 were hard, but fair, and the other two were completely out of left field. Whether you get a B+ depends on whether you can answer the tough questions, whether you get an A depends on whether you can guess correctly. How is this an effective evaluation method? Why waste our time on the first 19 questions and have a curve based on 6 points? It's not an effective curve when the difference between an A and B comes down not to knowledge, but guessing between two answers, either of which you could argue for if it were an open ended test. \nThe final had a better curve, since Savizky tried to throw in some harder questions. His harder questions basically required math calculations, and if you hadn't memorized the formula, you were screwed, since they involved formulas that he hadn't told us to memorize and that weren't on the formula sheet (and no, I'm not talking PV=nRT level formulas).\nI did fine in this class (A-) but it was not a fun experience. Not overly painful, since it's really, really easy to get a B+ in the class (there is absolutely no chance you will fail--I know someone who got a 50 on the final and got a B+), but if you have the option of taking Chem 1 first semester, do.\nWorkload:\nWeekly quizzes that are somewhat based on the optional homework, 3 midterms drop 1, final.\n"
        },
        {
            "course_name": "General Chemistry I",
            "review_date": "April 17, 2009",
            "review_content": "\nProfessor Savizky is a nice guy and good professor. Even though he's an adjunct at Columbia and has another \"real\" job at Cooper Union, he makes a ton of time for his students here and is pretty much always in his office before class if you have questions. He answers his emails and posts his grades promptly as well. The exams are hit and miss - they often have tricky questions with \"none of the above\" and \" I, II and III\" or \"just II and II\" as answer choices. The first and thrid exams had pretty decent averages but the second was brutal - most people didn't finish and the average was a 15 out of 25. You do get to drop one though. The quizzes really depend on your TA. There was a marked difference between the two that we had. \nThe course organization was a bit off - quantum mechanics in the first week and the back to this is proton and a neutron after that. So that was a bit strange but if you can roll with things a bit out of order it is fine. Plus his entire semester's power points are online.\nI didn't do well in the class, but I can honestly say that if Professor Savizky lectures here again you shouldn't hesitate to take him. Besides the exams being tricky, everything else standard. Plus he's a really nice guy who often has interesting little \"how it works\" type things to say in lecture. \nWorkload:\n8 quizzes in recitation (2 dropped), 3 midterms (1 dropped), and a final. \n"
        }
    ]
}