{
    "prof_info": [
        {
            "prof_name": "Mingmin Shen",
            "prof_id": 3315,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Calculus II",
            "review_date": "July 06, 2008",
            "review_content": "\nExcellent instructor.  A lot of students find Calc II hard, and it is hard.  However, I thought Mingmin did a great job at explaining clearly and with simple words very complicated concepts....like when you get to the Power Series... ;/  Anyway, I highly recommend Mingmin, in case he is teaching when you need to take math.  he is a grad student, but I find him way more understandable than any prof so far!\n\nWorkload:\nDo it whatever it is...and you can do well in the exams... he is not like some crazy professors that give you tons and tons of homeworks, but totally unrelated to the exams.  \n"
        },
        {
            "course_name": "Calculus II",
            "review_date": "July 06, 2008",
            "review_content": "\nExcellent instructor.  A lot of students find Calc II hard, and it is hard.  However, I thought Mingmin did a great job at explaining clearly and with simple words very complicated concepts....like when you get to the Power Series... ;/  Anyway, I highly recommend Mingmin, in case he is teaching when you need to take math.  he is a grad student, but I find him way more understandable than any prof so far!\n\nWorkload:\nDo it whatever it is...and you can do well in the exams... he is not like some crazy professors that give you tons and tons of homeworks, but totally unrelated to the exams.  \n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "February 27, 2008",
            "review_content": "\nI disagree with the previous reviewer.  I think he/she does not have experience with taking math classes at Columbia, so he/she does not know the extent to what some other math instructors suck!  I find Mingmin a very good instructor.  He tries really hard to make things as easy and clear as possible.  Unfortunately, Calculus is not an easy subject, so you really need to put a lot of effort into it (i mean if you are bad at math).  \nAdvise: go to his office hours!  He has the talent of making you get it!!  And best... you don't feel stupid when you ask questions.  \nOk! having said that, if you haven't taken Calculus, I would strongly recommend Mingmin... or else pay the prize with professors that perhaps don't have an accent, but really really suck at teaching!\nWorkload:\nDo every bit of it... go to class, MEET with him, and you'll do great (Even if you are not a math weez!)\n"
        },
        {
            "course_name": "Calculus I",
            "review_date": "October 31, 2007",
            "review_content": "\nHe clearly is a very intelligent man, however, his heavy Chinese accent and lack of teaching skills (since he is a grad math student) make this class difficult. He doesn't explain things thoroughly enough and if you're not a math person I highly discourage taking his class. If you've taken a Calc class before and are for some reason in this class, then you probably will be fine because your already know the info. Otherwise, the class is very challenging, much as I like Mingmin as a person.\nWorkload:\nWorkload isn't too bad. One set of homework due from the book and online webwork due per week. Two midterms and one final. Midterms are only worth 15% each and final 40%.\n"
        }
    ]
}