{
    "prof_info": [
        {
            "prof_name": "Tom Yarnall",
            "prof_id": 2173,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Buddhist Ethics",
            "review_date": "May 22, 2011",
            "review_content": "\nI don't know why no one has written a review for Yarnall since 2004, but he's absolutely boss. He's incredibly wise and very kind, and his lectures are totally engaging. He is perhaps the calmest person I've met, but also really funny and great to talk with. I can't say enough about what an awesome man he is, and he really bonded with the whole class as did the students with each other by the end of the semester.\nThe class is not easy by any means, but it's a real pleasure and ultimately so rewarding to take. He runs the class as a cross between a lecture and discussion and there were something like 25-30 people, though it was a little awkward because we were in a lecture room twisting around constantly to hear people's comments in between his lecturing (though he said at the beginning of the semester he tried to get a discussion type classroom but couldn't so maybe this won't be an issue in the future). Prof. Yarnall expects a lot from his students, assigning like 200 pages of really dense reading per week fairly often and thorough courseworks postings on it. The upside is that you don't really have any grades until the final paper, which is a research paper on a topic of your choice within the topic. He stresses the courseworks deadlines and the no absence policy a lot in class, but I got the sense sometimes that if you're producing good work and not missing class too, too much he's not as strict as he seems. You have to go to class everyday as there's a sign in sheet that he will actually email you if you're not signed into for a day without an excuse. \nYarnall also stresses at the beginning of the semester that its good to have had a class in Buddhism before, and I highly suggest taking his advice. There were a couple really good students in the class who hadn't studied buddhism before, but the beginning of the semester will be tough because he teaches you essentially everything Indo-Tibetan buddhism teaches except in 2 weeks instead of a whole semester, and then gets much, much more in depth. That being said, I found this class ten times more interesting and rewarding than indo-tibetan, and while Thurman is a funny man, Yarnall is far clearer and more precise in his lectures, and very engaging. I felt like I came out of Buddhist ethics with a ten times better understanding of Buddhism. \nThe topic of ethics can get a little frustrating sometimes when Yarnall starts talking about some of the awesome metaphysical side of Buddhism but we can't spend more than one class on it because we're supposed to be focusing on the ethical side of Buddhism. The trajectory of the class after the first two or three weeks is pretty open-ended and Prof. Yarnall lets the students kind of pick what discussion/lecture is about, writing all of our questions from the end of the previous class on the board at the beginning of class and picking his way through them at whatever rate they take to answer. Sometimes a single question or topic would take up an entire class, other times he'd have a set topic to lecture on to steer us back on course, but he's open to everything which makes the class really interesting. He seems to know pretty much everything there is to know about buddhism, but he seemed just as interested and engaged in the ethical (and otherwise) debates the students had in class.\nAll in all, take this class or another class with Yarnall. He seriously inspired me on a daily basis, and even though it can be tough to keep up with the reading, you will come out of the class with an incredible new body of knowledge you won't soon forget. \nWorkload:\nHeavy reading from a variety of buddhist ethics books and online articles - not entirely necessary you do it all, but definitely the more you read the more you'll get from the class. \nWeekly courseworks postings on readings ~500 words - he stresses that they show you read everything and not be about some random page you opened to, but other than that open-ended. You cannot skip these postings, and he'll get mad if they're later than the 9 pm deadline which kind of sucks...\nNo midterm, and a 9-12 page final research paper (with a preliminary outline + sources due a month before)\nHe sounds like a hardass with guidelines, deadlines, etc. because he is kind of, but personally as a procrastinator (and sometimes kind of a slacker), I actually didn't find it a hassle at all, and it's a totally manageable class if you suck it up and just do what Yarnall wants you to do when he wants you to do it by. Only weekly postings and a final paper is really quite light in terms of written work, just get as much of the reading done as you can.\n"
        },
        {
            "course_name": "Junior Colloquium",
            "review_date": "September 14, 2004",
            "review_content": "\nOur class with Prof. Yarnal had probably the best dynamic of any class I've taken at Columbia.  It was basically 20 exceptionally bright - brilliant people with a lot of interesting things to say about a lot of interesting topics.  \nDiscussion at times was fragmented because everyone had something to say (a good thing in this class) but it was difficult to stay on one topic for long because it -- we'd go off on interesting and relevant, but somewhat off course tangents\nProf. Yarnal knew his stuff cold -- He helped illuminate the material and was very willing to take it all to the edge.  Intellectually exciting (although he does speak in a monotone).  He's  a Buddhism expert, which I found to be very helpful b/c it appears that a lot of questions of theory/method are discussed in fruitful ways in the Buddhist discourse.  Was ceratinly an eye-opener....\nIf you want an intellecutal expereince, take Prof. Yarnal, take the class.  \nWorkload:\na bunch of reading, (200 pages or so a week), weekly postings, 10 pager at the end.  Can get away w/o doing some readings, but you'll do them so you can take part in discussion...\n"
        }
    ]
}