{
    "prof_info": [
        {
            "prof_name": "Herbert S. Klein",
            "prof_id": 224,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "History of Brazil",
            "review_date": "April 26, 2004",
            "review_content": "\nKlein is one of the fastest lecturers I've had so far.  I have to agree with the previous reviewer's anology of \"fast & furious\".  He is, however, a fountain of knowledge!  He know everything about everything!  You will find him helpful and encouraging if you seek him out.  \nWorkload:\nChoice of take home final exam or survey 15-20pg paper.  Reading was fair.\n"
        },
        {
            "course_name": "History of Latin American Civilization, 1810 to present",
            "review_date": "December 31, 1999",
            "review_content": "\nHerb recites nothing but facts, fast and furious, but his easy requirements and Major Culture status packs the first few class meetings. Once people realize that all they've got to complete is a 15-pg take-home final based on the readings, attendance drops from 100 to 20 people per class, partly because the lectures are downright painful.\nWorkload:\n15-pg Final.\n"
        },
        {
            "course_name": "History of Latin American Civilization, Pre-Columbian to 1810",
            "review_date": "December 31, 1999",
            "review_content": "\nHis lectures are bland. Twice a week you meet for what he will surely call at the end of class \"a very quick survey\" of the topic just discussed. Grading consists of one paper on three separate topics discussed in lecture and/or in readings. It must be handed in before the reading period begins. Not necessary to go to all the lectures. Must go to at least to enough lectures so that you have heard about three entirely separate topics.\n"
        },
        {
            "course_name": "History of Latin American Civilization, Pre-Columbian to 1810",
            "review_date": "December 31, 1999",
            "review_content": "\nA friend and I signed up for this class to complete the list A major cutlures requirement. Beginning the 2nd week, and continuing every Tuesday and Thursday thereafter, we would meet up in front of the building before class. We would stand there, each with a pained look on our face, waiting for the other to make a move toward the door. About half the time either he or I would finally turn and walk in. The other half, after a minute of silence, one of us would say, \"Let's go to the bar.\" So much for class. This man is awful. Stay away unless you enjoy listening to boring, monotonous lectures and watching students get yelled at who walk in 30 second late.\nWorkload:\nA 15 pg take home final based primarily on the reading.\n"
        }
    ]
}