{
    "prof_info": [
        {
            "prof_name": "Paige West",
            "prof_id": 1006,
            "total_reviews": 35
        }
    ],
    "reviews": [
        {
            "course_name": null,
            "review_date": null,
            "review_content": null
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "December 28, 2010",
            "review_content": "\nProfessor West is a great lecturer. I feel like I would have hated this class had I not had Professor West. You must go to lecture if you want to do well in this course because most of the material from lecture is not covered in the readings and you will have to know it for the exams. The projects were fun and a nice way to get to know another part of the city. As long as you study your notes, the exams are definitely do-able. Overall a good course to take especially to fulfill a requirement. \nWorkload:\n2 papers, a midterm and a final\n"
        },
        {
            "course_name": "Anthropology of Consumption",
            "review_date": "January 21, 2009",
            "review_content": "\nAs awesome as everybody says, though a lot of it depends on the rest of your classmates. My seminar last fall was filled with really bright people, and so discussion was something you looked forward to each week.She starts out trying to be intense (she says she refuses e-mail, etc. etc) but it's all a pose. This class is always full, so she winds up kicking out non-anthro/non-seniors the first day. Readings were great, but don't buy the books - she changes the syllabus OFTEN.\nWorkload:\nParticipating regularly, one seminar presentation with a 4-5 page response, one final commodity ethnography paper that's 20-30 pages. My hunch is that she's an easy grader if you turn things in and open your mouth  at least once per class. I definitely did not expect the A I received.\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "May 21, 2008",
            "review_content": "\npaige is pretty cool. i enjoyed the class, and the TAs were good, but i have to say that i think paige's seminar classes are better (although i heard her interpretation section is the best). the lectures were interesting (more so in the second half of the semester). a problem i had, however, was that the readings were never discussed in lecture, or in section by the TA, so i had little ambition to actually do them. and you kind of need them for the midterm and final. i just scrambled during reading week to skim all of them. \nthe assignments, especially the second one, were really fun. it seemed that because they were so open ended, involved traveling and investigation, and actual thinking, not regurgitation, some students had issues with them (sorry, but not everything's spoon fed). the second one was a participant observation and left a lot of room for creativity. being an anthro major, i loved it.\n\nWorkload:\neasy during the semester, kind of stressful during reading week. but in the end, very easy. midterm and final turned out to be almost a joke. the assignments were really fun. lectures were interesting. basically a successful intro class.\n"
        },
        {
            "course_name": "Cultural Anthropolgy",
            "review_date": "April 08, 2008",
            "review_content": "\nDO NOT TAKE THIS CLASS!!!!!!\nPaige West is by far the worst professor I have had in my four years at college.  She is incredibly unprofessional to the point where students outright laugh at her during lecture.  I took this class because I was interested in taking an anthropology course, and had read relatively good reviews on CULPA, however  I am incredibly dissapointed in the class.  First, Professor West is constantly changing the syllabus and assignments. Most recently she pushed back the due date on an assignment, so that it fell during midterms-no thank you. In addition, because she is constantly changing the syllabus around (we've received two revised syllabii so far), towards the end of the semester the reading load is incredibly heavy-roughly 300 pages a week--completely absurd for an intro-level class.  Second, she takes forever to grade assignments--we received our first graded assignment the week after the p/f/d deadline.  Third, she teaches with a clear agenda-if you disagree with her extreme Marxist rantings, like myself, you will find her completely one-sided lectures unfulfilling.  Also, be warned-Professor West does not allow you to use a computer in her class-if she sees you with a computer she will make you put it away.  Professor West is incredibly scatter-brained in lecture, and often goes on lengthy tangents on completely unrelated subjects to anthropolgy. Our TA had to correct her numerous times in lecture on key names and dates--an indication of her style of teaching. Also, regarding the many comments posted on her style of dress, I must say that wearing see-through t-shirts and tops that expose your bra are not a style to emmulate in a classroom environment.  If you want to take an introductory Anthropology course look elsewhere!\nWorkload:\nHeavy readings (at least 300 pages a week-some readings better than others--one reading is on sex toys-no joke), 1 in-class midterm (based mainly on lectures-IDS with essay question on readings), 2 papers, 1 participant observation, 1 Final\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "September 09, 2006",
            "review_content": "\n\"I know you guys will rate me down on CULPA, but...\"\n-beginning of every class/explanation of homework assignment with Paige West (sorry Paige)\nThis class is grossly overrated. Paige West's lectures don't do as much to grab your attention as her clothing (her blinding sequined shirts can even be a distraction). After taking this course, I know little more than I did when I started about anthropology. Professor West went through the history of anthropology for about 3/4 of the semester, then crammed a few current topics in at the tail end. As for the readings, not once did she mention them in class and in discussion the TAs struggled to relate them to the lectures. If you do take this class, don't even bother buying any of the books. It's pointless (and Growing Up Global is quite possibly the worst book ever). It was frustrating to hear Professor West being so hypocritical all the time. Although the lectures often centered around being nonjudgmental and recognizing differences within groups of people, Prof West insisted on making sweeping generalizations about the studentes in the class and Columbia U students in general. She often told us that we were all \"so stressed out\" and over-obsess about grades, or that we all got 1600s on our SATs, which is just... annoying. (And false, from personal experience...)\nBasically, if you want a supereasy class and you can stand Paige West's cutesy attempts to relate to us young people, take this class. If not... don't?\nWorkload:\nShe showed Buffy in class. I think this is a reflection of how difficult this class is. Basically, you don't have to do the readings (esp the books), and you don't really have to go to class (those extra points she hands out aren't actually added to your grade). A few field work assignments. Easy midterm and final.\n"
        },
        {
            "course_name": "Anthropology of Consumption",
            "review_date": "May 11, 2006",
            "review_content": "\nI seem to be in the minority, but I really don't see why people love this course so much.  Prof West is intelligent and funny--yes--but it takes more than that to make a good class.  Her teaching essentially consisted of assigning pretty dense economic texts to a bunch of social science majors and then letting them present on the texts themselves with little interference from her.  Of course, most people didn't understand (or read) the texts, so this led absolutely nowhere, and inevitably half an hour into every class we'd start talking about OUR consumption patterns: i.e. the consumption and struggles of privileged Columbia students, as if that's what matters on a global scale.  We addressed pressing questions like, \"Why do we seek 'authentic' ethnic food?\" and \"Why is it girls can't order whiskey at bars and guys can't order cosmos?\" and \"Is it wrong to buy products because you like the advertising story behind them, even if they cost more?\"  An utter waste of time--and, worse (?), I felt like Prof West kind of knew that.\nWorkload:\nShow up and you get an A.\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "April 18, 2006",
            "review_content": "\nThis is my semester at Columbia, and out of all the courses I have taken, Paige West's class is the best one thus far. I made a fuss about being sent out of class for assignments off campus about 3 times, but now I understand and those times were very important to better understanding her concepts. She doesn't BS you at all and is young, sharp, articulate, super down to earth. She refuses e-mail because of the issues involving human contact , but she has office hours and people do see her. This class requires no previous experience with Anthropology, just an open mind. The stuff that we deal with in this class (Count Chocula, Hipsters, WB shows) would surprise most non-anthropology majors. Even if you're not an anthro major, I would reccomend this class anyway. Courses like this and professors like her are why I applied to this college in the first place.\nWorkload:\nNot difficult, but not easy either. About one book or article per week and a coursepack. You do need to use your brain in this class, but it is not busywork, it's worthwhile: 2 Participant observations (they were around 3-4 pages each), 2 papers on public space (for a total of about 6 pages combined), 1 midterm with 3 parts: short answer questions, fill-in-the-blanks and an essay. There is a mandatory discussion section and a final which I havent taken yet. \n"
        },
        {
            "course_name": "Anthropology of Consumption",
            "review_date": "December 11, 2004",
            "review_content": "\nAh, Paige West.  Here is the thing about her: she is the perfect combination of smart and daft (can discuss semiotics but can't work the room lights), tough and girly (she does karate and surfs but wears pink cowboy boots), and professorial and cool (she runs a killer class discussion where you have to keep on your toes, do the reading AND make smart comments and she has the class over for dinner at the end of the term and thinks it is funny when a student brings a case of Bud).  \nWorkload:\nHuge amounts of reading which you will want to do, one \"commodity ethnography\" which is fun to do, and LOTS of expectations about you brining your a** to class and participating.  \n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "January 18, 2004",
            "review_content": "\nI read reviews of this class before taking it, and until after the midterm I wasn't quite as excited about the professor or the way class was run as other people were.  The beginning texts, although when read again were fantastic, at first read were confusing in combination with her jumbled lectures which never really corresponded with what was being assigned to read.  The other thing, everyone in the lecture hall used laptops for about two thirds of the semester, and finally she banned them.  She kept saying how we didn't need to take all the notes we were taking, and she was right.  Lectures are important to attend, but very little of it will be necessary for the midterm and final.  Using a notebook all semester will force you to cut out all the things you will end up studying for no reason.\nBut the woman is incredible, I couldn't have asked for a more eye opening person to begin my undergraduate career with.  It's clear that all she wants is for the class to learn what she loves, and it's her enthusiasm that pushes everyone over the edge into loving the material themselves.  \nWorkload:\nI have only one semester to compare the amount of reading to, but in the least it was very easy to adjust.  Some practice fieldwork, and an ethnography is the only other thing assigned outside of class, which was rewarding and well worth the time spent, and more importantly doesn't need to be as long as you think, and most importantly she said she wasn't going to assign it again.  Midterm and final are based completely on readings, make sure you can compare authors.\n"
        },
        {
            "course_name": "Anthropology of Consumption",
            "review_date": "January 14, 2004",
            "review_content": "\nThis is a great professor and a great class.  West really knows her stuff in terms of anthropology, economics, sociology, and philosophy that she has you read in the class.  She is very smart, very articulate, and very funny (both at times that she means to be and at times when she has no idea that she is being). She is also one of the most engaging and charismatic speakers I have ever encountered.  I walked into this class simply wanting to take a class with West.  As an anthropology major I had heard that I had to take one with her before I graduated.  I walked out of the class wanting to study consumption issues for a Masters or PhD.  I can't say enough good things about West and this class. Every anthropology major (and everyone else for that matter) should take a class from her before they leave Columbia.\nI also feel the need to comment on some of the other reviews that state that she is \"openly left\" or \"political\" in class.  Actually, I thought that she was the most neutral professor I've had yet.  She was equally critical of the left and the right (when it came up).  She seems to see the world as ultimately f**ked up because of the way that capitalism and its agents have created a set of social relations between people where everything is about buying and selling things (ideas, people, images....).  I sort of see this as neither left nor right but rather as a true intellectual way of seeing social life.  \nShe is just a wonderful professor and a wonderful person.  My friends and I ran into West and her husband at the West End one night.  She stopped by our table, introduced herself and her husband to my friends and talked to us for about 10 minutes.  She seems to really care what we think about things, who we are, and what we are studying.  How many Columbia professors can you say that about? \nWorkload:\nLots of reading (which is all very good), one day of leading the class discussion, a final paper (she is super flexable about what you write about and if you are working on a senior thesis she lets you work on that if it is related to the class topic), and a final presentation. \n"
        },
        {
            "course_name": "Anthropology of Consumption",
            "review_date": "January 14, 2004",
            "review_content": "\nThis is a great professor and a great class.  West really knows her stuff in terms of anthropology, economics, sociology, and philosophy that she has you read in the class.  She is very smart, very articulate, and very funny (both at times that she means to be and at times when she has no idea that she is being). She is also one of the most engaging and charismatic speakers I have ever encountered.  I walked into this class simply wanting to take a class with West.  As an anthropology major I had heard that I had to take one with her before I graduated.  I walked out of the class wanting to study consumption issues for a Masters or PhD.  I can't say enough good things about West and this class. Every anthropology major (and everyone else for that matter) should take a class from her before they leave Columbia.\nI also feel the need to comment on some of the other reviews that state that she is \"openly left\" or \"political\" in class.  Actually, I thought that she was the most neutral professor I've had yet.  She was equally critical of the left and the right (when it came up).  She seems to see the world as ultimately f**ked up because of the way that capitalism and its agents have created a set of social relations between people where everything is about buying and selling things (ideas, people, images....).  I sort of see this as neither left nor right but rather as a true intellectual way of seeing social life.  \nShe is just a wonderful professor and a wonderful person.  My friends and I ran into West and her husband at the West End one night.  She stopped by our table, introduced herself and her husband to my friends and talked to us for about 10 minutes.  She seems to really care what we think about things, who we are, and what we are studying.  How many Columbia professors can you say that about? \nWorkload:\nLots of reading (which is all very good), one day of leading the class discussion, a final paper (she is super flexable about what you write about and if you are working on a senior thesis she lets you work on that if it is related to the class topic), and a final presentation. \n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "December 07, 2003",
            "review_content": "\nI don't care what anyone else says, Professor West is an amazing teacher. Yes, she is openly left-leaning and has very strong convictions that come through in her lectures, but she frequently encourages students to dissent, debate, and disagree with her, to form their own opinions and not just accept hers blindly. The outside reading is not completely relevant as they're not discussed in class, but the T.A.s are really helpful in the discussion sections in terms of forming connections between the readings and broader anthropology. Anyway, I would definitely recommend Professor West, and not just because she plays cool music as people are filing into class, wears great clothing (like a mini-skirt and cowboy boots), and shows \"Bladerunner\" for two classes. \nShe is smart, funny, interesting, and incredibly passionate about what she does. \nDefinitely take her class.\nWorkload:\nHeavy if you do all the work, not so bad if you don't (a big packet of readings, some of which are relevant, some of which aren't). Field notes and an 8-page participant observation. Midterm and a final.\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "December 04, 2003",
            "review_content": "\nThis woman is amazing. TAKE THIS CLASS! You wonÂ’t regret it! Not only does it fulfill a number of requirements, but also Professor West makes the class fun to go to. What can I say? Her lectures are enthralling and sometimes I wish I didnÂ’t have to take notes just so I can sit and bask in her speaking. Though for an intro class, there is a whole load of theory, which sometimes gets confusing but donÂ’t worry about it. Professor West and the TAÂ’s make the material highly accessible for those who never had background in anthropology. I feel like sheÂ’s the only professor IÂ’ve had that truly understands her students, telling us once or possibly more times that as Columbia students we should have a little fun and not worry so much. SheÂ’s funny, sheÂ’s hip and sheÂ’s just so cool. Her lectures are clear, organized and yes they do relate to the reading (though sometimes it did not follow the syllabus).  I recommend that you take this class or any class Professor West is teaching, though she is on leave next year. This class changed the way I saw the world and itÂ’s really how I imagined a college class to be and more so. Though, there are some students that complain about this class, maybe it is because of the question and answer times, but I say itÂ’s all worth it. The class is easy, but you will have to do the readings (most of them anyway) if you want to do really well. I'm really going to miss this class. \nWorkload:\nThe readings are moderate. It's not insane or anything. And towards the end there's a lot of interesting stuff to read. One midterm, one final, field notes, participation observation (fun to do)\nThere are weekly one hour discussion sessions that aren't required, but you should go to anyway because the TA really helps you go through some of the dense readings. Plus, there is, on occasions, some really amazing discussion time. The TA's themselves were incredibly interesting and unqiue in their own ways. All of them were approachable. I had Katie who completely rocked, she like West was not only intelligent but showed a lot of personality during discussion section. \n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "December 02, 2003",
            "review_content": "\nThis is the only class that I have had where after the last lecture of the semester the entire class applauded the professor.  West will make you think. West will make you laugh. West will sometimes REALLY make you laugh. West will remind you in about a million different ways why school is cool.  West will make you want to go out and read all the crazy theory shit she brings up in class.  She makes you want to find out more about social theory - that is huge!\nThe class is all based on the idea that social relationships, social instutions, and \"culture\" are made (she tells you this the last day of lecture - but you kind of have to be an idiot not to get it from about the second week after the mid term).  It is about learning how to disect, disconstruct, understand, and think about - the world.  \nAlso, West loves anthropology. Loves it. LOVES IT.  She tells great stories about her work in new guinea, gives the dirt on what it is really like to do fieldwork, literally jumps up and down when she is telling you about some stuff, and gives a couple of lectures on consumption that were so good that everyone in the class forgot to take notes - she was so freaking interesting.\nTAKE THIS CLASS - you will learn and you will walk away wanting to be an anthropologist.  \nWorkload:\nMid term exam, final exam, field notes and a final ethnography paper.  The mid term is not too hard, but you must do the reading.  The paper is a joke - totally fun to do and how in the world will they ever read 150 of them in a week? \n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "November 03, 2003",
            "review_content": "\nPaige West is really an amazing woman, and not because of her clothing. The class is all about ideas and theory, but it is masked in a large bombardment of fact. Dont let it fool you! Also, many of the students in the class are laden with internal agendas which make them either love or hate the particular works selected. Remember folks, its just an intro class, not an in-depth study, and no one is expecting any more. If you take it all in and make judgements for yourself, totally worthwhile. this class changed the way I think about the world and made me want to take more anthro classes, and thats exactly the point. \nWorkload:\nmidterm, final, field notes and participant observation.\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "November 02, 2003",
            "review_content": "\nWest is young, beautiful, brilliant and she seems to love anthropology.  This class, and this professor, will literally change the way that you see the world.  \nWorkload:\nHeavy reading, non manditory discussion sections (but you should go to them) mid - term exam and final exam, and one paper.  \n"
        },
        {
            "course_name": "Anthropology of Consumption",
            "review_date": "November 02, 2003",
            "review_content": "\nGreat Class.  This is the second seminar I've had with West and she is amazing.  The class is too big (most of her classes are) but she really lets you work through the readings in class and does not have a heavy hand in leading the discussions.  She is super smart but never makes you feel like you are not.  I will take a seminar from this woman every semster I have left here. \nWorkload:\nTons of reading, one discussion you lead, and a final project.  You have to come to class and talk in class. \n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "October 06, 2003",
            "review_content": "\nProfessor West tries to hard tp be hip, and in the end you learn nothing. Her take on anthropology makes it seem like a pseudoscience, a thing that quasi-flowerchildren do because its hip, and generally a supercilious field- all of which is sad because anthropology is exactly what our polarized, ethnocentric campus/tomorrow's society needs. Generally speaking her class is unengaging especially if you want to hear an academic contemporary's (her) take on the reading material. Her lectures are disjoint to the point where I question whether or not SHE thinks what shes saying makes sense and as a result,  people also ask stupid quesitons and by the end you just want to scream. \nWorkload:\nunrelated to class discussions, though engaging and fairly manageable.\n"
        },
        {
            "course_name": "Environment and Development",
            "review_date": "August 16, 2003",
            "review_content": "\nExcellent class - one of the best, if not the best I have had at Columbia.  West forces you to think about the reading, the subject, and the state of the world in new ways.  She is smart and is a good professor- enough said.  Other reviews seem to be obsessed with her personality, style, and youth. This seems silly to me - I'm paying to learn and to think, not to find a new best pal or a \"role model\"  One review says that she does not give good feedback - perhaps it was the class they took.  West commented, extensively, on my reaction papers and we had several long discussions about the class outside of class. I recommend the class for serious students who like to think new thoughts. \nWorkload:\nHeavy reading list, weekly reaction papers, and you must talk in class (she really does give you a grade for this)\n"
        },
        {
            "course_name": "Introduction to Environmental Anthropology",
            "review_date": "June 22, 2003",
            "review_content": "\nAs another reviewer said, this was the first year Paige taught this course.   And it shows.  The amount of reading was ridiculous and although she realized that and tried to cut it back, it was still heavy duty especially considering most anthropologists really can't write coherently.  Paige is extremely passionate and to a certain extent that is wonderful and engaging, however it does at times go over board and become almost unprofessional.  She is very open to students' ideas both in class discussion and in formatting projects which is good but hard for a non-anthro major with no background.  It would be better to take this course with anthro experience, something it would be nice if the course book said. However, it is entirely possible to get an A in this course by bullshiting, or at least it felt like bullshit to me.  And Paige does seem lazy in ways, particularly the in returning a draft of a paper with a perfect grade and absolutely no comments and the corner of the paper by the staple was not even crinkled. It's always nice to get good grades but...comments would be nice too.  She is nice, but I completely agree with the other reviewer's point that a truly, confidently nice person doens't have to point out how nice she is every lecture!  There are certainly good aspects to this course and Paige, but I would recommend it only with many, many reservations.\nWorkload:\nTons of reading, midterm and final that are fine if you prepare and bullshit, easy book review.\n"
        },
        {
            "course_name": "General review_content",
            "review_date": "May 18, 2003",
            "review_content": "\nPaige is an engaging and intellectually challenging professor. But apparently her critics on CULPA only care to comment on her fashion habits and their supposed contradiction with her Marxist orientation. \nPerhaps this criticism reflects more on their own superficiality than hers. I had Paige for many classes, and she was not \"lazy\" - rather she was quite dedicated to the materials. Yes, her lectures are a bit unorganized - all the more reason to take the seminars. For those who complain about her \"politics\", they should consider the responsibility of all scolars to wed academics and politics.  She is engaging and actually challenges her students to consider their responsibility for their place in the world. No wonder Columbia/Barnard students are uncomfortable!\nWorkload:\nFairly heavy on reading, but light paper assignments and fairly easy midterm final for intro class.\n"
        },
        {
            "course_name": "Environment and Development",
            "review_date": "April 30, 2003",
            "review_content": "\nThis is the best class I have taken here at Columbia.  West is brilliant, the material is fascinating, and the discussions will blow your mind.  She assigns too much reading, but it is so interesting that you want to do it all. \nWorkload:\nheavy but worth it. \n"
        },
        {
            "course_name": "Introduction to Language and Culture",
            "review_date": "March 22, 2003",
            "review_content": "\nWhile most students found Prof. West to be \"cool & hip,\" as well as an \"incredible dresser in vintage clothes with pink cowgirl boots,\" I was not impressed with her constant projection of her political views during almost every class.  My goal was to learn something about culture and anthropology - not hear an endless diatribe on the horrors of capitalism (from a woman so concerned with her appearance this seemed somewhat ridiculous & less than honest) and the greatness of Marx.  Overall I would recommend taking this class from someone more interested in teaching the subject than in making sure the \"correct\" moral/political projection is being made.\nWorkload:\nTons of reading which was generally not discussed in class and was written more for anthropologists (use of unnecessarily complex jargon rather than simple discription) than for someone wanting to learn about anthropology. Paper, ethnography project, mid-term & final.  But the READING was a burden!\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "February 12, 2003",
            "review_content": "\nThe previous reviews and reviewers are insane! West is smart, hilarious, cool, and a fantastic professor.  I am majoring in anthropology because of this class.  The whole deal with the class is that it is not so much about  learning a bunch of useless facts about anthropology but more about how to use theories from anthropology to understand the world.  What is cooler than that? \n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "January 24, 2003",
            "review_content": "\nI would take Organic Chemistry for fun if Paige West taught it.  What a terrific professor - brilliant, easygoing, down-to-earth, honest and fresh.  Lectures can get a little monotonous, but if you're going to take Interpretations of Culture, this is the best professor to do it with.  As long as you take good notes and attend every lecture, you'll be sure to do well on the midterm and final.  Prof. West is very accessible and eager to talk to students after class or in her office (you can catch her running laps at Dodge, too).  She assigns VERY heavy reading assignments, but there's only 1 course reader and it's not necessary to read it all thoroughly - just GO TO CLASS and her lecture will tell you what you need to know for the exam.  (Besides, if you're thinking about majoring in Anthro, you might as well get used to heavy reading!!)  I found her grading to be more than fair, especially since she'll let you rewrite a paper for a higher grade if she thinks you can improve on it, plus extra credit.  Definitely an A+ in my book.  \nWorkload:\nA LOT of reading, but comparable to any other introductory Anthro course... it's a better idea to attend lecture and take notes on her overview of each reading assignment.  Relatively easy papers with relatively lenient grading.  VERY easy midterm and decent final exam(definitions, matching, identifications, choice of short/long essay questions).  Suggestion: get a small study group together to exchange notes/outlines and review a week before each exam.  \n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "January 21, 2003",
            "review_content": "\nI'm really not sure what some other reviewers were saying about this being a \"ridiculously\" hard class.  While there is an impossible amount of reading, I didn't do one page of it and walked away with a B+. Prof. West covers all the points in class that are going to be on the midterm and final.  Don't waste your time on the reading, just look over your notes and don't be afraid to ask questions in class.  This is a great way to get out of some requirements, but may be better for some less obsessive students.  Just enjoy the lectures and remember that its an intro/ survey class, so she won't go into much depth about any one topic-- if you want more detailed information, take a higher level class.   Interpretation of Cultures is an easy class and she is a more than fair grader.  \nWorkload:\nMountains of ENTIRELY UNNECESSARY reading; easy, concept -based midterm + cumulative final.\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "January 17, 2003",
            "review_content": "\nShe's definitely a really cool woman.  Her flare and style come out in her fashion sense and the way in which she conducts the class.  She acts like a real person who you can talk to and relate to, though unlike one of the posters I'm pretty sure i don't want to be her...\nJust for clarification, the homework was NOT overwhelming.  Yes there was reading to do, but some were as short as 20 pages, and others, though longer, could be read easily within a couple of hours.  Most of the students were  Barnard students.  Take that in whatever way you wish...\nIf you put even a shred of thought into the homework and into understanding what she was trying to teach, then you can get an A.  She did cover more information than she was going to test on, but she spelled it all out for you.  Yes, even dumbed down the class at times, to make sure everybody understood important concepts.  (Ex. Unilinear social evolution was discussed almost every other class, and EVERYTHING related to it.  If that isn't enough evidence that it will be on the mid-term and on the final then I don't know what is.  If you missed that, you have only yourself to blame.)...\nShe did gloss over some very important topics but only because they did not relate to the class.  Topics like Marxism were dealt with really briefly in connection with other areas discussed, but weren't tested, so what's the problem?...\nIt's an introductory class, so no surprises that it covers a lot of information, most of which seems really boring.  ...\nI think Prof. West is a perfect example of how hard work can overcome any obstacle.  She's not the most brilliant professor I've met, but she obviously knows her stuff and really loves the subject...  \nThe class was huge, so her TA's helped her grade.  No comments on anything, but everybody i talked to (which was by no means representative of the 100 people in the class) got full credit on all assignments.  Yes, one of the TA's did grade much harder than the other, but Paige regraded all work that students thought was unfair.  That seems as good a solution as I can think of considering the circumstances....\nI think you could do much worse than to have her as a professor.\nWorkload:\nQuite a lot of reading, not all of which are necessary.  A few really easy assignments, midterm and final.\n"
        },
        {
            "course_name": "Introduction to Environmental Anthropology",
            "review_date": "January 15, 2003",
            "review_content": "\nWhile a nice person and probably not that bad of a lecturer, P.W., is unfortunately fresh out of grad school and v. against grade inflation/giving students a break.  She calculates grades without any sympathy or sense of reality.  You will get no break for trying or if you have a bad day on one of the exams.  As in, you can get a C-, even if you show up to class regularly and actually do most of the reading/study.  However, if you are good enough at bullshitting you will most likely get an easy A.  She also tends to assign way too much reading, although you need not actually read any of it since no one else does either.  While she has potential it would probably be best for those who havent fully developed their bullshitting techniques to be wary of her vicious grading until she gets more of a clue of how to grade like a non-robot.\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "January 02, 2003",
            "review_content": "\nIf you are a Columbia student who is interested in an \"easy\" Barnard class, this IS NOT FOR YOU.  This class is ridiculous.  The lectures consisted of non-stop power point presentations and tedious descriptions of anthropological \"history\", all of which West expected the students to record.  The copious readings were often unrelated to the class lectures, and although interesting, they were not discussed in conjuction with anything said in class.  Furthermore, students were expected to provide detailed answers about these readings on the midterm and the final.  Maybe this situation would have been improved with a discussion section, although the TAs were ridiculous in their own right.  As for the grading of assignments, Dr. West vaguely defined an ethnographical, 5-page work, making it seem as though she just wanted you to attempt an analysis of a social interaction.  She proceeded to grade the papers, without any comments, but rather harshly, especially after such a loose definition of what she wanted.  As for the midterms, she had her two TAs do the grading, and one graded much more severely than the other.  So, half of the class suffered as a result.  Dr. West presents herself in a childish manner, even when conversing with a student during office hours.  It is almost difficult to take this woman and her class seriously.  Of all the classes I took this semester, this was by far the worst!  And it is a Barnard class, none the less.  Be prepared for lots and lots of undiscussed reading, and a petty teacher who wears butterfly sequined tops and pink boots, and who asks her students (over 100 in a lecture)to stop hurting her feelings during class.  \nWorkload:\nMidterm, final, 2 ethnography papers, 3 article reviews and LOTS OF READING\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "December 22, 2002",
            "review_content": "\nPaige West is the best! I had her when she taught her first semester here, and besides being probably the only professor to come in wearing a hot pink coat and outrageous vintage clothes to class, she genuinely cares about her students...if you make the effort in class. Lectures are interesting, though sometimes repetitive, and though she's not good with email, you can see you see her around alot and her office hours are flexible...overall, it's a fun class, but beware! you might find out alot more info on papua new guinea than you ever thought possible...\nWorkload:\nlots of reading, most is not important, ethnography, a few papers and an easy midterm and final\n"
        },
        {
            "course_name": "Introduction to Environmental Anthropology",
            "review_date": "December 14, 2002",
            "review_content": "\nYes, I must agree that Professor West is cool like the other reviewers have stated. However, being neither an anthro major nor one of her seemingly many groupies, I was extraordinarily disappointed with this class. It was her first time teaching it, so perhaps I should not be so harsh, but the reading load assigned was preposterous (at least she realized as much) and her lectures in class were pointless and embarassingly unorganized. Another reviewer mentioned that she was lazy and I completely agree; she may be a little too laid back to be a professor. The topic of the class was really interesting for me and some of our reading extremely thought provoking, but she did little to devote any substantial time to them. This class has so much potential to be great, so I hope she gets her act together by next Fall when she teaches it again. Also, I beg to differ about the points that people have made in regards to her niceness. I've been to see her in office hours and she also seems to overstate a lot in class that she IS nice. Would a genuinely nice person need to be so verbal about it? \nWorkload:\nExtreme amounts of reading in expensive books and readers, but she recognizes this point and plans on cutting down on it. It's hard to tell what to read and what not to read and as previously mentioned by others, her exams are pretty easy although it was hard to study, since her class lectures were so disorganized that it was difficult to see what points she was trying to make. All in all, one midterm, one final, and one short book review (as if we didn't have enough to read already). \n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "December 09, 2002",
            "review_content": "\nAh...Paige West. I had a mild obsession with this woman this semester. Not because she's incredibly brilliant, but because I wanted to be her (men might feel differently, obviously). Despite being an Ivy League professor she wears the coolest vintage clothes, talks about going to Billy Bragg concerts and anti-war protests, calls people she likes \"rockstars,\" admits when she can't teach because she has a hangover, and actually complains that Columbia students work too hard and should have more fun. That being said, as a teacher, she's just alright. She tends to spoonfeed and dumb down (as in, she'll sum up Marx or orientalism in one slide of a powerpoint presentation) really interesting information that could be discussed much further. She also assigns really awesome reading, but never really covers it on the exams let alone in class. And, perhaps out of lazyness, she had a tendency to show movies or to bring in guest lecturers who frankly weren't as interesting as she was and didn't contribute much to the class. All in all, though, this class is a really easy and really awesome introduction to anthropology and you shouldn't miss learning from such an engaging personality. I'm definitely going to try and get into her seminars if only to have the opportunity to really hear what she has to say.\nWorkload:\nLOTS of reading, but it's really not necessary, exams tend to focus on material covered in lectures. mid-term, one page of field notes, 4-5 page \"participant observation,\" 3 article reviews, final. You have total freedom on the field assignments, so they can end up being really fun. She also gives lots of cool extra-credit assignments (going to lectures on Iraq, the Margaret Meade film festival, etc.) that are easy to complete.\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "April 21, 2002",
            "review_content": "\nPaige is awesome! This Southern gal is young, energetic, smart and down to earth...she is more like an older friend you would go out to have drinks with. She is unconventional in her frankness and relaxed attitude. You choose your own project for the etnography and choose a book on your own for your book review (apparently some people could not handle NOT being spoon fed and were complaining about it).She is a great lecturer, pours her heart out for her students, brings in movies, slides from her fieldwork in New Guinea, has great interaction with the TA and invited her to comment all the time, gives out all the dirty scoop about a career in anthropology and academia. Don't be afraid to ask her about anything: from fashion advice (she knows all about vintage clothes) to what to major in.\nWorkload:\nEasy in terms of workload but not easy grader...: she does not give out specific instructions or length for the papers, the tests remind you of high school and can be detailed. readings are really interesting: from Marx to nationalism in Hawaii to a study about Barry Manilow's obsessed fanatics.\n"
        },
        {
            "course_name": "The Interpretation Of Culture",
            "review_date": "April 21, 2002",
            "review_content": "\nPaige is awesome! This Southern gal is young, energetic, smart and down to earth...she is more like an older friend you would go out to have drinks with. She is unconventional in her frankness and relaxed attitude. You choose your own project for the etnography and choose a book on your own for your book review (apparently some people could not handle NOT being spoon fed and were complaining about it).She is a great lecturer, pours her heart out for her students, brings in movies, slides from her fieldwork in New Guinea, has great interaction with the TA and invited her to comment all the time, gives out all the dirty scoop about a career in anthropology and academia. Don't be afraid to ask her about anything: from fashion advice (she knows all about vintage clothes) to what to major in.\nWorkload:\nEasy in terms of workload but not easy grader...: she does not give out specific instructions or length for the papers, the tests remind you of high school and can be detailed. readings are really interesting: from Marx to nationalism in Hawaii to a study about Barry Manilow's obsessed fanatics.\n"
        }
    ]
}