{
    "prof_info": [
        {
            "prof_name": "Dennis Kristensen",
            "prof_id": 3216,
            "total_reviews": 7
        }
    ],
    "reviews": [
        {
            "course_name": "Introduction to Econometrics",
            "review_date": "December 25, 2010",
            "review_content": "\nOh well.\nI guess you guys don't have to decide which econometrics class to take depends on who's teaching it because, as you already took other stat. classes, professor doesn't really do anything in the class. I went to almost every class but after I finished the final I thought that it was not very helpful to attend all his lectures.\nDon't have to go to his lectures.\nJust stick on the power points that he gives you guys, and\ngo to STATA recitation! That's where the TA gives you the TRUE tips how to do the HWs. \nHWs were fairly hard and fairly easy. Not bad at all if you guys work in groups.\nAnyway, Kristensen was not bad, but in fact, econometrics itself doesn't really require students to be in the class. You just need a textbook and powerpoints! That's it.\nWho's teaching it doesn't really matter for Econometrics, I guess.\nGood luck!\np.s. I ended up B+ :)  Midterm and final was not hard at all, I just couldn't handle 5 courses last semester.\nWorkload:\n9 problems sets / 1 midterm / 1 final\nI felt that econometrics was easier than macro and micro so those guys who like math/stat you will do fine!\n"
        },
        {
            "course_name": "Introduction to Econometrics",
            "review_date": "January 06, 2009",
            "review_content": "\nI disagree with one of the reviewers below.  I thought prof kristensen while not a breath taker lecturer is not that bad.  i only disagreed in that his lectures were disconnected from exams.  he focuses in the math in the class, and gets you all worked out about the beauty of it... then like from an act of magic puff...math nowhere to be found in exams.  but he gave a fair final, i thought.  i was UTTERLY surprised the mean was so high in this class!  70 mean?  Mmm...either those same people that were in my stats went to Jupiter and came back brilliant...I am really really puzzled... \nanyway, don't be haters people, he is very nice and approachable, and i complain tons, so trust me he ain't bad.  go to his OH he'll explain to you what you have troubles getting by yourselves, your tutors...and so on.  \nif you kind of sucked in stats, i think you should take him as he focuses on the inference part of metrics.  but anyway, my best advise is that if you go shop around until you find your fit because metrics is meant to be kind of cool, so just find the right prof and you should be fine.\nanother thing i'll say...Culpa works.  so before you settled for the first week of breeze read culpa people ...   Take it all together and average out...it'll work.\nNow, go get the A.  \n\n"
        },
        {
            "course_name": "Introduction to Econometrics",
            "review_date": "January 06, 2009",
            "review_content": "\nDennis Kristensen is one of the the worst professors I've ever had. His lectures are mind-numbingly dull. I assure you, you will want to stab yourself to death with your pen from sheer boredom; on top of that, he has a slight accent, which, when coupled with boredom, gives his voice a rather hypnotic quality that will lull you to sleep within a few minutes of lecture.\nIn any case, there's no point in going, as he posts all his lecture notes on courseworks, and all he does in class are the proofs for the regressions and such (which never show up on the tests). He also has trouble with giving examples. He'll start one at the very beginning of class, go back to it tangentially a few times, and by the time you've gotten to the concept you were supposed to be exploring, forgotten about the example entirely. This is problematic when you try to do the problem sets (which are in general fair and quite do-able from reading the textbook and his lecture notes, if you aren't going to go to the class), because there will be so few practical application examples to guide you. Professor Kristensen may be a nice man but he cannot teach.\nI would say avoid at all costs, but I don't know how bad the other professors are, and besides it's fairly easy to coast through by just reading the textbook if you don't mind getting a B. The tests are generously curved and not too difficult.\nWorkload:\nAbout 1 problem set a week.\n"
        },
        {
            "course_name": "Introduction to Econometrics",
            "review_date": "January 04, 2009",
            "review_content": "\nI think the reviewer below is a bit too harsh.  I did excellent in Stats, and stats has been my favorite class.  I find the reviewer below somewhat mean.  \nI have all the reasons in the world to write bad about this class, as i went from the highest grade in Stats with a hard professor, to a very shallow grade in metrics.  but i still don't think he's bad.  i think he is a young professor, and as such there is a lot of improvement to do.  he experimented with providing lowest performers with a candy, a very easy go midterm, which represented my death in this class since I thought metrics would be as rigorous as Stats was.  but i think he made it even with a hard final.\nThat being said, I have no grudge against the prof.  i got the impression that he was really trying.  He is also very approachable, and unlike other econ profs with egos higher than the school, he is very grounded and willing to go over problem sets with you.  \nMy advise for those who take the class with him would be, to **study** from his lecture notes.  whether the exam is easy or hard, i think both the final and midterm were based on those notes (for the midterm i wasted my time doing all exercises in the book, going over ps ...the midterm was just interpretation and some normalization).  also a lot of students cheat, so be aware of that, it is hard to compete in an uneven floor.\nI was in love with metrics when I got in, but now I just want to forget about it.  But if you approach this class in the right way (that is, your performance in stats seems to be irrelevant for what you will do in metrics), you should be fine.\nGood luck (study the lecture notes)\nWorkload:\nps\nI agree, the TAs are terrible, except my TA who was an undergrad, she was fantastic and a shining light in this class.  \n"
        },
        {
            "course_name": "Introduction to Econometrics",
            "review_date": "January 02, 2009",
            "review_content": "\nAvoid at all costs!!  If you are a decent student, and able to get a bit Stats take Onaski or the other guy, not only you will learn the material, but actually get out of his class getting what econometrics is about.  i had to take a core so didn't take onaski: terrible mistake.  my friend took onaski, and he thinks it's the best class he ever took.  i also liked better my friend's book because it made more sense.\nThat being said, kristensen is a great guy, very approachable.  unfortunately, his obsession with the blackboard is really annoying.  i stopped going to class right before the midterm because anyway he repeated his lecture notes verbatim.\nBe careful his exams is nothing like his love affair with the blackboard, which are math proofs.  if what you care is only grades, memorize the concepts from his lectures (which he posts) and skip all the math, and you will be fine.  but you will not even know what regressions really are.\nHis team was just as bad if not a bit worse: in all 3 years at Columbia, I never had such a terrible group of careless TAs!  they often skipped office hours, graded ps a week after we turned them in.  often graded ps sets wrong, especially that prick victor.  but there was nobody to put some order to the class.  kristensen is too nice to instruct TAs, he was never capable of daring to change an obviously wrongly graded problem set, let alone an exam.\nin overall, kristensen may be the 'easiest' take in the market, but the price is that it may be the most boring class you'll ever take at CU, and don't worry too much about ps sets, anyway his TAs correct them in their sleep.  \n\nWorkload:\nweekly ps \n"
        },
        {
            "course_name": "Introduction to Econometrics",
            "review_date": "December 21, 2007",
            "review_content": "\nCompared to what else is out there for Econometrics and how theoretical this course can really be, Dennis is a good bet. His lectures are highly technical; he is basically a proof machine. However, none of this really has any relation to the problem sets and the tests as he - rightly - focuses on the practical stuff. Like the reviewer below said, Dennis focuses way too much on the blackboard and is more interested in getting through his notes than actually making sure everyone understands what he is teaching but he is undoubtedly clear and if you understand the theory, then perhaps this class can also be highly enjoyable. That said, most people didn't attend lectures (for obvious reasons) and the TAs are horrible and slow with grading - it's been three days after the final and the last problem set still hasn't been graded. Office hours are routinely skipped and they forced everyone to buy cheap, non-graphing calculators because they didn't want people storing formulas in TI-83s, which just shows you how much they trust the students. On the other hand, Dennis is very nice and approachable and will help with homework questions.\nWorkload:\n5 problem sets, not that difficult; midterm and final, generously curved. not bad at all for econometrics\n"
        },
        {
            "course_name": "Econometrics",
            "review_date": "April 01, 2007",
            "review_content": "\nThis class is not easy, and if you want a good instructor- dont take Dennis. Dennis might be excellent in his own personal work, and he might truly be nice person, but he lacks the most basic of teaching skills. He is obsessed with the blackboard and won't take his eyes of it even for a second, so don't bother raising your hand because he won't see it. In the few cases that question were asked, it is evident that he doesnt have a strong ability to respond to question and he tends to get confused, so it is almost impossible to understand him. Dennis has a laid back attitude, TA's are the same, and nothing is done in a timely manner by this staff. In a class of 80-100 student you can find on average 25 students present- it is very hard to get anything from lectures, so be prepared to do it all on your own. I had a strong as a student that no one really cares and that the staff is not coordinated among themselves. Plus, if you have a genuine interest in econometrics and you want to learn and get the most out of this class, dont take Dennis.\nGood Luck!!\nWorkload:\np.set due every two weeks. Exams are fair.\n"
        }
    ]
}