{
    "prof_info": [
        {
            "prof_name": "Karen Russell",
            "prof_id": 3367,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Beginning Fiction Writing",
            "review_date": "March 11, 2009",
            "review_content": "\nI strongly agree with the enthusiastic remarks made above.  I'd also like to add that Karen included Francine Prose's \"Reading Like a Writer\" into the syllabus, from which we read a short chapter every or two, and which really helped me keep focused in my own writing, as Prose gives many examples of how published writers accomplish certain things in their writing.  Also, Karen took time in class to talk about the daunting subject of 'where to go from here'; she does not shy away from talking to students about submitting their work to literary magazines, or other ways to get started in the field.  She is funny, insightful, kind- yet to-the-point and honest in her critique, and truly encouraging.  \nWorkload:\nFirst few weeks: exercises - 1/2 pg - 2 pg writing with specific styles or purpose\nEvery week: read three peer stories, and 1 pg double-spaced comments\n2x a semester: personal story submission (5-10 pg)\nEvery week: 2-3 published stories, + sometimes 1 ch from Francine Prose's \"Reading Like a Writer\"\n\n"
        },
        {
            "course_name": "Beginning Fiction Workshop",
            "review_date": "January 13, 2009",
            "review_content": "\nKaren is incredible! She is enthusiastic and very positive. The workshop was very interesting as well as highly educational.  I learned a lot, and it is the best course I have ever taken.  The readings are fascinating and Karen does an excellent job incorporating chemistry within the different writing styles. Amazing course and fabulous professor!\nWorkload:\n2 final stories, readings each week, editing 3 stories each week\n"
        },
        {
            "course_name": "Beginning Fiction Workshop",
            "review_date": "January 14, 2008",
            "review_content": "\nI CANNOT recommend Karen more highly. She is one of my favorite instructors at Columbia, and I loved her class. It was her first time teaching this class, and she was great. The first few weeks focus on reading and a few writing exercises, which aren't exactly graded, and Karen does a great job of guiding your writing and pointing out weaknesses. Then we workshopped for the remaining weeks, and Karen always allowed everyone to participate. She really helped me love fiction writing, something I had NO experience or particular interest in before last semester. Another plus--she's hilarious. If you can get Karen, you should absolutely take her class! \nWorkload:\nOnce a week writing exercises, 2 workshop pieces (5-10 pgs)\nFinal grade based on end of semester portfolio\n"
        }
    ]
}