{
    "prof_info": [
        {
            "prof_name": "Joseph Loizzo",
            "prof_id": 1966,
            "total_reviews": 2
        }
    ],
    "reviews": [
        {
            "course_name": "Science & Religion East & West",
            "review_date": "May 11, 2004",
            "review_content": "\nThis is the second class I have taken with Loizzo--there will not be a third. He's a nice guy, and he can be amusing at times, but for my money I want a teacher who can deliver a clear lecture and/or facilitate a class discussion.  Loizzo does neither.   He sputters and rambles and has trouble getting to the point.  There were some interesting readings but going to class was a huge waste of time.  I got nothing out of this course that I wouldn't have gotten by doing the readings on my own.\nAlso, don't be fooled by the title, you won't really learn about the science of religious experience.  In fact the few readings that actually had anything to do with science came at the tail end of the course, and after so much foreplay they didn't live up to expectations.  The subtitle \"The Nature and Culture of Contemplative States\" is more accurate.\nOn the up side--I'm not sure if he's actually a practicing Buddhist, but he's certainly compassionate when it comes to final grades. So if you like easy classes...\nWorkload:\nReading: 50-80 pages a week.  5 page midterm paper, 12-15 page final paper. \n"
        },
        {
            "course_name": "Science & Religion East & West",
            "review_date": "January 20, 2004",
            "review_content": "\nThis course is co-taught by Loizzo and Robert Pollack.  I found Loizzo to be the worse of the two professors.  For a Buddhist, he had quite the ego!  It often seemed as though he were trying to convert everyone to Buddhism.  It's OK to be excited and happy with your religion, but I didn't sign up for this course to get preached at.\nLoizzo gets VERY defensive when challenged.  it's difficult to say anything in response to his lectures, because he just wants to tell you you are wrong and shoot down your ideas.  (He is quite interested in hearing Pollack critique his arguments, though.  Pollack and Loizzo, in general, take each other seriously and do not take student contributions seriously at all.  They interpret student comments during class not as contributions to the discussions, but as requests for clarification of their much more important ideas.)  His religion=good/peaceful while secular society=bad/violent bias is really clear and really disgusting.\nOverall, the course is mainly philosophical and religious texts.  I was hoping it would explore the political and social clashes of science and religion throughout history, but there is pretty much NONE of this.  If you want to study this sort of stuff, don't take this course.  If you like philosophical and religious debate about huge questions such as \"What is the nature of consciousness?\" and \"Is there life after death?\"  you will probably love it.\nWorkload:\n1 short paper and 1 long paper on whatever you want to write about.  Lots of reading, only some of which is essential.\n"
        }
    ]
}