{
    "prof_info": [
        {
            "prof_name": "Etem Erol",
            "prof_id": 2044,
            "total_reviews": 4
        }
    ],
    "reviews": [
        {
            "course_name": "Intermediate Modern Turkish I",
            "review_date": "December 04, 2009",
            "review_content": "\nWho doesn't like Etem? He just exudes this vibe of enthusiasm and interest in his students. I learned more grammar in the class than I thought possible. The homework is manageable and the class has a really good learning environment. He makes a point of including everyone in class exercises (you can't hide!!), and if you fall behind on a topic he is willing to answer your questions after class or even tutor you during office hours. Also, I especially liked how he incorporated culture into the class because it makes you feel like you are actually learning about Turkey, not just doing rote memorization, plus it's good preparation if you're interested in continuing studying Turkish (which I definitely am, now!!). Wish he taught more classes, fantastic professor.\nWorkload:\nWeekly homework, occasional quizzes, tests. Pretty manageable, especially for a language course. \n"
        },
        {
            "course_name": "Intermediate Modern Turkish I",
            "review_date": "January 23, 2008",
            "review_content": "\nEtem is great.  You learn a lot of grammar in his class in between his politically incorrect commentary of everyone and everything.  He doesn't emphasize vocab, which is good because you don't have to memorize it, but also bad because you have to motivate yourself to learn it.  Expect to be called on and answer questions, as he talks to everyone in the room.  \nWorkload:\n3 assignments a week, starting out easy but becoming longer towards the end of the semester.  A few quizzes, but very, very highly curved. You can't get less than a B- in his class, and he tells you this.  He's very lax about everything.  If you don't know a vocab word on the quiz, cross it out and replace it with one you know, as long as you use it correctly, because vocab doesn't really count.\n"
        },
        {
            "course_name": "Intermediate Modern Turkish I",
            "review_date": "April 30, 2006",
            "review_content": "\nProfessor Erol is an excellent professor.  I highly recommend taking a class from him.  He is very patient (I think his only fault is that he is too patient sometimes), and though he is a busy person, he always seems to make time for his students.  His class is fun and low-key, and I feel like I learned a large amount of Turkish without most of the bullshit associated with many language classes. \nWorkload:\nMedium, though you can do more or less to suit your tastes. \n"
        },
        {
            "course_name": "Ottoman Turkish",
            "review_date": "April 24, 2004",
            "review_content": "\nThis is an awesome course! Mr. Erol is a great lecturer: exciting, amusing yet very serious when it comes to teaching people how to read the Turkish texts written in Ottoman script.\nI highly reccomend this course to everyone.\nWorkload:\nWeekly homeworks, not too much but keeps you on track.\n"
        }
    ]
}