{
    "prof_info": [
        {
            "prof_name": "Hyunkyu Yi",
            "prof_id": 1218,
            "total_reviews": 8
        }
    ],
    "reviews": [
        {
            "course_name": "Elementary Korean a",
            "review_date": "December 12, 2013",
            "review_content": "\nSongsaengnim Yi is without a doubt one of the best, if not the best, professor I have had at Columbia. i say this for three reasons. \n1. Although Korean is not that challenging of a language to learn intrinsically, Professor Yi teaches the course in an extremely structured way, which means you learn it very thoroughly. He gives you the background and history on a lot of the characters and their ties with both Chinese and sometimes Japanese characters. He is fluent in all three languages; this man knows his stuff. He's incredibly warm and approachable, but you'll immediately pick up on that fact so there's no need to get into that. \n2. He genuinely cares about you, both as a student trying to learn Korean and as a person. He will take the time to get to know you; he will ask what you do on the weekends, your campus involvement, your major, etc and he will remember it. He asks the class to eat with him at the faculty house once a semester and asks you to eat with him at the end of the year, and he truly wants to eat with you and talk to you.\n3. The workload he assigns is moderate, and he is always willing to work with you on it. If you're swamped, you can always ask to possibly turn the homework in the next class, and he will usually understand. He will also give you extra one-on-one practice time should you need it. He cares less about your grades (he is quite generous) and more about your experience and your learning of Korean. We even watch movies when we finish lessons. \nTake him if you can, I took him for Elementary A and B, and it upsets me that I don't get to have him for the next sequence. \nWorkload:\nWorkload- Two large quizzes, one midterm, one final. 8 vocabulary quizzes that are super easy and a final speaking project. I would say about 2.5 hours of work a week to gain sufficient knowledge, more if you actually care about learning Korean. \n"
        },
        {
            "course_name": "Elementary Korean a",
            "review_date": "August 27, 2011",
            "review_content": "\nYi Son Seng Nim was the best! He WANTS to give out As. He's thoughtful, and when I didn't show up to class once, he emailed me asking if I was ok and that he made me photocopies of the day's handouts. (I actually already told him I was not going to be in class because of an interview, but he totally forgot.) \nTake this class if you want to learn some Korean, have fun, and walk away with an A. \nWorkload:\nStandard. \n"
        },
        {
            "course_name": "Intermediate Korean I",
            "review_date": "December 27, 2009",
            "review_content": "\nHyunkyu, (Yi sun seng nim), is perhaps one of the most thoughtful professors on this campus. He understands that students taking this class have a wide range of skill. While some students might be native speakers looking to perfect writing grammar, others come in with a much more modest background. In all cases, he works tirelessly to improve your Korean proficiency. Everyday, he comes in with a lesson plan that corresponds to the textbook material. He is very organized and ensures that each student participates on a day to day basis.\nOccasionally, he'll bring in a Korean movie to watch for 15-30 minutes of the period. The class enjoyed these quite a bit.\nHyunkyu is such a lovable teacher, and many of his students plan to take Korean again with him in the following semester.\nWorkload:\nDaily homework from the Intermediate Korean workbook. These take anywhere from 30 minutes to 2 hours.\nOne short essay per chapter covered, usually due right before the lesson quiz.\nOne quiz per chapter (6 or 7 chapters)\nOne midterm (covering chapters 3/4 together)\nOne skit presentation w/ a partner.\nOne final (cumulative).\n"
        },
        {
            "course_name": "Intermediate Korean I",
            "review_date": "December 31, 2004",
            "review_content": "\nI absolutely loved this course!  Professor Yi was definitely the number one reason that I loved it so much.  I agree with all the previous reviews of him.  He definitely guides all his students.  He accommodates for those students who would like to delve a bit deeper in the language than the syllabus.  He also accommodates for his students when midterms, papers, and finals in OTHER classes become overbearing.  He also teaches much colloquial usage of the language, even though it's not textbook Korean.  He is very supportive of all his students endeavors.  I don't think I've had such a caring, thorough, and efficient teacher since my Spanish teacher in sophomore and junior years of high school.  It was a refreshing change of pace for a college student to take this class!\nWorkload:\nvery accommodating towards the students overall and on an individual level, tests and quizzes work according to the department's guidelines (a test every two chapters or so, and two quizzes - nouns and adjectives/verbs - for each chapter), homework is just enough to learn the material, may want to do a little more on the side to get a bit more usage practice\n"
        },
        {
            "course_name": "intermediate korean",
            "review_date": "November 16, 2004",
            "review_content": "\nFrom the first day of class to the last, I absolutely enjoyed every moment of it. Professor Yi is an awesome teacher because he knows how to break it down so that it makes sense. He makes some sense of the convoluted course books that are mandatory to read by the department, he brings everyone in class together, and he makes corny jokes that makes everyone roll their eyes but secretly we're all smiling inside... I completely understand why the previous reviewer actually changed their schedule to fit his.. if you have a choice, take his course.\n"
        },
        {
            "course_name": "intermediate korean",
            "review_date": "November 16, 2004",
            "review_content": "\nFrom the first day of class to the last, I absolutely enjoyed every moment of it. Professor Yi is an awesome teacher because he knows how to break it down so that it makes sense. He makes some sense of the convoluted course books that are mandatory to read by the department, he brings everyone in class together, and he makes corny jokes that makes everyone roll their eyes but secretly we're all smiling inside... I completely understand why the previous reviewer actually changed their schedule to fit his.. if you have a choice, take his course.\n"
        },
        {
            "course_name": "intermediate korean",
            "review_date": "May 19, 2003",
            "review_content": "\nI couldn't agree more with the previous review.  He is by far the best teacher in the department.  I actually arranged my schedule to fit the section he was teaching the second semester.  If he were teaching advanced I would seriously consider taking it despite the fact that I don't need any more language credits.  He's very understanding, funny, caring and an excellent teacher.  Definitely go for him if youre taking Korean.\nWorkload:\nAverage for a Korean course, very understanding about late homeworks\n"
        },
        {
            "course_name": "intermediate korean",
            "review_date": "September 24, 2002",
            "review_content": "\nthe best teacher in the korean language department! get him if you can. he's a gentle, considerate man that cares for his students. although class is sometimes a bit tedious, he tries to entertain the students with various stories. \nWorkload:\ncomparably lighter than the other sections of the same class\n"
        }
    ]
}