{
    "prof_info": [
        {
            "prof_name": "John Glasenapp",
            "prof_id": 13195,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Music Humanities",
            "review_date": "April 19, 2016",
            "review_content": "\nBEWARE! \nFirst off, Glasenapp is a nice and approachable guy nice. With that being said, this was without a doubt the hardest class I've taken in my life to date (and my GPA now reflects that). As a global core, music humanities should not be as hard as Glasenapp made it. He's definitely passionate in this subject (which is why he is pursuing a PhD in it) and while that is admirable, he fails to realize most (all) of the kids in his class do not share that same passion. If you have not studied/played music your whole life and don't want most of your studying to be in music hum then there's not a shot in hell you'll get a good grade. If classical music is your passion, then you will probably do alright in this class. Not because you'll be able to cruise by, but because you'll be willing to put in the work necessary to get that grade. For example, there was a kid who plays and studied classical music that actually dropped the class more than halfway through the course, and then there's the kid who played and studied classical music who got an A but did all the readings and what not. He is a relatively harsh grader and doesn't care if you've never seen an instrument in your life. He will grade you just as harsh as the kids who have grown up around classical music and assumes dense and complicated information is common knowledge because he's so knowledgeable. While I'm trying to memorize and recognize 30 songs from 6 different composers for a mid term, a friend of mine who's taking the same course at the same time in a different section is memorizing 6 songs by 3 composers. He commonly mocks other music hum professors who take the course more lightly. Beware. \nWorkload:\nDense weekly readings, 2 papers, mid-term, and final. \n"
        }
    ]
}