{
    "prof_info": [
        {
            "prof_name": "Eugene Galanter",
            "prof_id": 178,
            "total_reviews": 47
        }
    ],
    "reviews": [
        {
            "course_name": "Science of Psychology",
            "review_date": "March 27, 2006",
            "review_content": "\nI have never actually written a culpa review, but after reading the amazingly broad spectrum of reviews on Galanter, I am tempted to offer my own opinions on his course (keep in mind I am not 'bitter', I received an A-range grade in this class). Eugene Galanter is clearly a genius-or incredibly skilled at imitating one. This course however, can best be described as \"muddy\". His lectures are a drag, and without any statistics background they can be tremendously difficult to follow. Often I just ended up typing whatever I could catch, and staring at my notes in frustration and terror at the end of the day/week/unit. On the first day he puts a simple equation on the board and suggests that it is all the mathematics you need to know to do this course. Technically, he is right (I mean, I did it), but be prepared for much much more difficulty than that particular equation suggests. The lectures often digress into anecdotal chatter about Galanter's personal history, all of which is amusing and interesting and impressive but has nothing to do with the material. However, you cannot skip them entirely because often times a few questions on his thirty-question (or so) quizzes are pulled from sentences he uses in class. Verbatim. The readings are much more central to the quizzes (which I agree are really 'exams') but it is impossible to keep up with the syllabus because it has nothing to do with Galanter's lectures. You will be reading cute stories about Freud's youth long before he touches on the topic in class, which brings me to another point about the readings: they're scattered, and a large portion is anecdotal (like you cared about Pavlov's wife?). Furthermore, they're on CD, so if you're like me and prefer to highlight and make notes on the reading you'll be printing like a mad woman. If the INTENSE stack of readings you must review for the quizzes isn't enough, the TAs occasionally add some more on courseworks (and yes they pop up on the test). Of course, the oft-complained-of format can be a bit annoying but isn't impossible, my best reccomendation is to review your quiz three times before you hand it in (if you show up on time for it you'll have plenty of time to do this and still leave early) and of course, just make your own notes off of the readings. You can do well in this, but you will not enjoy it (and may break down and cry in the night's previous to the exam). Honestly, despite my respect for Galanter, you will end up frustrated and bored. If you're using it for the CORE, take it with a friend and try and split the workload. \nWorkload:\nThree queerly formatted quizzes, intense stack of readings you'll end up doing the night before the quizzes.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "February 27, 2006",
            "review_content": "\nDante's Inferno is the best way to desscribe this class. Galanter does not give quizzes, he gives incredibly frustrating tests. The questions are multiple choice, but he wants you to circle the incorrect answers. If you accidently circle the correct answer, he penalizes you by taking points off your test grade. As a result, many students received minus deviations throughout the semster. According to one of the TAs, the lowest grade in our class on the first test was a -40. Example questions that Galanter may ask are: \"Pavlov is to Fechner as Frued is to...,\"  \"If X is the total number of students comprising Columbia's student body and Y = the total number of females under the age of 20, what does N represent?\" And to the reviewer who says that Galanter curves final grades because he got a B+; I also received a D in this class. \nWorkload:\n3 tests; 3 credits from experiment particpaition; 300-400 pages of reading per week.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "February 01, 2006",
            "review_content": "\nTo start with the most important thing, I am glad that I took Science of Psychology with Galanter.  That said, I don't think he's for everyone.  Some of the lectures were quite vague and difficult to understand.  He went off on tangents and told bizarre stories.  The TA's during the review sessions (which were held during normal lecture time the class before the test) were far better at lucidly explaining the material.  The readings (Galanter's own books) were... a little hard to get through, but provided some entertaining writing and good information.  The worst part about the readings was that they came on CD, and there were very few pictures and diagrams (I sound like a kindergartener), and I think for a course like psychology that could've been helpful.  That's the thing, the class didn't really feel like a science class.  That may be because I had the wrong impression of what psychology is going into it, but needless to say it didn't feel too scientific.  I came away with a decent grasp of what psychology is, but my favorite part of the course was just hearing Galanter's rants.  He is clearly a brilliant man, and he's been around.  He received his PhD from Penn in the 50's if I remember correctly and has worked with some of the brightest psychologists of all time.  He himself was quite a scholar in his day.  So, spending some time in his world was fun.  The grading was based on three heavily curved multiple choice exams with the gimmick that you choose the three wrong answers instead of the one right one in order to receive points, to discourage guessing.  Did I mention they are open note?  I missed a lecture or two, took decent but not fantastic notes, and copied the relevant material from the readings (which we were allowed to do) the night before and cruised to an A+ in the class.  I'm not sure if the people in the class were that dumb and/or were thrown off by the \"select the wrong answers\" instruction, or maybe I'm just that smart, who knows, but I thought it was an easy class.  Your mileage may vary.  In summary, I'm not sure if I learned as much psych as I could've from another teacher, but I think the unique experience of hearing Galanter ramble combined with the ease of the course made it a good choice.\nWorkload:\nSome reading that is completely unnecessary to do until the night before the test.  Three tests evenly dispersed throughout the semester are the only factors in grading, and they are open note.  There is no \"final,\" the test is on the last day of class, which is an added bonus.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "February 01, 2006",
            "review_content": "\nI feel compelled to add one important thing to my previous review after reading them.  I have no clue how someone received a D in the class after finishing in the middle of the pack on the exams.  On all three exams, I scored one or two points above the mean+SD.  I received an A+.  I saw someone arguing that the class was not curved.  How do you explain me getting somewhere around 85% correct answers on the tests and receiving an A+ if there is no curve?  Unbelievable.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "January 25, 2006",
            "review_content": "\nOne word - Wow.  Never thought I'd ever take the time to write on culpa, but I feel compelled to help as many students as possible.  Wow.  And for the people who gave positive reviews of the man and his class - Wow.  Wow.  Wow.  Wow.\nWorkload:\nWOW\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "January 13, 2006",
            "review_content": "\nI completely agree with the last review in that if you have not previously taken any courses in statistics, you will have absolutely no idea what he is talking about a great deal of the time.\nThe \"quizzes\" (exams, really) have the most ridiculous format I've ever encountered.  Rather than select the 1 correct answer, you are supposed to cross off the 3 out of the 4 incorrect answers.\nThe review sessions held by the T.A.'s prior to each quiz are useless.  The handout they give you which lists all of the topics and historical figures you should know to prepare for the test will simply be a waste of your time if you adhere to it, because half the topics on the review sheet won't even be on the quiz.\nThe lectures are terribly boring, with more than half the class not even showing up anymore after the first quiz and those that do either spend the 75 minutes IM'ing or playing solitaire.  If you're lucky, every once in a while Galanter will crack a joke that is remotely funny but most of the time you will be bored to tears as he simply regurgitates from his own writings which are all circa 1962 and written in a fashion that make even the most intelligent student at times feel like an idiot.\nMy advice:  don't walk, but run as far away from this class as you possibly can.   \nWorkload:\nTons of reading, 3 open notes quizzes (which are NOT curved contrary to previous reviews), no midterm and no final.  Also, 3 hours of required \"experimental\" participation.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "December 28, 2005",
            "review_content": "\nThis class blows!!! At first it seems great because there are only three open note quizes and no papers or finals but I urge you all to resist the temptation to take this class. There are mountains of reading and the text/\nlectures don't relate very well to the exams. Often it seemed like exam questions were worded in the most convoluted and intentionaly misleading way possible so that even if you knew what the questions were trying to ask you couldn't answer them anyway. The guest lecturers and the TA lead review sessions make you realize how little you're learning and the horrible test scores pretty much across the board would lead you to believe they would have to curve (keep dreaming). I went to every single lecture, did the readings, did the full six credits of psych tests, was right around the middle of the pack for every exam and I got a D in this class. AVOID AT ALL COSTS !!!!\nWorkload:\nLots of reading from Galatner and his pal's outdated texts. \nDon't worry though because it hardly relates to or compliments the lectures very well. There was a formula on one of the tests I had never even seen before and, like I said, I actually did the reading and went to class. There are three open note quizes. The open notebook helps but the questions are so strangely worded in many cases it won't help even if you know what they're trying to ask. \nYou also have to complete six credits of psychological experiments which supposedly end up as extra credit but it didn't help me at all. This whole class must be some kind of psychological experiment....\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "December 19, 2005",
            "review_content": "\nEveryone else has said it and I agree. He is the most confusing professor ever. He teaches 1/12th of what he tests you on and words the tests so that if you are not a statistician you will not understand what he is talking about. \nI knew he was horrendous from the CULPA reviews before I took him but I wanted to get my sciences out of the way and his class was the only one that fit so I took it. \nHe does give you plenty of time to get out of the class. He gives 2 of the 3 quizzes and the grades for them before the end of the drop/add period and a boat load of students leave the class. I didn't drop after the second quiz because I could not afford to lose the money and my Dean said that the science classes at Columbia don't get much easier than this. I have to disagree with my Dean. There are much easier science classes if for no other reason than that there are professors who coherently teach 80-100% of what will be on their tests. This intro level class was a traumatic, anxiety ridden experience. He is a founder of cognitive psychology -- I guess that's why he is still teaching but he should just be writing books and doing some sort of research. He doesn't belong in a classroom. \nGood points : They return the grades quickly--usually within 2-3 days. The TAs know most people are struggling and are available to help you understand things. You get credit for your scores improving -- at least you did this semester. I don't know how he is going to change his policy next year. \nAdvice: If you have to take this class, when you take your quizzes leave all questions of which you are not sure of the answer Blank -- I know this is hard because we are use to being know it alls who answer all the questions but leave it blank. \nAn unanswered question is your best friend. \nI got a B+\nWorkload:\nThree atrocious quizzes and the readings \n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "December 18, 2005",
            "review_content": "\nHorrible. If you are looking to flunk out of Columbia, you're more than welcome to take this course. I signed up for the course with an interest in psychology, and now I regret it more than anything. Did not think it was going to be an easy class by any means, but wasn't expecting to be a bomb either. I repeat, DO NOT TAKE THIS CLASS unless you're a psych major!!!!!! Can't give you any more warning than this.\nWorkload:\nMassive amounts of reading, and nothing else. It seemed like heaven at first, since you don't have to worry about papers or even a final. But the exams do NOT test your knowledge of the material. \n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "December 18, 2005",
            "review_content": "\nI would not recommend this class for students who want a true introduction to psychology.  It seems that Galanter, who is old but still quick and funny, is more interested in sharing what he thinks is important in psychology than giving a true introduction to the discipline.\nWorkload:\nthere is much required reading, however you can completely pace yourself as the lectures are wholly unnecessary and do not correspond to the readings. 3 non-cumulative exams with a curve.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "July 27, 2005",
            "review_content": "\nNormally I don't bother to review on CULPA; however, I feel that all of the positive reviews about Galanter are incredibly misleading. It is obvious that only the students who \"aced\" this class are the ones attempting to elevate Galanter from a pompous piece of garbage to the level of a human being. What you should bear in mind is the huge number of students - about 50 - who withdrew from this section. Among them were a number of  psychology majors. I know this for a fact as 3 psych majors withdrew from our study group. Galanter's \"readings\" consist entirely of books that he has written. Bear in mind: Galanter's books are geared towards his contemporaries in the psychology field - NOT undergraduates. There is no logical cohesion between lectures, the texts, and the syllabus. If there is a topic or formula that is unclear to you, then good luck finding an answer.  Galanter tells the class: \"Direct all questions to the TAs.\" The TAs in turn, were just as lost as the students. Originally there was to be a disucssion section, but Galanter decided that it was unecessary. After all, every student is well versed in statistics, as well as fluent in Latin. Which are required to understand several of the formulas.  Personally, I think the glowing reviews about Galanter's class were posted by the TAs, or Galanter himself. Galanter will most likely  remain in your memories far after the class ends as THE WORST Professor you will have at Columbia. I realize the intense negativity I am imbuing into this review, but it works to balance out all of the unfair \"positive\" repsonses on this class. If you are thinking of enrolling, ask around for feedback on Galanter. I am certain there are more students with hatred for this man, then there are with love.\nWorkload:\n3 tests &  forget about the experiment participation - it's only used as extra credit in the end. \n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "January 23, 2005",
            "review_content": "\nGalanter is not the greatest lecturer in the world.  He could be best described as \"meandering.\"  This is not to say his lectures aren't enjoyable, as they often are. \nHowever, I often found myself leaving class wondering if my attendance was worth anything.  Contrary to popular opinion, the most valuable part of 1001 for me was the readings.  Not all were the most interesting, but holistically they form a pretty good overview of the subject's basic areas of study.  Galanter's choices are about 50 years old, including the ones he wrote.  WIth a few exceptions they were very easy to get through, if not the freshest of material.  Given the course's historical approach, a little age is nothing to despair.  His quizzes are hard, frustratingly so, even if you've done the readings and attended every lecture.  Nearly everyone does poorly so the curve is quite generous.  As others have remarked, doing the readings and attending lectures is sure to earn you an A.\nWorkload:\nFair amount of reading, easy if you pace yourself, and 3 very difficult 50 minute, open book, open note quizzes that are curved generously.  Also, 3 hours of experimental participation is required, although it became extra credit for my section.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "January 18, 2005",
            "review_content": "\nWARNING - this is not a class for slackers. You will get an A in this class if you do the readings, take notes on the readings, and attend and take notes during class. Easily. However, the readings are incredible dry and lengthy so good luck with that. Galanter is a quirky firecracker of an old, old man, making lectures more than entertaining. He sang to us in morse code once. If you want a B or B+ then you should do some of the reading if you have time, go to as many classes as possible, but most importantly share notes with other people - the tests are open-book . \nWorkload:\nlots of boring readings, 3 50 minute quizzes that are difficult but graded on a curve and most people do shittily anyways. COMPLETE YOUR LAB HOURS or your grade will be hurt\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "January 17, 2005",
            "review_content": "\nMan he was really funny that first day of class....  After that every class got a little bit worse.  By the midterm I had stopped going alltogether.  I got a B could have been better but I didn't do the experiments, and never went to class.  If you do manage to learn something congrats you're the first.\nWorkload:\n3 tests which are tricky I don't care if it's a better way to test.  And don't drop as i almost did after the first test.... turns out 37 is above average and more than a few people get in the negative,\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "January 11, 2005",
            "review_content": "\nOnce you get over Galanter's senile funniness (the type of humor you'd get from walking around a nursing home) he is a terrible lecturer who made me contemplate taking my own life each and every time I sat down in his class. It was a gamble with longshot odds every time i went to class whether i could come away with something remotely valuable. the way he speaks (and writes in his textbook) is very difficult to understand and makes me hate him even more.  I thought i was failing the class until i got my A. So i guess you can do well in the class if you are willing to put up with massive BS and not learn a damn thing. if you do decide to take the class, i urge you to not spend 35$ on his stupid CD and copy it from someone\nWorkload:\n3 open note quizes, incredibly difficult but the final grades are wicked curved. sometimes he let us use laptops which was great because you can search thru some of your texts. students must complete 6 experiments, which are a pain, but they turn out not to  be mandatory, but extra credit. turn in corrections to his impenetrable textbooks to recieve more EC\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "January 07, 2005",
            "review_content": "\nI would definitely reccomend this class, if only to fill part of your science requirement.  Galanter is, as another reviewer said, basically senile, but he's hysterically funny.  He also made major contributions to the field of psychology, so he really knows what he's talking about.  The lectures vary between very interesting - both because of the material and because of his random stories - and sleep-inducing.  There are three \"quizzes\" (50 minute multiple choice tests), but they're based more on extensive reading than lecture notes and are open book.\nWorkload:\nthree open book \"quizzes\" based on extensive reading\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "January 04, 2005",
            "review_content": "\nGalanter is the best guy ever!! He's guaranteed to keep you entertained throughout the whole lecture, but that's where the fun ends. The class was tough, but I learned a lot. I recommend this class to someone who has plenty of time to do all the readings assigned for the quizzes and attend all the lectures. \nWorkload:\nThe class is only 3 quizzes and you are given 4 choices and you must pick the 3 incorrect ones or you will end up with a negative score.  Heavy reading load for the quizzes. \n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "December 21, 2004",
            "review_content": "\nThis was a very interesting class.  Galanter looks like he's about to keel over and die but he is actually very competent and often entertaining as well.  Lectures are often hard to follow and have very little to do with the readings.  So you have to do both.  There are 3 midterms and they are hard but the curve is good so don't worry.  There is no writing in this class, only multiple choice so it's an excellent non-tech for us engineers.\nWorkload:\nOn the first day he tells you all the readings you have to do for the semester.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "December 01, 2004",
            "review_content": "\nYes, this class fills a science requirement.  And yes, there are only 3 quizzes all semester.  But this man is nuts.\nI mean that in a nice way, actually.  On a scale from one to senile, Galanter should be in a nursing home, but he's quite entertaining from time to time.  \"No one on earth understands the Finns and the Hungarians, and I firmly believe that this is because they are extraterrestrials.\"  What?  Oh man.  You don't need to go to the lectures, the readings are all on a cd so you only pay $35 for all of your books, and the quizzes are open notebook.  If you do the readings, and show up on occassion, it's an easy class.  Boring usually, but easy.\nWorkload:\n3 open notebook quizzes (although each quiz is on 20 chapters of material, so open notebook doesn't make that much of a difference unless you know where everything is).  No midterm or final.\n"
        },
        {
            "course_name": "Education Evaluation and Diagnosis",
            "review_date": "November 14, 2004",
            "review_content": "\nWhile many seem to think his Science of Psych course is boring and deficient, the small seminar setting of his Education Eval. course really brings out the humor, interest and genius of this professor.  It was really touching and encouraging to hear that after a full and amazing lifetime ( I won't spoil any stories for those intending to take this class, but boy does he have some great ones) he has decided that the most important thing to do in life is to try and figure out how to teach others correctly.  While he by no means attempts to say he knows how this is to be done, the class is all about researching and exploring different measurements and techniques to try and get closer to determining the \"correct\" way of teaching from birth on, touching on issues such as socio-economic, gender, race differences, IQ and \"intelligence.\"  If you are at all interested in going into the education field as a teacher or policy maker I would highly recommend this class as one of the best I have taken in the Psychology department at Columbia.\nWorkload:\nOne \"take-home\" midterm that is pretty hard but doesn't count for a whole lot more than making sure you are reading articles he assigns and understanding concepts and statistics.  One long paper due at the end on an education topic of your choice.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "May 11, 2004",
            "review_content": "\nNo offense to all who posted before me, but this class was by far the easiest class I have ever taken in Columbia. You just do the readings the night before, and take the 3 OPEN BOOK, OPEN NOTE quizzes. Everyone seems to bitch about his multiple choice method where u check the wrong answers, but really it just allows you to pick up free points even when you dont know the answer, by checking the obviiously wrong answers. i slept through most of the lectures, writing notes in my sleep, but the quizzes are fairly redundant, with most questions just a different wording than some previous ones. Granted, you wont learn a damned thing. Galantar seemed to be teaching us psychological breakthoughs of the 1940's rather anything current or interesting. Although, he's your typical old fart with great old fart humor. \nNormally, Id hate to bust everyone else's balls, but I feel I owe the Columbia community a service by recommending this class - trust me, it is not nearly as hard as these reviews make it out, and I know for certain that other students agree with me. And all the reviews from previous semesters agree with me. Did the 1,000 yr old Galantar change his tests and grading policies all of a sudden for this past semester and make his class harder? doubtful.\nThis IS the science requirement to take.\nWorkload:\n3 quizzes. yes, they were tricky, but with open notes and open book, very very very easy. and that's all! the readings were all doable in a cram session the night before. probably the lightest workload for the science requirement.\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "April 12, 2004",
            "review_content": "\nGalanter is so confusing and absurd that it wasn't even amusing.  I'm a psych major and I had to take this course after I'd already taken 4 advanced psych courses . . . thank god I did because it was only thanks to the things I learned in the other classes that I survived his \"quizzes.\"  Really, there was not one answer that I got right that wasn't because of things I had learned elsewhere.  Unbelievable.  So for anyone taking this as a Psych department requirement, DO WHAT I DID: take Mind Brain Behavior, take a few more advanced courses, THEN go back and take this course.  You'll completely unfairly get an A . . . just bring tissues for your crying classmates.\nWorkload:\n3 absurd tests\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "January 20, 2004",
            "review_content": "\nDO NOT TAKE THIS CLASS!! The only explanation for why there are some positive reviews of this class is because Galanter USED TO curve each individual quiz grade, and then curve at the end.  Now he ONLY curves the grades at the end of the semester, but it isn't very much help since the quizzes are IMPOSSIBLE. I went to every single class, took copious notes, and did a fair amount of reading. However, NONE of that helps you out on what I've decided are prank quizzes.  Guessing does not help you on the quizzes either, so there's no way out. I do not know ANYONE who received a good grade in this course.  I ended up Pass/Failing as a senior (who needed to knock off the sciecne requirement) b/c of the grades I got on the first two quizzes. Galanter actually had bravado to offer to sign off on LATE DROPS because he realized how may people were going to fail the class!!! What a nice guy right! My roomate(who did more readings than I did), stuck it out and got a C! This class is an embaressment, and MUST be taken off the list for non-science majors.\n\nWorkload:\nThree IMPOSSIBLE quizzes.....the mean on most is less than HALF. Enjoy\n"
        },
        {
            "course_name": "Introduction to Computers",
            "review_date": "December 28, 2003",
            "review_content": "\nThis class was a major disappointment. I took a years worth of psychology in high school and after reading reviews about this class i figured it wouldn't be that bad. Boy was I wrong. Galanter is a very boring lecturer and his tests are extremely unfair actually impossible. I have no idea how some people managed to score 105 on them. I did a fair amount of reading and attended almost all the lectures but once it came time to take the test I was lost. I knew everything there was to know about classical conditioning but I couldn't answer the questions on the test about it. This class is definately not an easy A or B. I highly suggest not taking it. \nWorkload:\nDon't do anything just show up to the three tests and hope to get lucky by just picking. \n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "December 18, 2003",
            "review_content": "\nDo not take this class. I repeat DO NOT take this class. It is not an easy A. I got 5 points under the mean on every test and I ended up with a C+ in the class. Professor Galanter has no idea how to convey information to the class. Yes he is brilliant but like the pitfall of so many other professors on campus he can't teach. He babbles on about psychophysics this and psychophysics that so much you actually need another indtroductory course to figure out what he is saying. Yeah the quizzes are open book and open note and for some people open computer which I didn't think was fair when they pulled me aside and told me I was cheating. All in all, this class is awful. It may have been an easy A in the past but not anymore. This class royally sucks.\nWorkload:\nAs much as you want to do. There is a lot of reading but its really not required since the quizzes are impossible anyway. \n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "December 18, 2003",
            "review_content": "\nAfter reading the reviews on this class I figured it would be an easy way to knock off the science requirement. Boy was I wrong. This class ended up being one of the worst experiences of my life. The tests were open book but it didn't help much. I remeber finding the part of the book for the question and stil couldn't answer it right because of the way Galanter worded his questions and answers. There is no such thing as a huge curve either. Maybe in the past but not anymore. Galanter's lectures themselves are way to scientific for the typical undergrad to understand. Overall, I highly don't recommend taking this class unless you feel like getting f***ed \nWorkload:\nThree quizes, all open book and open note and for some open computer (this i didn't understand because they would accuse people of cheating while the person next to them was using google to find the answer to the test) Reading is useless because even if you do do it, you won't be able understand the questions he asks come exam time\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "December 08, 2003",
            "review_content": "\nOk, I went into this class thinking (like the other 200+people) that would be an easy A as well as covering fairly interesting subject matter. I can honestly say that I was not satisfied in either respect. I only skipped two lectures, but in retrospect, there really is no point in going to class becuase he is very boring (albeit he does make some funny jokes, if that's what you're into) and unnecessarily concentrates on his own field of psychophysics. Overall a very dry class with way too much reader assigned that I don't think anyone ever did. \nWorkload:\nYes, the three quizzes are open book, but before you shout for joy realize that this will not help you at all. Questions (which are supposed to be answered by a mysterious \"mark incorrect\" method\") are extremely tricky, confusing and 90% of the time rely on material that wasn't adequately discussed in class, and that reading would need to be done for. Also, you have to go to 3 hrs of psych experiments, which at the end turned out to be a sort of extra credit thing. I honestly don't know how many people will get an A in the class (after seeing my quiz scores, I wisely decided to play it safe and take the class p/f) but it is most certainly NOT an easy A. You've been warned.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "December 07, 2003",
            "review_content": "\nWent to five classes. All were interminable. Three tests - none easy. Open book, true, but doesn't really help; Galanter's questions are at once ridiculous and circuitous. No one I spoke to actually enjoyed the class.\nWorkload:\nThree open book tests. Not easy.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "January 20, 2003",
            "review_content": "\n\"Let me reiterate - this class is a joke.\"  \"I will love you just as much, regardless of the grade you get on my quiz.\"  \"I mean, who cares what you get in this course?  It's stupid!\"  - Eugene Galanter\nGalanter's class, half self depreciating comments and rediculus stories, half aimless rambles about quasi-psychophysics, is more like visiting hours with a semi-senile great uncle at the old age home than a class that fulfills the college science requirement.  Rest assured that you will learn something about psychology - mostly from the paragraph or two you read from the textbook in the middle of an open book test - but lectures consist of dead time between amusing and just plain bizarre comments.  Galater is senior faculty in his department, and he knows it.  He no more wants to be teaching an intro course than anyone in the class wants to be there.  Though it's more than obvious that he knows his stuff, he has a bit of trouble transmitting his knowledge, whether it's because he can't hear a question shouted out from the second row, can't remember how to derive a formula (\"Look in my book,\" he advised us, \"it's all there, written when I was a lot younger, a lot more coherent, and, if I'm remembering correctly, sober.\") . . . lectures aren't too necessary, but miss one and you risk missing one of his gems.  Overall, a class worth taking for the science requirement.  You'll walk in confused, stay confused throughout, and be even more confused, though pleased, when you receive your A.\nWorkload:\nThree open book quizzes, given in the most annoying style possible - mastering the \"cross off the right answer\" method might be the most difficult part of this course.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "January 20, 2003",
            "review_content": "\nThis class was one of the most enjoyable classes I've taken at Columbia.  Galanter is old and quirky, true, but he's a great professor. He really knows his stuff, and he loves to share it.  He's really opinionated and full of weird facts and stories.  His lectures are really entertaining.  If you're looking for a teacher that'll know your name and discuss your problems, he's not the one.  If you're looking to meet a real individual who has alot to offer if you're open to it, you've struck gold. \nWorkload:\nA breeze! Attend the lectures (you're guaranteed to learn something new) and scan the readings before the 3 exam.  If you're even only slightly intelligent, you'll do fine.  \n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "January 15, 2003",
            "review_content": "\nGalanter is one of the most amusing professors at Columbia.  I attribute this to his obvious descent into senility.  Once he couldnt derive his own equations on the board, despite the TAs calling out the answer to him.  In his defense, im sure he couldnt hear them all the way in the front row.  He also says global warming is ok, since Columbia is on a hill and should survive a rise in ocean levels.  That said, his lectures were cures for insomnia.  I have never seen more people openly sleeping and drooling before.  But his personal anecdotes are really funny and disturbing.  Evidently, the army considered using pidgeons to guide the controls for missiles in the 50s.  But if the class is too boring for you, its ok.  Galanter encourages people to not attend.  He also makes his quizzes open book, which helps alot (except for the poor delinquents who missed the class where the open book thing was announced).  The grading is cake, with probably the most generous curve i have ever seen.  It didnt seem like a curve,  more like him bumping up everyones grade by a letter.  All in all, definitely worth it for the science requirement. \nWorkload:\nWhat work?  Three open book multiple choice quizzes with the possibility of partial credit.  \n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "January 02, 2003",
            "review_content": "\nThis was a great class. Galanter is a very funny lecturer. Sometimes you may not have a clue what hes talking about, but that just adds to the fun. The workload is minimal. There are three multiple choice quizzes... and that's it. \nWorkload:\nReading, helps on the quizzes, but theres a huge curve anyway.\n"
        },
        {
            "course_name": "Introduction to Computers",
            "review_date": "December 14, 2002",
            "review_content": "\nWhen I first went to Galanter's class I thought he would drop dead every class. I went to every class until the first test got a B-, then didn't go to a single class, got a C- on the second test, and was able to get an A on the third test. I don't know how, but I got an A- in the class. You may think you're having a hard time, but it's so easy, and you don't have to go to the classes unless you want to see a hilarious old man. I have a long list of Galanter quotes, go to at least a few of the classes so you can hear crazy ravings of an old man. Just suck it up, don't miss any test and walk away with your A or B.\nWorkload:\nDepends on how much you really care. Some do all the reading, and others do none of it. Try to find a happy medium.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "December 11, 2002",
            "review_content": "\nOn the first day of class, Galanter said \"This is not a basic psychology course. If you want a normal psychology course I suggest you transfer to NYU or Staten Island Community College.\" Galanter was right - it wasn't a basic psychology course. He spent the first 3/4 of the semester talking about \"Psychophysics\" and thresholds, and while he likes to crack jokes every so often, he can get extremely boring. There were 200 people registered for the class - 100 people on any given day, and half of those people were sleeping in their chairs... another 25 either writing down his quotable quotes (such as: \"Trees are just big weeds\") or drawing pictures of him. Galanter's knowledgeable in psychology - especially in educational psychology & educational testing, but he presents his information in such a boring fashion that you can't appreciate his knowledge. Guest lecturers were a nice break from the banal lectures. Galanters test are \"mark incorrect\", which means that you can get partial credit if you can only identify 2 of the 3 incorrect answers. However, if you mark the correct answers as incorrect, you can wind up with a negative score. The curves on the quizzes are huge, and the final course grades are curved even more, so that the lowest grade given was a C, and there were A+s... Though I do not recommend this course, as I feel as if I learned no psychology from it, if you do take the class, I suggest that you attend his lectures, even if you sleep through them... many questions on the quizzes come right out of the babble that he says... Also, don't expect him to be very approachable - as far as I know he doesn't even have office hours. The TAs, however, proved to be somewhat helpful at least as far as telling us what was on the quizzes (don't study according to the syllabus). And while this course is extremely boring, it knocks off one of the science requirements.\n"
        },
        {
            "course_name": "Intro to Psychology",
            "review_date": "July 08, 2002",
            "review_content": "\nPeople say all kinds of bad things about this guy, but I haven't seen a more entertaining lecturer in this school. Yeah he's arrogant. He's curt and rude with students who ask questions. But thats why his lectures are so hilarious! The workload is a joke, he tells funny stories, his tests are graded on a great curve, he covers the material so you really learn psych with a critical viewpoint, and he makes fun of that guy you always wanted to choke for asking stupid questions. What more could you want? \nWorkload:\nThree multiple choice tests of equal weight along with pretty simple reading\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "May 13, 2002",
            "review_content": "\nThis was one of the most un-Columbia-ish class I've ever taken. The entire workload is 3 multiple-choice quizzes, and the curve is so huge that you'll think you're a Harvard student. Galanter takes a very history-based approach, so this is great for the non-science-type person who needs the class for the Core. Lectures are somewhat interesting and peppered with Galanter's crude sex jokes and anecdotes, but they often get boring when he goes off onto tangents. Few people bother showing up, anyway.\nWorkload:\n3 moderately hard multiple-choice tests. Don't worry about doing well on them, since the curve is massive. There's also opportunity for extra credit, and you have to go to 3 hours of experiments, but this is actually somewhat fun (you get to participate in weird mind and memory games and stuff). Only a little reading, but you're so not gonig to open the books even once, so it doesn't even matter than the reading (most of which is written by Galanter himself) is way above the head of a student taking his or her first psych class.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "January 21, 2002",
            "review_content": "\nI don't understand what the other reviewers didn't like about Galanter. His lectures were extremely interesting, and he explained them in great detail. His stories always related to the subject. I never missed his class because I didn't want to. He makes you read from four books, three of which were boring, but if you do the reading and study your notes you'll ace each exam. By ace I mean A+, because he gives those out. His system of letting you mark the incorrect answers is fabulous, you can get a lot of credit even if you don't know all the answers. Take his class if you can, his lectures are enthralling if you care at all about psychology.\nWorkload:\n3 quizzes (the last one is cumulative and in lieu of the final), a decent amount of reading.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "November 12, 2001",
            "review_content": "\nI like his lectures, and they have prepared me well for the quizzes, on which i've gotten As. This guy is NOT so bad.\nWorkload:\n3 quizzes at 30, 30, and 40 percents of your grade. No final.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "August 14, 2001",
            "review_content": "\nI wanted to like this class. Yet I found Professor Galanter's explanations indecipherable and when I looked around the other students seemed stunned by the rambling lectures, like deer caught in headlights -- uncertain which way to turn or whom to ask. The day before tests, teaching assistants would come and, at the last minute, explain what Galanter really meant, to prepare us for the multiple choice tests. Assistants explained that in general students tested below the C level and to compensate the tests were curved upwards. With that bit of information, I dropped the class. I found it absurd to spend a semester attempting to learn that which Galanter seemed either unwilling or unable to teach effectively. Also, his requirements that his own books be used as textbooks and that we memorize pages of forumulae seemed pointless.\nWorkload:\nIf you want to do well, you must have someone else explain it to you, creating more work than one would do if the class were taught more efficiently. A great deal of time must be spent memorizing.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "July 07, 2001",
            "review_content": "\nOkay, so you've read all the other Galanter reviews--so you get the picture. If you do choose to take his class, follow these rules: 1.) Go to the first class, sign the role sheet, find out the \"quiz\" days. 2.) come to class on the days of the \"quizzes\". 3.) pick a method for taking the incoherently difficult multiple choice quizzes (I personlly recommend \"eenie-meenie-minie-moe\") 4.) in a Zen-like manner, accept your B+ or A- at the end of the semester.\nWorkload:\nworks written by Galanter or works written by people with whom he has co-authored. trust me, do none of reading--you'll get the same grade regardless.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "April 09, 2001",
            "review_content": "\nEugene may be a little nutty sometimes, but his charm and wit make his class worth tolerating all of his idiosyncrasies. He firmly asserts that for $38,000 per annum, one ought to get more from a class than a reiteration of the text. Indeed, Galanter will give you great stories, bad jokes, and some insights into the science of psychology. In the end, if you need an intro psych class or a science credit, this is the way to go. Galanter is, at the very least, a fun old fart.\nWorkload:\nThe quizzes (3) are cake. If you bomb this stuff, you're either incredibly lazy (in which case it's your own damn fault) or an idiot (in which case I humbly ask that you leave CU).\n"
        },
        {
            "course_name": "W3290 Human Motivation and Political Structures",
            "review_date": "April 09, 2001",
            "review_content": "\nGalanter is insightful, the class is amusing, and watching an ass-clown get humiliated is priceless. (see this definition of \"ass-clown.\") If you're into political theory and like psych, the class is fun and easy. Galanter sits back, lets the students do most of the teaching, and makes frequent comments from the peanut-gallery. But if you require an organized syllabus, forget about this one. Galanter lets the course wander where he and the students want it to go. My only objection was to some of the other members of the class. A few morons can really ruin a small class, though Galanter occasionally enjoys putting an ass-clown in his place. Rolling eyes, scrunched noses, and sarcastic retorts were commonplace. A word to the wise: take this after you have taken his intro psych class and completed CC (unless you have a prior experience with most of the works).\nWorkload:\nMidterm, 10 page paper, \"technical exam\"\n"
        },
        {
            "course_name": "W3290 Human Motivation and Political Structures",
            "review_date": "April 09, 2001",
            "review_content": "\nGalanter is insightful, the class is amusing, and watching an ass-clown get humiliated is priceless. (see this definition of \"ass-clown.\") If you're into political theory and like psych, the class is fun and easy. Galanter sits back, lets the students do most of the teaching, and makes frequent comments from the peanut-gallery. But if you require an organized syllabus, forget about this one. Galanter lets the course wander where he and the students want it to go. My only objection was to some of the other members of the class. A few morons can really ruin a small class, though Galanter occasionally enjoys putting an ass-clown in his place. Rolling eyes, scrunched noses, and sarcastic retorts were commonplace. A word to the wise: take this after you have taken his intro psych class and completed CC (unless you have a prior experience with most of the works).\nWorkload:\nMidterm, 10 page paper, \"technical exam\"\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "December 31, 1999",
            "review_content": "\nThe other review of this guy says it all: Galanter is a source of fun, but not enough to make up for his tedium.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "December 31, 1999",
            "review_content": "\nAt first, I really thought this would be a great class--Professor Galanter seemed like a funny guy. But as time passed, I realized that his funniness was the exception, not the rule. Most of the time, he is incredibly boring. Many people hardly ever bother going to class. Also, it doesnt help that the material is not in the least bit interesting. The texts are too long, and seem to be books that he authored or co-authored, or that were authored by authors with whom he co-authored other books. No doubt, Professor Galanter is incredibly talented in this field. I am often impressed that he is able to lecture in great detail mostly without referring to notes. But the class seems not to be about psychology, but about topics that he is interested in, which are mostly dry, incredibly boring statistical analyses of basic psychological processes. I can't remember the last time that I went through a whole class period without falling asleep once. Usually the only thing that keeps me awake is my metaphysical ponderings on why exactly I am sitting in that gigantic surreal lecture hall--the information that Im hearing isn't useful for anything, and by God it certainly isn't interesting. So why am I there? And of course, there isn't any good answer to that question. So I usually just give up on thinking about it and go back to sleep.\nWorkload:\n3 quizzes (generous curve), participation in three hours worth of psychological experiments. Insane amount of reading that basically no one ever does.\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "December 31, 1999",
            "review_content": "\nProfessor Gallanter's ability to lecture is unrivaled in my experiences here at Columbia. He did what I had initially thought of as unthinkable: he took psychology and almost made me believe it's a science. It's a good thing the class ended when it did, otherwise he might have had me fooled. Professor took dry, almost unintelligable material and made it interesting - even to an engineering student. Some people in the class considered Professor a \"dinosaur\" or \"relic of the past\"; I'd heard more than one or two frustrated mumbles during the course of any lecture, leading me to think that psychology students had begun to feel hostility towards a man who tried his damnedest to have the course live up to its name. So, if you are willing to read a few pages a week, attend lectures that inspire awe in whoever remains awake throughout them, and are willing to deal with 3 multiple choice quizzes in which even simply crossing out two wrong answers per question can get you a decent grade (and it takes little more to do really well), then this class is definitely worth your time.\nWorkload:\n3 quizzes, no final exam\n"
        },
        {
            "course_name": "Science of Psychology",
            "review_date": "December 31, 1999",
            "review_content": "\nIf you're interested only in satisfying your science requirement, this is a great class to do it in. The reading is relatively light and if your TAs are good the three \"quizzes\" that are given are fairly easy. If you want to learn about psychology, however, you had better look elsewhere. Galanter isn't interested in teaching the class - his lectures are often a collection of personal anecdotes and name dropping that take up only two thirds of the alotted lecture time. He has no plan for teaching the class and chooses to lecture on whatever happens to strike his fancy. He does not cover a lot of the things a tradition psych class might and spends a disproportianate amount of time on some extremely boring areas that are the focus of his research. Although one shouldn't expect to learn a whole lot about psychology, on the whole the class is a reasonably pleasant experience.\nWorkload:\nThree relatively easy \"quizzes\" with a gentle curve in the B to B+ range. The last quiz is given on the last day of classes, so its one less thing to worry about during finals.\n"
        }
    ]
}