{
    "prof_info": [
        {
            "prof_name": "Taffeta Elliott",
            "prof_id": 13078,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Frontiers of Science",
            "review_date": "January 17, 2015",
            "review_content": "\nDr. Elliott is super nice, generous, and always tries her best to help out her students. She's very helpful during office hours and always sits down with you to patiently work out your questions. I would also say she's a pretty lenient grader. I really enjoyed my individual, one-on-one interactions with her. That being said, I came out of the discussion sections usually feeling bored, confused, or frustrated. Dr. Elliott is not the most riveting lecturer, her voice bordering on monotonous, and I would often find myself zoning out or falling asleep. She is quite a reticent person, and that made it look like she lacked confidence in herself and the material she was presenting (except for the neuroscience unit, which is her area of specialty). I don't think she actually didn't know what she was talking about because she does seem quite smart, but her hesitance definitely did not clarify which information we needed to know most and encouraged an awkwardly silent atmosphere. Then she would halfheartedly call on people to participate, which led to even more halfhearted responses from the students. Sometimes it could get pretty miserable.\nI feel bad talking shit about her because I could tell she was trying her best to make the class worth our time, and I really appreciate the fact that she brought us bagels for breakfast on the last day of class. Clearly she cares about her students and wants to see them succeed. However, I would advise you to switch sections if you get placed into her class. There are many other frosci instructors who will make your discussion sections much more interesting and still be helpful outside of class.\nWorkload:\nWeekly:\n- Homework due in her office by 2pm Friday. (completion)\n- Post questions about the lecture content on Piazza by 9am Tuesday.\nOther:\n- Quizzes (completion)\n- Term paper, 1200 words\n- Midterm\n- Final (the curve is sweet)\n"
        }
    ]
}