{
    "prof_info": [
        {
            "prof_name": "Mary Hurley",
            "prof_id": 3185,
            "total_reviews": 3
        }
    ],
    "reviews": [
        {
            "course_name": "Critical Reading, Critical Writing",
            "review_date": "October 27, 2009",
            "review_content": "\nMary Kate is a cool cat, very laid-back and a lover of English. You don't have to read ANYTHING to go to her discussion section and enjoy it. Sometimes, it would get a little long and boring (it was 1 hour, 50 minutes straight), but the class--on the whole--was nevertheless enjoyable. She graded papers fairly easily and was extremely interested in seeing her students explore and reframe the criticism texts assigned. For the final paper, we had to analyze critically (with any of the various critical -isms we studied) any of the literary works we read: a neat, open-ended assignment that provides a great culmination to an enlightening course.\nWorkload:\nAbout 130 pages or so per week--although you don't have to do ANY of it if you don't want to; two 3-6 page papers; one 7-10 page final paper (or a 3-5 page paper plus an optional final exam). Pretty easy, good class.\n"
        },
        {
            "course_name": "Critical Reading, Critical Writing",
            "review_date": "August 18, 2009",
            "review_content": "\nAHH STAY AWAY!!! Mary Kate is totally unqualified to run any kind of discussion of literature. I realize CRCW is already a terrible class, but she made is so much worse. The textual analyses she presented were totally shallow and contrived--she pretty much presented reading on a middle school English class level, talking about class power and authorship. \nClass sessions were painful. No one was at all engaged in the material, mostly because the questions Mary Kate posed to the class were simplistic and meaningless.\nCRCW is a very theory-based class, but Mary Kate exacerbated this by being concerned only with recapitulating theoretical texts we read. There was no focus on students' debating their opinions on the theory, or even talking about the theories' advantages/drawbacks (in fact, she cut off discussion when it entered this realm). The paper assignments were about applying theory to a fictional text, again precluding what you think about the theories. This grad student is so buried in theoretical bulls**t she hasn't seen sunlight in years. \n\nWorkload:\nThe usual amount of reading for an English seminar, both books and theory. Three papers + one longer final paper. Paper grading was very arbitrary. \n"
        },
        {
            "course_name": "University Writing",
            "review_date": "March 05, 2007",
            "review_content": "\nVery nice. Calm, funny, tries very much to be enthusiastic. Brings food sometimes. Very dedicated to helping you improve your writing. Won't pick on you. Let's everyone just be. But don't be late to class.\nWorkload:\nNot too bad. Seed texts and supplementary texts are well chosen, not too long. 3 essays, each worked on for about a month to produce an exploratory draft (brainstorm), formal draft, and final draft. Final essay is a research paper, 10 pages, only one that's tough.\n"
        }
    ]
}