{
    "prof_info": [
        {
            "prof_name": "Guinia Gatta",
            "prof_id": 11231,
            "total_reviews": 6
        }
    ],
    "reviews": [
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 22, 2014",
            "review_content": "\nAfter reading the other two reviews posted by members of my CC class fall semester, I feel compelled to write another one to do justice to Professor Gatta and her class, which I believe the other two reviews failed to do.\nYes, the class is a lot of work and a lot of reading...welcome to Columbia, if you haven't realized already for the past year. Gatta laments the fact that she already cut the readings substantially, and frankly, I don't understand how people can claim that they're not understanding the main gist of a work if 1) the \"required\" reading gets cut even more and 2) you don't actually read. \nThat being said, I don't think class dynamics (a pretty small sample size of 20 or so people and varies) should wholly determine  how you judge Gatta ad hominem. Yes, our class last semester had a pretty disruptive student, and for the first couple of weeks that student monopolized discussion to the point where our discussions weren't productive and Gatta didn't seem to really do anything about it. I think later on in the semester, \"Ragemonster\" sobered up, and discussions became slightly more profitable. \nI think Professor Gatta, unlike other professors, really takes her students' comments to heart. At the behest of one student, she changed the weight of the final and midterm exams, while another student's suggestion prompted her to allow us to respond to each other's posts and have that count as our \"mandatory\" weekly post. Gatta incorporates our weekly posts (which, I will concede people do bullshit) into her lectures because she thinks that those are the topics that we as a class may be interested in or have questions about. She sincerely tries her best to help her students make the most out of their CC experience, so I wouldn't let the actions and words of some students (\"Ragemonster,\" par exemple) affect your overall impression of Gatta or her class. Furthermore, by allowing students to lead a 15-minute class discussion on a work, Gatta basically creates an opportunity for a student to take \"ownership\" of a text, allowing him or her to be that expert and come up with discussion questions, which I believe helped augment my understanding of the text while simultaneously giving me insight into my classmates' interpretations and thoughts. \nIn other words, I feel like Gatta's approach to leading the class put a lot of direction and decision-making in the hands of the students; therefore, if someone acts more like a defective cog in the CC class machine, the whole shebang falls apart, and I think that's what ultimately happened last semester. To be successful in this class, one needs to take responsibility for one's own learning. Gatta does her best to make herself available to answer students' questions in class, after class, or during office hours, and I found her honest suggestions on how to improve my shitty 2nd progression very helpful. So to conclude, do the reading so you won't feel bored or lost in class discussion; otherwise, just don't complain. \nWorkload:\nI'm posting this semester's workload, since Gatta took her evaluations seriously and substantially changed the work/grading for this semester.\n2 essays (2000 words, 3500 words, worth 35% total) --> a drop from last semester's 3 essay progressions of increasing length as well as a autobiographical essay\n1 midterm (worth 20%)\n1 final (that has 1 less essay than last semester's final, worth 20%)\n1 creative assignment (worth 5%)\nclass engagement (**see below, worth 20%)\n**This semester she scrapped the weekly discussion posts as well as the 15-minute peer-led discussions; instead, we sign up for a text we're interested in and just come up with questions for that class day that we e-mail her about. \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "January 05, 2014",
            "review_content": "\nProfessor Gatta makes for a disappointing semester. While I respect her off-putting positive energy in the class, she is completely out of touch from her students.\nShe runs class in an artificial manner, favoring lengthy digressions over natural discussion. Over-reliant on weekly courseworks posts for class discussion that are often bullshitted, this friendly Italian lady chooses to lecture on and on without end. Questions are followed with painful silence, followed by an answer from one of four students who speak. The cherry on top is your 3 minute break in the middle of a 2 hour class, often shaved down to \"a few seconds.\"\nShe was also condescending towards certain students and didn't have the balls to quiet down an especially disruptive student.\nIn general, it was excruciatingly frustrating to be in a class with a teacher who likes to talk about how open and fun CC is while at the same time sticking rigidly to a grading curve and not allowing for fruitful intellectual exploration.\nConsidering that there are many shittier options for CC, she's not terrible but should be avoided - like Halal food.\nWorkload:\nWay too many small assignments. A personal introductory paper like you wrote in middle school. 3 CC papers of increasing length. Final and midterm that she graded in comparison \"to how much other students wrote.\" Weekly coursework posts. Creative project, also like the type you would do in middle school.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 09, 2013",
            "review_content": "\nProfessor Gatta is boring, rude and not a great teacher. Class is never too terrible but she bases the entire class off of posts that she requires students to complete the night before class. Since most people kind of BS these posts, class discussion is really dry. She doesn't do much to push the class beyond these posts, and she is completely uninspiring. \nShe also makes rude comments quite often. She calls certain students smart while acknowledging that some students are \"less talented\". Grades are based off of her perception of you in the first three weeks of classes, so if she considers you to be smart she will keep you in the A range, otherwise you'll be struggling to be pleased with your grade. Although she admits to not liking the idea of giving grades she follows the grading curve with unwavering conformity. She grades all sorts of tiny things that she considers to be part of your grade, for instance she gives individual grades to each online posting even though she makes it seem like a casual way to get ideas flowing. \nUnfortunately, she lets certain students monopolize class discussion therefore discouraging most other students to participate. She had no clue this was happening and blames it on the majority of students rather than recognizing the she would have more success in class if she gave everyone an equal opportunity to speak.\nOverall, not a great CC experience. Needless to say more than half of the class has already transferred out of the class next semester. \n\nWorkload:\nPostings on courseworks for class, 4 papers of increasing length, creative project, midterm and final \n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 20, 2012",
            "review_content": "\nProfessor Gatta is good. She is not amazing, but she is above average. She has read a lot of political theory, and usually approaches text more as a political scientist than as a philosopher, which may or may not be to your liking. She is a very fair grader, and gives good (though again, not amazing) advice on your writing. She's very approachable, and is willing to help you as much as she can on your writing, etc. She could lead discussion a little better, however. There were a few gems in the texts we were reading that passed unnoticed (we didn't discuss the allegory of the cave in plato...!), which was a shame.\nAs I said, not amazing, but good.\nWorkload:\nUsual readings, maybe slightly shorter. 3 papers (1000wrds, 2000, 3000). 1 oral presentation. not too bad.\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "May 10, 2012",
            "review_content": "\nI actually had a different experience than the previous reviewer. I thought that she was a knowledgeable woman who did stimulate discussion in the class. There were definitely some classes that were more boring and awkwardly silent with the same people talking all of the time, but a lot of the classes had really interesting discussions. However, I will say that this grading is quite sporadic sometimes, with papers I wrote in an hour getting A's and papers I spent a long time on getting much lower grades. I actually thought she spent a lot of time grading our papers, which was nice since she did make a lot of comments in the margins. As a person, she is also really nice and very easy to talk to. \nWorkload:\n4% - 4 quizzes\n4% - 4 Index Cards\n12% - for each thought piece, 4%, 3 of them, each 3-4 pages\n15% - final paper\n10% - in class presentation\n20% - midterm\n10% - class presentation\n25% - final\n"
        },
        {
            "course_name": "Contemporary Civilization",
            "review_date": "December 07, 2011",
            "review_content": "\nGuinia Gatta is a knowledgable and nice lady, but she is an outstanding bore.  Until she said that it was not okay for students to fall asleep in class, there were always at least 3-4 students dozing off or sleeping, which is pretty incredible. She also is not good at conversations, and she does not make an effort to be inquisitive or to get to know the students better. She teaches CC as a lecture class, which might be because it is her first semester at Columbia and outside of a state school, I think, so that can't be helped.  She tries to force-feed the students the material and does not have faith in our ability to grasp the subject independently, and seems to not take our ideas seriously and not engage with us in a more meaningful discussion. Instead, she just tells us what a book is saying for two hours, and asks questions which are not enlightening or interesting.  She also spends a lot of time on background information, which makes it appear as though her ability to actually extrapolate the material and make it relevant or more interesting is quite shallow. She does read the books, and she does have a solid understanding of what the authors say, but her understanding is very narrow and closed-minded. I feel like I am reading an article on the Stanford Encyclopedia of Philosophy. The author is saying one thing and one thing alone, nothing else. She is quite lenient, which is nice, but if she does not agree with what you are saying in your essay, she will completely dismiss it and not make an attempt to help see what you are saying, but merely will make the same point over and over as if that is enough to counteract the entire argument and close herself off to what the argument is saying.  No meaningful feedback on my essays or my essay stile.  Not very happy with the way she  critiques essays, also not happy with the grading she gives, although that might just be arbitrary.  I do not recommend her as a CC proffessor, and I will not be going back to her class next semester.\nWorkload:\nSilly index cards during class, which say what we did in class, what our participation was, and any questions we had. No feedback on these, just checks.\nThree 'thought pieces,' two of 5-6 pages, one final one of 8-9.  All must be on books we read in the past week or two, and there is no real deadline (just sometime before the midterm, and then sometime before the final).  No essay questions, you have to come up with your own argument, which is interesting and challenging.\nA couple other assignments, not too much.  She understands that the reading is a lot, and so she reduced much of it, which is nice.\nOverall not too much work.\n"
        }
    ]
}