{
    "prof_info": [
        {
            "prof_name": "Jesus Rodriguez-Velasco",
            "prof_id": 6351,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Inventing the Political Mind  ",
            "review_date": "August 11, 2010",
            "review_content": "\nI took two classes with Professor Velasco and absolutely LOVED both of them.  He is seriously one of the most interesting professors that I've ever had the pleasure to study with.  His Senior Seminar was very intense with a lot of reading due each week, but it was such a great and encouraging space to share ideas.  I really felt that I was creating a community with the other students in the class - I was never afraid to say anything that I needed to, the class was an extremely high level intellectually but very comfortable and friendly on a conversational level.  And instead of how most seminars work, the students did 90% of the talking and Professor Velasco would rarely just lecture on the readings, instead allowing the students and our ideas dictate the format of the class, interjecting here and there.\nHaving been so pleased with the work Professor Velasco pushed me to do in his seminar, I took another class that he taught the following semester.  The workload was intense with the weekly readings and the papers that were due, but I have never produced better work then in that class.  I really felt that Professor Velasco expected a ridiculously high level of my work and I was surprised when I (almost) rose to meet it.  I never knew I had it in me!\nAll in all, Professor Velasco is a wonderful, wonderful, wonderful teacher who pushed me to think and write better than I have in any past courses I've taken.  The readings are fascinating and he even throws in a few jokes!  I owe a lot of how my critical and investigative writing in both Spanish and English have improved to what I learned from this gem of a Professor!\nTAKE ANYTHING HE TEACHES!!\nWorkload:\nWeekly readings, 3 short papers, 1 final paper\n"
        }
    ]
}