{
    "prof_info": [
        {
            "prof_name": "Chana Etengoff",
            "prof_id": 12726,
            "total_reviews": 5
        }
    ],
    "reviews": [
        {
            "course_name": "Developmental Psychology Lab",
            "review_date": "December 14, 2016",
            "review_content": "\nWAY TOO MUCH WORK. Every week there is something due, though at the end of the semester I was a bit relieved knowing that I've already written some parts of the paper. At least not all the weekly assignments were useless!\nProf. E herself is caring and accommodating to different learning needs, but at times her condescending tone is hard to miss. Like some previous reviews mentioned, she tends to treat you like middle schoolers but somehow doesn't always make herself super clear. \nAnd lastly, no, you will not spend all your time watching cute toddlers walking around. \nWorkload:\ntoo much, which is true for most psych labs.\n"
        },
        {
            "course_name": "Developmental Psychology Lab",
            "review_date": "August 17, 2015",
            "review_content": "\nStudents should expect to work hard and learn a lot in Professor Etengoff's Developmental Psych Lab. While some of the assignments may seem insignificant, she is actually teaching very valuable skills and lessons through the assignments. She is a remarkably sensitive and kind person and is happy to work with students on personal needs. She cares about the success of her students and will put in extra time if a student cares enough to put in the effort themselves. Students shouldn't expect an easy A from this class, yet it isn't difficult to succeed if you do the assigned work. She is very specific about what she wants, which is remarkably helpful. She creates a nice dynamic in the classroom which fosters teamwork and encourages collaboration. \nWorkload:\nVery reasonable - a number of smaller assignments and a final paper. She is available to review parts of your paper prior to the due date. Save yourself by doing the smaller assignments because those points add up quickly. \n"
        },
        {
            "course_name": "Psychology of Personality (w/ or w/o lab)",
            "review_date": "November 20, 2014",
            "review_content": "\nProfessor Etengoff can come off as very friendly and smiley, but once you have enough exposure to her, her condescension becomes increasingly apparent. For some reason, she speaks to her students as if we are toddlers yet gives us an obscene amount of work. Each week, you are given an assignment that will add to your final paper, yet she gives almost no direction for the final paper itself, except a long list of extremely picky details. \nWorkload:\nStupidly heavy, especially when considering the fact that she explicitly said that she would try to give us the work load you might expect from a 1.5 credit course. \n"
        },
        {
            "course_name": "Developmental Psychology",
            "review_date": "February 11, 2014",
            "review_content": "\nThis is a review for the LAB.\nProfessor Etengoff seemed nice on the first day of class, but as the class proceeded she became extremely irritating. She treated us like we were middle school students, shushing us and telling us to \"read silently\" whenever anyone uttered a word. The lab required us to observe the Toddler Center, and so really limited what we could do with the final research report. Prof. Etengoff repeatedly told us we were doing super important, \"real\" research, but watching kids and taking down our arbitrary observations is hardly anything remotely significant in terms of adding to the body of research that's already out there. For someone who's NEVER done any kind of scientific research, the lab certainly walks you in painful detail of how to do it.... Prof. Etengoff obsesses over the most minute things (e.g. whether you get rid of the gridlines on your graphs or title your charts just perfectly; the syllabus even outlines exactly how many mins you should spend talking about X topic and where/who to look at when you're presenting your project).\nI made an A at the end of the course, but only because I put in way more work than I should have.\nWorkload:\nThe workload was crazy for a 1.5 credit lab course. Extremely detailed assignments.\n"
        },
        {
            "course_name": "Psychology of Personality--Lab",
            "review_date": "December 07, 2013",
            "review_content": "\nEtengoff is very engaging--she's a great lecturer and definitely knows how to engage students with the subject matter. She cares a lot about students and is very willing to help all students who reach out to her. Her \"no nonsense\" approach to handling students is very, very, VERY refreshing: Etengoff is very honest to students about the quality of their work and she also sends isn't afraid to let students know when their work/effort/whatever is substandard--you'll get a lot of helpful feedback from her. Etengoff is both supportive and rigorous at the same time. She genuinely wants everyone to do well and offers guidance to anyone who seeks her out, but she will make you work for that A. (I went to her office hours and emailed her frequently and, at the end of the term, she offered to review my final research paper, which is only something she offered to students who consistently showed throughout the semester that they cared about the class.)\nYou might hear some not-nice things about Professor Etengoff from other students, but don't pay attention to those. Many people going into psych lab have an expectation that the class will be an easy A and that it will be easy to trick or take advantage of a new, young professor from CUNY. But Professor Etengoff has very little tolerance for that kind of bullshit, which is frustrating to privileged students who are used to having A's and extensions handed to them on a silver platter. Professor Etengoff is the friendliest professor ever, but ONLY if you show her, the class, and the subject matter a degree of respect.\nAsides from Professor Etengoff, the lab was okay. Personality psychology, in my opinion, isn't super exciting, but the lab helped to contextualize aspects of the lecture. Discussions about the ethics and implications behind classical, well known studies were also very interesting.\nWorkload:\nWeekly assignments that cumulate in a final research project and presentation. Do the smaller assignments, even though they're not worth that much of your grade, because they will seriously help you with the final project/presentation--I wrote my entire final paper based off of the worksheets.\n"
        }
    ]
}