{
    "prof_info": [
        {
            "prof_name": "Gale Berninghausen",
            "prof_id": 13033,
            "total_reviews": 1
        }
    ],
    "reviews": [
        {
            "course_name": "Masterpieces of Indian Art and Architecture",
            "review_date": "December 12, 2014",
            "review_content": "\nThis is by far the best global course class I have ever taken at Columbia (tbh though that's not saying much). Berninghausen is a good teacher, though a little green behind the ears (this is her first ever class), and is spunky, charismatic and passionate about both Art History and Indian Art. She made class lively and interesting enough that I never wanted to skip, and actually seemed to care about her students. She was always willing to meet up and talk about any concerns or questions you had about the class, material, or just life in general.\nI want to make this a fair review, so it must be noted that there are a few people who would disagree with me. The class was an interesting mix of Art History majors and others (about 50/50), and a couple of the non majors felt that Berninghausen favored the majors. This is a tricky suggestion to unpick, partly because of Berninghausen's level of investment in the class (which was very high) and her personality type / teaching style, which is quite personal (we learned a lot about her trips to India, her Hindu husband, her wedding, her childhood, etc.). So while I'd say that it's true that Berninghausen is not a purely objective, calculating person, and it's probably true that she did favor some of the students, I don't think the divide was between the Art History majors and the non-Art History majors, but between those who showed interest/enthusiasm and those who did not. For instance, she definitely graded you higher if you went in to talk to her about your paper before writing it. I think it's just that there's a correlation between people interested in this [Art History] class, and people majoring in Art History.\nI'm not trying to defend her: it's totally unfair that she was biased in this way, and you shouldn't be expected to act enthusiastic about something if you are not (and it should certainly not impact your grade). It's just something to be aware of. I think it can be an enjoyable class for all majors (it really wasn't heavy on the Art History). I hadn't taken a non-Western art class before this but really enjoyed it. The material we looked at and discussed is fascinating and I feel like I now have a basic understanding of the art, history, geography, religion and politics of a country I knew absolutely nothing about before. \n\nWorkload:\nThere was a decent amount of reading (particularly at the beginning of the semester), but Berninghausen was aware this was a problem. I read a few, skimmed most, and skipped some entirely and was absolutely fine.\n2 papers (one 3pg, one 5pg)\n1 midterm\n1 final (usual stuff: terms, IDs, comparisons, longer essay)\nThe exams were easy: she wasn't fussy about dates and didn't ask any obscure IDs.\n"
        }
    ]
}